[Killed] Block removal mutation
src/Endpoints/Models/CurrentUser.cs:7:3
     public int UserId { get; set; }
 
     public CurrentUser(int userId)
-  {
-    this.UserId = userId;
-  }
+  {}
 }
killedBy: QuizGameServiceTest.UserDoesExistTest; test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest
