[Killed] Block removal mutation
src/Endpoints/Models/GameJob.cs:8:3
     public int JobId { get; set; }
     
     public GameJob(int userId, int jobId)
-  {
-    this.UserId = userId;
-    this.JobId = jobId;
-  }
+  {}
 }
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest
