[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:18:9
         // - "PositionTypes": A comma-separated list of roles to filter by (e.g., "front-end", "back-end").
         // - "EmploymentTypes": A comma-separated list of types of contract to filter by (e.g., "full-time", "part-time").
         // If no filters are provided, all jobs will be returned.
-        routes.MapGet("/api/jobs", (HttpContext context, IJobService jobService) =>
-        {
-            var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            return jobService.GetJobs(filters.Count > 0 ? filters : null);
-        })
-            .WithName("GetJobListings")
-            .WithTags("Jobs")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint retrieves a sublist of a user's saved jobs within the list of jobs based on the provided filters. 

[NoCoverage] Equality mutation
Back-end/src/Endpoints/JobEndpoints.cs:21:39
         routes.MapGet("/api/jobs", (HttpContext context, IJobService jobService) =>
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            return jobService.GetJobs(filters.Count > 0 ? filters : null);
+            return jobService.GetJobs(filters.Count >= 0 ? filters : null);
         })
             .WithName("GetJobListings")

[NoCoverage] Conditional (true) mutation
Back-end/src/Endpoints/JobEndpoints.cs:21:39
         routes.MapGet("/api/jobs", (HttpContext context, IJobService jobService) =>
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            return jobService.GetJobs(filters.Count > 0 ? filters : null);
+            return jobService.GetJobs((true?filters :null));
         })
             .WithName("GetJobListings")

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:32:9
         // The filters are the same as those used in GetJobs.
         // If no filters are provided, all of the user's saved jobs within the jobs list will be returned.
         // UserId is extracted from the user's cookie. This is required to identify the user whose saved jobs are being requested.
-        routes.MapGet("/api/jobs/saved/sublist", (HttpContext context, IJobService jobService) =>
-        {
-            var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            var userId = context.User.FindFirst("UserId")?.Value;
-            filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return jobService.GetJobsSavedSublist(filters.Count > 0 ? filters : null);
-        })
-            .WithName("GetSavedJobListings")
-            .WithTags("Jobs")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint retrieves the saved jobs for a user based on the provided filters. 

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:32:23
         // The filters are the same as those used in GetJobs.
         // If no filters are provided, all of the user's saved jobs within the jobs list will be returned.
         // UserId is extracted from the user's cookie. This is required to identify the user whose saved jobs are being requested.
-        routes.MapGet("/api/jobs/saved/sublist", (HttpContext context, IJobService jobService) =>
+        routes.MapGet("", (HttpContext context, IJobService jobService) =>
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());

[NoCoverage] Null coalescing mutation (remove left)
Back-end/src/Endpoints/JobEndpoints.cs:36:52
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userId = context.User.FindFirst("UserId")?.Value;
-            filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
+            filters[AppConfig.FilterKeys.USERID] = "0";
             return jobService.GetJobsSavedSublist(filters.Count > 0 ? filters : null);
         })

[NoCoverage] Conditional (true) mutation
Back-end/src/Endpoints/JobEndpoints.cs:37:51
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userId = context.User.FindFirst("UserId")?.Value;
             filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return jobService.GetJobsSavedSublist(filters.Count > 0 ? filters : null);
+            return jobService.GetJobsSavedSublist((true?filters :null));
         })
             .WithName("GetSavedJobListings")

[NoCoverage] Conditional (false) mutation
Back-end/src/Endpoints/JobEndpoints.cs:37:51
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userId = context.User.FindFirst("UserId")?.Value;
             filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return jobService.GetJobsSavedSublist(filters.Count > 0 ? filters : null);
+            return jobService.GetJobsSavedSublist((false?filters :null));
         })
             .WithName("GetSavedJobListings")

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:48:9
         // The filters are the same as those used in GetJobs.
         // If no filters are provided, all of the user's saved jobs will be returned.
         // UserId is extracted from the user's cookie. This is required to identify the user whose saved jobs are being requested.
-        routes.MapGet("/api/jobs/saved", (HttpContext context, IJobService jobService) =>
-        {
-            var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            var userId = context.User.FindFirst("UserId")?.Value;
-            filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return jobService.GetSavedJobs(filters.Count > 0 ? filters : null);
-        })
-            .WithName("GetSavedJobs")
-            .WithTags("Jobs")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
         
         // This endpoint retrieves the total count of jobs based on the provided filters.

[NoCoverage] Conditional (true) mutation
Back-end/src/Endpoints/JobEndpoints.cs:53:44
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userId = context.User.FindFirst("UserId")?.Value;
             filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return jobService.GetSavedJobs(filters.Count > 0 ? filters : null);
+            return jobService.GetSavedJobs((true?filters :null));
         })
             .WithName("GetSavedJobs")

[NoCoverage] Equality mutation
Back-end/src/Endpoints/JobEndpoints.cs:53:44
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userId = context.User.FindFirst("UserId")?.Value;
             filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return jobService.GetSavedJobs(filters.Count > 0 ? filters : null);
+            return jobService.GetSavedJobs(filters.Count >= 0 ? filters : null);
         })
             .WithName("GetSavedJobs")

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:55:23
             filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
             return jobService.GetSavedJobs(filters.Count > 0 ? filters : null);
         })
-            .WithName("GetSavedJobs")
+            .WithName("")
             .WithTags("Jobs")
             .WithOpenApi()

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:63:9
         // This endpoint retrieves the total count of jobs based on the provided filters.
         // The filters are the same as those used in GetJobs. 
         // If no filters are provided, a count all jobs will be returned.
-        routes.MapGet("/api/jobs/number", (HttpContext context, IJobService jobService) =>
-        {
-            var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            return jobService.GetNumberOfJobs(filters.Count > 0 ? filters : null);
-        })
-            .WithName("GetNumberOfJobs")
-            .WithTags("Jobs")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint retrieves the total count of the user's saved jobs based on the provided filters.

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:63:23
         // This endpoint retrieves the total count of jobs based on the provided filters.
         // The filters are the same as those used in GetJobs. 
         // If no filters are provided, a count all jobs will be returned.
-        routes.MapGet("/api/jobs/number", (HttpContext context, IJobService jobService) =>
+        routes.MapGet("", (HttpContext context, IJobService jobService) =>
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());

[NoCoverage] Conditional (true) mutation
Back-end/src/Endpoints/JobEndpoints.cs:66:47
         routes.MapGet("/api/jobs/number", (HttpContext context, IJobService jobService) =>
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            return jobService.GetNumberOfJobs(filters.Count > 0 ? filters : null);
+            return jobService.GetNumberOfJobs((true?filters :null));
         })
             .WithName("GetNumberOfJobs")

[NoCoverage] Conditional (false) mutation
Back-end/src/Endpoints/JobEndpoints.cs:66:47
         routes.MapGet("/api/jobs/number", (HttpContext context, IJobService jobService) =>
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            return jobService.GetNumberOfJobs(filters.Count > 0 ? filters : null);
+            return jobService.GetNumberOfJobs((false?filters :null));
         })
             .WithName("GetNumberOfJobs")

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:69:23
             return jobService.GetNumberOfJobs(filters.Count > 0 ? filters : null);
         })
             .WithName("GetNumberOfJobs")
-            .WithTags("Jobs")
+            .WithTags("")
             .WithOpenApi()
             .RequireAuthorization();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:77:9
         // The filters are the same as those used in GetJobs.
         // If no filters are provided, a count all of the user's saved jobs will be returned.
         // UserId is extracted from the user's cookie. This is required to identify the user whose saved jobs are being requested.
-        routes.MapGet("/api/jobs/saved/number", (HttpContext context, IJobService jobService) =>
-        {
-            var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            var userId = context.User.FindFirst("UserId")?.Value;
-            filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return jobService.GetNumberOfSavedJobs(filters.Count > 0 ? filters : null);
-        })
-            .WithName("GetNumberOfSavedJobs")
-            .WithTags("Jobs")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint retrieves all of the programming languages that jobs may have listed.

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:77:23
         // The filters are the same as those used in GetJobs.
         // If no filters are provided, a count all of the user's saved jobs will be returned.
         // UserId is extracted from the user's cookie. This is required to identify the user whose saved jobs are being requested.
-        routes.MapGet("/api/jobs/saved/number", (HttpContext context, IJobService jobService) =>
+        routes.MapGet("", (HttpContext context, IJobService jobService) =>
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:81:62
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userId = context.User.FindFirst("UserId")?.Value;
-            filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
+            filters[AppConfig.FilterKeys.USERID] = userId ?? "";
             return jobService.GetNumberOfSavedJobs(filters.Count > 0 ? filters : null);
         })

[NoCoverage] Conditional (true) mutation
Back-end/src/Endpoints/JobEndpoints.cs:82:52
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userId = context.User.FindFirst("UserId")?.Value;
             filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return jobService.GetNumberOfSavedJobs(filters.Count > 0 ? filters : null);
+            return jobService.GetNumberOfSavedJobs((true?filters :null));
         })
             .WithName("GetNumberOfSavedJobs")

[NoCoverage] Conditional (false) mutation
Back-end/src/Endpoints/JobEndpoints.cs:82:52
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userId = context.User.FindFirst("UserId")?.Value;
             filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return jobService.GetNumberOfSavedJobs(filters.Count > 0 ? filters : null);
+            return jobService.GetNumberOfSavedJobs((false?filters :null));
         })
             .WithName("GetNumberOfSavedJobs")

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:85:23
             return jobService.GetNumberOfSavedJobs(filters.Count > 0 ? filters : null);
         })
             .WithName("GetNumberOfSavedJobs")
-            .WithTags("Jobs")
+            .WithTags("")
             .WithOpenApi()
             .RequireAuthorization();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:90:9
             .RequireAuthorization();
 
         // This endpoint retrieves all of the programming languages that jobs may have listed.
-        routes.MapGet("/api/jobs/languages", (IJobService jobService) =>
-        {
-            return jobService.GetProgrammingLanguages();
-        })
-            .WithName("GetProgrammingLanguages")
-            .WithTags("Jobs")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
     }
 

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:90:23
             .RequireAuthorization();
 
         // This endpoint retrieves all of the programming languages that jobs may have listed.
-        routes.MapGet("/api/jobs/languages", (IJobService jobService) =>
+        routes.MapGet("", (IJobService jobService) =>
         {
             return jobService.GetProgrammingLanguages();

[NoCoverage] Block removal mutation
Back-end/src/Endpoints/JobEndpoints.cs:91:9
 
         // This endpoint retrieves all of the programming languages that jobs may have listed.
         routes.MapGet("/api/jobs/languages", (IJobService jobService) =>
-        {
-            return jobService.GetProgrammingLanguages();
-        })
+        {})
             .WithName("GetProgrammingLanguages")
             .WithTags("Jobs")

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:105:9
         // This endpoint initializes the job list for the game based on the provided filters and returns a random job to start the game. 
         // The filters are the same as those used in GetJobs.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/job/game", (HttpContext context, IJobGameService jobGameService) =>
-        {
-            var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            filters[AppConfig.FilterKeys.USERID] = userIdStr;
-            return Results.Ok(jobGameService.InitializeJobGame(new CurrentUser(userId)));
-        })
-            .WithName("InitializeJobGame")
-            .WithTags("Job Game")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint allows the user to reject the current job in the game and receive the next job.

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:108:52
         routes.MapPost("/api/job/game", (HttpContext context, IJobGameService jobGameService) =>
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
+            var userIdStr = context.User.FindFirst("")?.Value;
             if (!int.TryParse(userIdStr, out var userId))
                 return Results.Unauthorized();

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Back-end/src/Endpoints/JobEndpoints.cs:109:17
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
+            if (int.TryParse(userIdStr, out var userId))
                 return Results.Unauthorized();
             filters[AppConfig.FilterKeys.USERID] = userIdStr;

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:121:9
 
         // This endpoint allows the user to reject the current job in the game and receive the next job.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/job/game/reject", (JobRequest jobRequest, HttpContext context, IJobGameService jobGameService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            return Results.Ok(jobGameService.RejectJob(new GameJob(userId, jobRequest.JobId)));
-        })
-            .WithName("RejectJob")
-            .WithTags("Job Game")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint allows the user to accept the current job in the game and receive the next job.

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:129:23
             return Results.Ok(jobGameService.RejectJob(new GameJob(userId, jobRequest.JobId)));
         })
             .WithName("RejectJob")
-            .WithTags("Job Game")
+            .WithTags("")
             .WithOpenApi()
             .RequireAuthorization();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:135:9
 
         // This endpoint allows the user to accept the current job in the game and receive the next job.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/job/game/accept", (JobRequest jobRequest, HttpContext context, IJobGameService jobGameService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            return Results.Ok(jobGameService.AcceptJob(new GameJob(userId, jobRequest.JobId)));
-        })
-            .WithName("AcceptJob")
-            .WithTags("Job Game")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint allows the user to retrieve the current game statistics, including the number of accepted and rejected jobs.

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:135:24
 
         // This endpoint allows the user to accept the current job in the game and receive the next job.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/job/game/accept", (JobRequest jobRequest, HttpContext context, IJobGameService jobGameService) =>
+        routes.MapPost("", (JobRequest jobRequest, HttpContext context, IJobGameService jobGameService) =>
         {
             var userIdStr = context.User.FindFirst("UserId")?.Value;

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:149:9
 
         // This endpoint allows the user to retrieve the current game statistics, including the number of accepted and rejected jobs.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/job/game/stats", (HttpContext context, IJobGameService jobGameService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            return Results.Ok(jobGameService.GetGameStats(new CurrentUser(userId)));
-        })
-            .WithName("GetGameStats")
-            .WithTags("Job Game")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
     }
 

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:156:23
                 return Results.Unauthorized();
             return Results.Ok(jobGameService.GetGameStats(new CurrentUser(userId)));
         })
-            .WithName("GetGameStats")
+            .WithName("")
             .WithTags("Job Game")
             .WithOpenApi()

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:157:23
             return Results.Ok(jobGameService.GetGameStats(new CurrentUser(userId)));
         })
             .WithName("GetGameStats")
-            .WithTags("Job Game")
+            .WithTags("")
             .WithOpenApi()
             .RequireAuthorization();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:167:9
         // This endpoint allows the user to add a new job to the system.
         // Job information is extracted from the body into a NewJob object automatically based on the definition of a NewJob object.
         // UserId is extracted from the user's cookie. This is required to connect the new job to the user as its poster. 
-        routes.MapPost("/api/job/add", (NewJob newJob, HttpContext context, IJobAddService jobAddService) =>
-        {
-            var userId = context.User.FindFirst("UserId")?.Value;
-            int posterUserId = int.TryParse(userId, out var id) ? id : 0;
-            return jobAddService.AddNewJob(posterUserId, newJob);
-        })
-            .WithName("AddNewJob")
-            .WithTags("Job Creation")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         routes.MapPost("/api/jobs/notify", async (string jobTitle, HttpContext context, IUserService userService, IEmailService emailService) =>

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:178:9
             .WithOpenApi()
             .RequireAuthorization();
 
-        routes.MapPost("/api/jobs/notify", async (string jobTitle, HttpContext context, IUserService userService, IEmailService emailService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-
-            var profile = userService.GetProfile(userId);
-            if (profile is null)
-                return Results.Unauthorized();
-
-            var posterName = profile.IsEmployer ? profile.EmployerName! : $"{profile.FirstName} {profile.LastName}";
-            var followers = userService.GetAllFollowers(userId);
-            var followerEmails = followers.Select(f => f.Email).ToList();
-
-            await emailService.SendJobNotificationEmailsAsync(posterName, profile.Username, jobTitle, followerEmails);
-
-            return Results.Ok();
-        })
-            .WithName("NotifyFollowers")
-            .WithTags("Job Creation")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint allows the user to add a new job to the system.

[NoCoverage] Equality mutation
Back-end/src/Endpoints/JobEndpoints.cs:185:17
                 return Results.Unauthorized();
 
             var profile = userService.GetProfile(userId);
-            if (profile is null)
+            if (profile is not null)
                 return Results.Unauthorized();
 

[NoCoverage] Conditional (false) mutation
Back-end/src/Endpoints/JobEndpoints.cs:188:30
             if (profile is null)
                 return Results.Unauthorized();
 
-            var posterName = profile.IsEmployer ? profile.EmployerName! : $"{profile.FirstName} {profile.LastName}";
+            var posterName = (false?profile.EmployerName! :$"{profile.FirstName} {profile.LastName}");
             var followers = userService.GetAllFollowers(userId);
             var followerEmails = followers.Select(f => f.Email).ToList();

[NoCoverage] Conditional (true) mutation
Back-end/src/Endpoints/JobEndpoints.cs:188:30
             if (profile is null)
                 return Results.Unauthorized();
 
-            var posterName = profile.IsEmployer ? profile.EmployerName! : $"{profile.FirstName} {profile.LastName}";
+            var posterName = (true?profile.EmployerName! :$"{profile.FirstName} {profile.LastName}");
             var followers = userService.GetAllFollowers(userId);
             var followerEmails = followers.Select(f => f.Email).ToList();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:192:13
             var followers = userService.GetAllFollowers(userId);
             var followerEmails = followers.Select(f => f.Email).ToList();
 
-            await emailService.SendJobNotificationEmailsAsync(posterName, profile.Username, jobTitle, followerEmails);
+            ;
 
             return Results.Ok();

[NoCoverage] String mutation
Back-end/src/Endpoints/JobEndpoints.cs:196:23
 
             return Results.Ok();
         })
-            .WithName("NotifyFollowers")
+            .WithName("")
             .WithTags("Job Creation")
             .WithOpenApi()

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:205:9
         // A jobId for the target job to delete is passed in as part of the URI. 
         // UserId is extracted from the user's cookie. This is required to check if the user can delete the specified job or not. 
         // A job may fail to be deleted if the jobId does not exist, or does not correspond to any jobs the user has added. 
-        routes.MapDelete("/api/jobs/{jobId}", (int jobId, HttpContext context, IJobService jobService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            try
-            {
-                jobService.DeleteJob(userId, jobId);
-                return Results.Ok();
-            }
-            catch (UnauthorizedAccessException)
-            {
-                return Results.Forbid();
-            }
-            catch (InvalidOperationException)
-            {
-                return Results.NotFound();
-            }
-        })
-            .WithName("DeleteJob")
-            .WithTags("Job Creation")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
     }
 }

[NoCoverage] Statement mutation
Back-end/src/Endpoints/JobEndpoints.cs:212:17
                 return Results.Unauthorized();
             try
             {
-                jobService.DeleteJob(userId, jobId);
+                ;
                 return Results.Ok();
             }

[NoCoverage] Block removal mutation
Back-end/src/Endpoints/JobEndpoints.cs:216:13
                 return Results.Ok();
             }
             catch (UnauthorizedAccessException)
-            {
-                return Results.Forbid();
-            }
+            {}
             catch (InvalidOperationException)
             {

[NoCoverage] Block removal mutation
Back-end/src/Endpoints/JobEndpoints.cs:220:13
                 return Results.Forbid();
             }
             catch (InvalidOperationException)
-            {
-                return Results.NotFound();
-            }
+            {}
         })
             .WithName("DeleteJob")
