[NoCoverage] Block removal mutation
src/Endpoints/Models/GenericWordsRequest.cs:8:3
     public string Paragraph { get; set; }
     
     public GenericWordsRequest(string paragraph)
-  {
-    this.Paragraph = paragraph;
-  }
+  {}
 }
