[Killed] Block removal mutation
src/Endpoints/Models/LoginRequest.cs:9:5
     public string Password { get; set; }
 
     public LoginRequest(string email, string password)
-    {
-        Email = email;
-        Password = password;
-    }
+    {}
 }
 
killedBy: test.UserServiceIntegrationTest.LoginIntegrationTest; Tests.UserServiceTest.LoginWithBadCredentials; Tests.UserServiceTest.LoginWithValidCredentials
