[Killed] Block removal mutation
src/Endpoints/Models/NewJob.cs:17:5
     public bool EmployerPoster { get; set; }
 
-    {
-        this.Title = title;
-        this.Deadline = deadline;
-        this.ApplicationLink = applicationLink;
-        this.HasRemote = hasRemote;
-        this.HasHybrid = hasHybrid;
-        this.PositionType = positionType;
-        this.EmploymentType = employmentType;
-        this.Locations = locations;
-        this.ProgrammingLanguages = programmingLanguages;
-        this.JobDescription = jobDescription;
-        this.EmployerPoster = employerPoster;   
-    }
+    {}
 }
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobAddServiceTest.AddJobAsEmployer
