[NoCoverage] Statement mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:14:9
     {
         // This endpoint initializes the session for the game.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/quiz/game", (HttpContext context, IQuizGameService quizGameService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-
-            quizGameService.InitializeSession(new CurrentUser(userId));            
-            return Results.Ok();
-        })
-            .WithName("InitializeQuizGame")
-            .WithTags("Quiz Game")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint accepts the user's selected sentence answer from the game.

[NoCoverage] Statement mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:20:13
             if (!int.TryParse(userIdStr, out var userId))
                 return Results.Unauthorized();
 
-            quizGameService.InitializeSession(new CurrentUser(userId));            
+            ;            
             return Results.Ok();
         })

[NoCoverage] String mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:23:23
             quizGameService.InitializeSession(new CurrentUser(userId));            
             return Results.Ok();
         })
-            .WithName("InitializeQuizGame")
+            .WithName("")
             .WithTags("Quiz Game")
             .WithOpenApi()

[NoCoverage] String mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:24:23
             return Results.Ok();
         })
             .WithName("InitializeQuizGame")
-            .WithTags("Quiz Game")
+            .WithTags("")
             .WithOpenApi()
             .RequireAuthorization();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:30:9
 
         // This endpoint accepts the user's selected sentence answer from the game.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/quiz/answer", (QuizGameResponse quizGameResponse, HttpContext context, IQuizGameService quizGameService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-
-            quizGameService.AnswerQuiz(new CurrentUser(userId), quizGameResponse);            
-            return Results.Ok();
-        })
-            .WithName("AnswerQuiz")
-            .WithTags("Quiz Game")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint allows the user to retrieve the current game statistics, including the number of correct, incorrect and skipped sentences.

[NoCoverage] Statement mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:36:13
             if (!int.TryParse(userIdStr, out var userId))
                 return Results.Unauthorized();
 
-            quizGameService.AnswerQuiz(new CurrentUser(userId), quizGameResponse);            
+            ;            
             return Results.Ok();
         })

[NoCoverage] String mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:39:23
             quizGameService.AnswerQuiz(new CurrentUser(userId), quizGameResponse);            
             return Results.Ok();
         })
-            .WithName("AnswerQuiz")
+            .WithName("")
             .WithTags("Quiz Game")
             .WithOpenApi()

[NoCoverage] Statement mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:46:9
 
         // This endpoint allows the user to retrieve the current game statistics, including the number of correct, incorrect and skipped sentences.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/quiz/stats", (HttpContext context, IQuizGameService quizGameService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-
-            return Results.Ok(quizGameService.GetGameStats(new CurrentUser(userId)));
-        })
-            .WithName("GetQuizStats")
-            .WithTags("Quiz Game")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint provides the next pair of sentences for the game.

[NoCoverage] String mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:54:23
 
             return Results.Ok(quizGameService.GetGameStats(new CurrentUser(userId)));
         })
-            .WithName("GetQuizStats")
+            .WithName("")
             .WithTags("Quiz Game")
             .WithOpenApi()

[NoCoverage] Statement mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:61:9
 
         // This endpoint provides the next pair of sentences for the game.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/quiz/next", (HttpContext context, IQuizGameService quizGameService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            QuizItem? quizItem = quizGameService.GetNextQuiz(new CurrentUser(userId));
-            if (quizItem == null)
-            {
-                return Results.Ok();
-            }
-            return Results.Ok(new QuizOptions(quizItem));
-        })
-            .WithName("GetNextQuiz")
-            .WithTags("Quiz Game")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
     }
 }

[NoCoverage] Equality mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:67:17
             if (!int.TryParse(userIdStr, out var userId))
                 return Results.Unauthorized();
             QuizItem? quizItem = quizGameService.GetNextQuiz(new CurrentUser(userId));
-            if (quizItem == null)
+            if (quizItem != null)
             {
                 return Results.Ok();

[NoCoverage] Block removal mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:68:13
                 return Results.Unauthorized();
             QuizItem? quizItem = quizGameService.GetNextQuiz(new CurrentUser(userId));
             if (quizItem == null)
-            {
-                return Results.Ok();
-            }
+            {}
             return Results.Ok(new QuizOptions(quizItem));
         })

[NoCoverage] String mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:73:23
             }
             return Results.Ok(new QuizOptions(quizItem));
         })
-            .WithName("GetNextQuiz")
+            .WithName("")
             .WithTags("Quiz Game")
             .WithOpenApi()

[NoCoverage] String mutation
Back-end/src/Endpoints/QuizGameEndPoints.cs:74:23
             return Results.Ok(new QuizOptions(quizItem));
         })
             .WithName("GetNextQuiz")
-            .WithTags("Quiz Game")
+            .WithTags("")
             .WithOpenApi()
             .RequireAuthorization();
