[Killed] Block removal mutation
src/Endpoints/Models/NewJobComment.cs:10:5
     public int JobId { get; set; }
 
     public NewJobComment(string comment, int posterUserId, int jobId)
-    {
-        this.Comment = comment;
-        this.PosterUserId = posterUserId;
-        this.JobId = jobId;
-    }
+    {}
 }
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.CommentsServiceTest.CreateCommentHappy
