[Killed] Block removal mutation
src/Endpoints/Models/NewUser.cs:13:3
     public string Email { get; set; }
 
     public NewUser(string username, string password, string email, bool IsEmployer, string firstName, string lastName, string employerName)
-  {
-    this.Username = username;
-    this.Password = password;
-    this.Email = email;
-    this.IsEmployer = IsEmployer;
-    this.FirstName = firstName;
-    this.LastName = lastName;
-    this.EmployerName = employerName;
-    
-  }
+  {}
 }
killedBy: test.UserServiceIntegrationTest.CreateUserIntegrationTest; test.UserServiceIntegrationTest.LoginIntegrationTest
