[NoCoverage] Statement mutation
Back-end/src/Endpoints/ResumeEndpoints.cs:12:9
     {
         // This endpoint allows the user to provide a paragraph and retrieve the generic word positions in it using a base generic word list from the database.
         // The paragraph to analyze is extracted from the body into a GenericWordsRequest object automatically based on the definition of a GenericWordsRequest object.
-        routes.MapPost("/api/resume/generic-words", (GenericWordsRequest request, IGenericWordsService genericWordsService) =>
-        {
-            return genericWordsService.GetPositionOfGenericWords(request.Paragraph);
-        })
-            .WithName("GetPositionOfGenericWords")
-            .WithTags("Resume")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
     }
 }

[NoCoverage] Block removal mutation
Back-end/src/Endpoints/ResumeEndpoints.cs:13:9
         // This endpoint allows the user to provide a paragraph and retrieve the generic word positions in it using a base generic word list from the database.
         // The paragraph to analyze is extracted from the body into a GenericWordsRequest object automatically based on the definition of a GenericWordsRequest object.
         routes.MapPost("/api/resume/generic-words", (GenericWordsRequest request, IGenericWordsService genericWordsService) =>
-        {
-            return genericWordsService.GetPositionOfGenericWords(request.Paragraph);
-        })
+        {})
             .WithName("GetPositionOfGenericWords")
             .WithTags("Resume")
