[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:18:9
     {
         // This endpoint retrieves a list of users based on the provided filters.
         // The filters are passed as query parameters.
-        routes.MapGet("/api/users/search", (HttpContext context, IUserService userService) =>
-        {
-            var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            return userService.GetUsers(filters.Count > 0 ? filters : null);
-        })
-            .WithName("SearchUsers")
-            .WithTags("Users")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint creates a new user account.

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:18:23
     {
         // This endpoint retrieves a list of users based on the provided filters.
         // The filters are passed as query parameters.
-        routes.MapGet("/api/users/search", (HttpContext context, IUserService userService) =>
+        routes.MapGet("", (HttpContext context, IUserService userService) =>
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());

[NoCoverage] Equality mutation
Back-end/src/Endpoints/UserEndpoints.cs:21:41
         routes.MapGet("/api/users/search", (HttpContext context, IUserService userService) =>
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            return userService.GetUsers(filters.Count > 0 ? filters : null);
+            return userService.GetUsers(filters.Count >= 0 ? filters : null);
         })
             .WithName("SearchUsers")

[NoCoverage] Conditional (false) mutation
Back-end/src/Endpoints/UserEndpoints.cs:21:41
         routes.MapGet("/api/users/search", (HttpContext context, IUserService userService) =>
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            return userService.GetUsers(filters.Count > 0 ? filters : null);
+            return userService.GetUsers((false?filters :null));
         })
             .WithName("SearchUsers")

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:30:9
 
         // This endpoint creates a new user account.
         // User information is extracted from the body into a NewUser object automatically based on the definition of a NewUser object.
-        routes.MapPost("/api/users", async (NewUser newUser, IUserService userService) =>
-        {
-            try
-            {
-                return Results.Ok(await userService.CreateUser(newUser));
-            }
-            catch (InvalidOperationException ex)
-            {
-                return Results.BadRequest(ex.Message);
-            }
-        })
-            .WithName("CreateUser")
-            .WithTags("Users")
-            .WithOpenApi();
+        ;
 
         // This endpoint saves a job for the user. 

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:48:9
         // This endpoint saves a job for the user. 
         // Filters contain the jobId of the job to be saved. 
         // UserId is extracted from the user's cookie. This is required to save the job for the appropriate user.
-        routes.MapPost("/api/users/save", (HttpContext context, IUserService userService) =>
-        {
-            var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            var userId = context.User.FindFirst("UserId")?.Value;
-            filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return userService.SaveJob(filters.Count > 0 ? filters : null);
-        })
-            .WithName("SaveJob")
-            .WithTags("Users")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint unsaves a job for the user; that is, removes the job from the user's saved jobs.

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:51:49
         routes.MapPost("/api/users/save", (HttpContext context, IUserService userService) =>
         {
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            var userId = context.User.FindFirst("UserId")?.Value;
+            var userId = context.User.FindFirst("")?.Value;
             filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
             return userService.SaveJob(filters.Count > 0 ? filters : null);

[NoCoverage] Conditional (false) mutation
Back-end/src/Endpoints/UserEndpoints.cs:53:40
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userId = context.User.FindFirst("UserId")?.Value;
             filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return userService.SaveJob(filters.Count > 0 ? filters : null);
+            return userService.SaveJob((false?filters :null));
         })
             .WithName("SaveJob")

[NoCoverage] Equality mutation
Back-end/src/Endpoints/UserEndpoints.cs:53:40
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userId = context.User.FindFirst("UserId")?.Value;
             filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return userService.SaveJob(filters.Count > 0 ? filters : null);
+            return userService.SaveJob(filters.Count >= 0 ? filters : null);
         })
             .WithName("SaveJob")

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:56:23
             return userService.SaveJob(filters.Count > 0 ? filters : null);
         })
             .WithName("SaveJob")
-            .WithTags("Users")
+            .WithTags("")
             .WithOpenApi()
             .RequireAuthorization();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:63:10
         // This endpoint unsaves a job for the user; that is, removes the job from the user's saved jobs.
         // Filters contain the jobId of the job to be unsaved. 
         // UserId is extracted from the user's cookie. This is required to unsave the job for the appropriate user.
-         routes.MapPost("/api/users/unsave", (HttpContext context, IUserService userService) =>
-        {
-            var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
-            var userId = context.User.FindFirst("UserId")?.Value;
-            filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return userService.UnsaveJob(filters.Count > 0 ? filters : null);
-        })
-            .WithName("UnsaveJob")
-            .WithTags("Users")
-            .WithOpenApi()
-            .RequireAuthorization();
+         ;
 
         // This endpoint retrieves the profile details of a specified user.

[NoCoverage] Conditional (true) mutation
Back-end/src/Endpoints/UserEndpoints.cs:68:42
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userId = context.User.FindFirst("UserId")?.Value;
             filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return userService.UnsaveJob(filters.Count > 0 ? filters : null);
+            return userService.UnsaveJob((true?filters :null));
         })
             .WithName("UnsaveJob")

[NoCoverage] Conditional (false) mutation
Back-end/src/Endpoints/UserEndpoints.cs:68:42
             var filters = context.Request.Query.ToDictionary(query => query.Key, query => query.Value.ToString());
             var userId = context.User.FindFirst("UserId")?.Value;
             filters[AppConfig.FilterKeys.USERID] = userId ?? "0";
-            return userService.UnsaveJob(filters.Count > 0 ? filters : null);
+            return userService.UnsaveJob((false?filters :null));
         })
             .WithName("UnsaveJob")

[NoCoverage] Equality mutation
Back-end/src/Endpoints/UserEndpoints.cs:80:17
          routes.MapGet("/api/users/{username}", (string username, HttpContext context, IUserService userService, IFollowService followService) =>
         {
             var profile = userService.GetProfileByUsername(username);
-            if (profile is null) return Results.NotFound();
+            if (profile is not null) return Results.NotFound();
             bool isSelf = int.TryParse(context.User.FindFirst("UserId")?.Value, out var requestingUserId)
                 && profile.UserId == requestingUserId;

[NoCoverage] Logical mutation
Back-end/src/Endpoints/UserEndpoints.cs:81:27
         {
             var profile = userService.GetProfileByUsername(username);
             if (profile is null) return Results.NotFound();
-            bool isSelf = int.TryParse(context.User.FindFirst("UserId")?.Value, out var requestingUserId)
-                && profile.UserId == requestingUserId;
+            bool isSelf = int.TryParse(context.User.FindFirst("UserId")?.Value, out var requestingUserId)
+                || profile.UserId == requestingUserId;
             bool isFollowing = !isSelf && requestingUserId != 0 && followService.IsFollowing(requestingUserId, username);
 

[NoCoverage] Equality mutation
Back-end/src/Endpoints/UserEndpoints.cs:82:20
             var profile = userService.GetProfileByUsername(username);
             if (profile is null) return Results.NotFound();
             bool isSelf = int.TryParse(context.User.FindFirst("UserId")?.Value, out var requestingUserId)
-                && profile.UserId == requestingUserId;
+                && profile.UserId != requestingUserId;
             bool isFollowing = !isSelf && requestingUserId != 0 && followService.IsFollowing(requestingUserId, username);
 

[NoCoverage] Equality mutation
Back-end/src/Endpoints/UserEndpoints.cs:83:43
             if (profile is null) return Results.NotFound();
             bool isSelf = int.TryParse(context.User.FindFirst("UserId")?.Value, out var requestingUserId)
                 && profile.UserId == requestingUserId;
-            bool isFollowing = !isSelf && requestingUserId != 0 && followService.IsFollowing(requestingUserId, username);
+            bool isFollowing = !isSelf && requestingUserId == 0 && followService.IsFollowing(requestingUserId, username);
 
             return Results.Ok(new {

[NoCoverage] Logical mutation
Back-end/src/Endpoints/UserEndpoints.cs:83:32
             if (profile is null) return Results.NotFound();
             bool isSelf = int.TryParse(context.User.FindFirst("UserId")?.Value, out var requestingUserId)
                 && profile.UserId == requestingUserId;
-            bool isFollowing = !isSelf && requestingUserId != 0 && followService.IsFollowing(requestingUserId, username);
+            bool isFollowing = !isSelf && requestingUserId != 0 || followService.IsFollowing(requestingUserId, username);
 
             return Results.Ok(new {

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:100:23
                 isFollowing
             });
         })
-            .WithName("GetProfile")
+            .WithName("")
             .WithTags("Users")
             .WithOpenApi()

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:109:24
         // Login credentials are extracted from the body into a LoginRequest object automatically based on the definition of a LoginRequest object.
         // Upon a successful login, the user receives a cookie to allow them to remain logged in for some time. 
         // The cookie's timeout refreshes on all other endpoint calls, except for the Logout endpoint below. 
-        routes.MapPost("/api/users/login", async (LoginRequest loginRequest, HttpContext context, IUserService userService) =>
+        routes.MapPost("", async (LoginRequest loginRequest, HttpContext context, IUserService userService) =>
         {
             int userId;

[NoCoverage] Boolean mutation
Back-end/src/Endpoints/UserEndpoints.cs:136:32
 
             var authProperties = new AuthenticationProperties
             {
-                IsPersistent = true,
+                IsPersistent = false,
                 ExpiresUtc = DateTimeOffset.UtcNow.AddHours(2)
             };

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:140:13
                 ExpiresUtc = DateTimeOffset.UtcNow.AddHours(2)
             };
 
-            await context.SignInAsync(CookieAuthenticationDefaults.AuthenticationScheme, principal, authProperties);
+            ;
 
             var profile = userService.GetProfile(userId);

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:157:9
 
         // This endpoint logs the user out. 
         // This invalidates and clears the user's cookie. 
-        routes.MapPost("/api/users/logout", async (HttpContext context) =>
-        {
-            await context.SignOutAsync(CookieAuthenticationDefaults.AuthenticationScheme);
-
-            context.Response.Headers.Append("Clear-Site-Data", "\"cookies\", \"storage\", \"cache\"");
-
-            return Results.Ok();
-        })
-            .WithName("Logout")
-            .WithTags("Users")
-            .WithOpenApi();
+        ;
         
         // This endpoint retrieves the list of accounts a user follows.

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:159:13
         // This invalidates and clears the user's cookie. 
         routes.MapPost("/api/users/logout", async (HttpContext context) =>
         {
-            await context.SignOutAsync(CookieAuthenticationDefaults.AuthenticationScheme);
+            ;
 
             context.Response.Headers.Append("Clear-Site-Data", "\"cookies\", \"storage\", \"cache\"");

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:161:13
         {
             await context.SignOutAsync(CookieAuthenticationDefaults.AuthenticationScheme);
 
-            context.Response.Headers.Append("Clear-Site-Data", "\"cookies\", \"storage\", \"cache\"");
+            ;
 
             return Results.Ok();

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:161:45
         {
             await context.SignOutAsync(CookieAuthenticationDefaults.AuthenticationScheme);
 
-            context.Response.Headers.Append("Clear-Site-Data", "\"cookies\", \"storage\", \"cache\"");
+            context.Response.Headers.Append("", "\"cookies\", \"storage\", \"cache\"");
 
             return Results.Ok();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:171:9
         
         // This endpoint retrieves the list of accounts a user follows.
         // UserId is extracted from the user's cookie. This is required to retrieve the following list for the appropriate user.
-        routes.MapGet("/api/users/following", (HttpContext context, IUserService userService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            return Results.Ok(userService.GetAllFollowing(userId));
-        })
-            .WithName("GetFollowing")
-            .WithTags("Users")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint verifies if the current user is an employer or not.

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:178:23
                 return Results.Unauthorized();
             return Results.Ok(userService.GetAllFollowing(userId));
         })
-            .WithName("GetFollowing")
+            .WithName("")
             .WithTags("Users")
             .WithOpenApi()

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:185:9
 
         // This endpoint verifies if the current user is an employer or not.
         // UserId is extracted from the user's cookie. This is required to check the user type (employer or job seeker) for the appropriate user.
-        routes.MapGet("/api/users/check-employer", (HttpContext context, IUserService userService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            return Results.Ok(userService.CheckUserEmployer(userId));
-        })
-            .WithName("CheckUserEmployer")
-            .WithTags("Users")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint updates the current user's account. 

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:200:9
         // This endpoint updates the current user's account. 
         // User account details are extracted from the body into an UpdateUserRequest object automatically based on the definition of a UpdateUserRequest object.
         // UserId is extracted from the user's cookie. This is required to connect to the appropriate user to update.
-        routes.MapPut("/api/users", (UpdateUserRequest request, HttpContext context, IUserService userService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            return Results.Ok(userService.UpdateUser(request, userId));
-        })
-            .WithName("UpdateUser")
-            .WithTags("Users")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint adds a new experience to the user's profile. 

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:207:23
                 return Results.Unauthorized();
             return Results.Ok(userService.UpdateUser(request, userId));
         })
-            .WithName("UpdateUser")
+            .WithName("")
             .WithTags("Users")
             .WithOpenApi()

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:215:9
         // This endpoint adds a new experience to the user's profile. 
         // Experience details are extracted from the body into an Experience object automatically based on the definition of a Experience object.
         // UserId is extracted from the user's cookie. This is required to connect to the user as the one with the experience.
-        routes.MapPost("/api/users/experiences", (Experience experience, HttpContext context, IUserService userService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            try
-            {
-                var experienceId = userService.AddExperience(userId, experience);
-                return Results.Ok(experienceId);
-            }
-            catch (InvalidOperationException)
-            {
-                return Results.Forbid();
-            }
-        })
-            .WithName("AddExperience")
-            .WithTags("Users")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint updates an existing experience on the user's profile. 

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:231:23
             }
         })
             .WithName("AddExperience")
-            .WithTags("Users")
+            .WithTags("")
             .WithOpenApi()
             .RequireAuthorization();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:238:9
         // This endpoint updates an existing experience on the user's profile. 
         // Experience details are extracted from the body into an UpdateExperienceRequest object automatically based on the definition of a UpdateExperienceRequest object.
         // UserId is extracted from the user's cookie. This is required to connect to the user and update the appropriate experience.
-        routes.MapPut("/api/users/experiences", (UpdateExperienceRequest request, HttpContext context, IUserService userService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            try
-            {
-                userService.EditExperience(userId, request.OldExperience, request.NewExperience);
-                return Results.Ok();
-            }
-            catch (InvalidOperationException)
-            {
-                return Results.Forbid();
-            }
-        })
-            .WithName("EditExperience")
-            .WithTags("Users")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint removes an experience from the user's profile. 

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:238:23
         // This endpoint updates an existing experience on the user's profile. 
         // Experience details are extracted from the body into an UpdateExperienceRequest object automatically based on the definition of a UpdateExperienceRequest object.
         // UserId is extracted from the user's cookie. This is required to connect to the user and update the appropriate experience.
-        routes.MapPut("/api/users/experiences", (UpdateExperienceRequest request, HttpContext context, IUserService userService) =>
+        routes.MapPut("", (UpdateExperienceRequest request, HttpContext context, IUserService userService) =>
         {
             var userIdStr = context.User.FindFirst("UserId")?.Value;

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:245:17
                 return Results.Unauthorized();
             try
             {
-                userService.EditExperience(userId, request.OldExperience, request.NewExperience);
+                ;
                 return Results.Ok();
             }

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:261:9
         // This endpoint removes an experience from the user's profile. 
         // Experience details are extracted from the body into an Experience object automatically based on the definition of a Experience object.
         // UserId is extracted from the user's cookie. This is required to connect to the user and delete the appropriate experience.
-        routes.MapDelete("/api/users/experiences", ([FromBody] Experience experience, HttpContext context, IUserService userService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            try
-            {
-                userService.DeleteExperience(userId, experience);
-                return Results.Ok();
-            }
-            catch (InvalidOperationException)
-            {
-                return Results.Forbid();
-            }
-        })
-            .WithName("DeleteExperience")
-            .WithTags("Users")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
 

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:261:26
         // This endpoint removes an experience from the user's profile. 
         // Experience details are extracted from the body into an Experience object automatically based on the definition of a Experience object.
         // UserId is extracted from the user's cookie. This is required to connect to the user and delete the appropriate experience.
-        routes.MapDelete("/api/users/experiences", ([FromBody] Experience experience, HttpContext context, IUserService userService) =>
+        routes.MapDelete("", ([FromBody] Experience experience, HttpContext context, IUserService userService) =>
         {
             var userIdStr = context.User.FindFirst("UserId")?.Value;

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:268:17
                 return Results.Unauthorized();
             try
             {
-                userService.DeleteExperience(userId, experience);
+                ;
                 return Results.Ok();
             }

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:282:9
             .RequireAuthorization();
 
 
-        routes.MapGet("/api/users/verify", (string token, IUserService userService) =>
-        {
-            try
-            {
-                userService.VerifyUser(token);
-                return Results.Ok();
-            }
-            catch (InvalidOperationException)
-            {
-                return Results.BadRequest("Invalid or already-used verification token.");
-            }
-        })
-            .WithName("VerifyUser")
-            .WithTags("Users")
-            .WithOpenApi();
+        ;
         // This endpoint adds a user to the current user's following list. 
         // The username of the user to follow is automatically extracted from the URI into a username string.

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:286:17
         {
             try
             {
-                userService.VerifyUser(token);
+                ;
                 return Results.Ok();
             }

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:291:43
             }
             catch (InvalidOperationException)
             {
-                return Results.BadRequest("Invalid or already-used verification token.");
+                return Results.BadRequest("");
             }
         })

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:294:23
                 return Results.BadRequest("Invalid or already-used verification token.");
             }
         })
-            .WithName("VerifyUser")
+            .WithName("")
             .WithTags("Users")
             .WithOpenApi();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:300:9
         // This endpoint adds a user to the current user's following list. 
         // The username of the user to follow is automatically extracted from the URI into a username string.
         // UserId is extracted from the user's cookie. This is required to identify the user to update the following list of.
-        routes.MapPost("/api/users/follow/{username}", (string username, HttpContext context, IFollowService followService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            try
-            {
-                followService.FollowUser(userId, username);
-                return Results.Ok();
-            }
-            catch (InvalidOperationException)
-            {
-                return Results.Forbid();
-            }
-        })
-            .WithName("FollowUser")
-            .WithTags("Users")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
         
         // This endpoint removes a user from the current user's following list. 

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:307:17
                 return Results.Unauthorized();
             try
             {
-                followService.FollowUser(userId, username);
+                ;
                 return Results.Ok();
             }

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:316:23
             }
         })
             .WithName("FollowUser")
-            .WithTags("Users")
+            .WithTags("")
             .WithOpenApi()
             .RequireAuthorization();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:323:9
         // This endpoint removes a user from the current user's following list. 
         // The username of the user to unfollow is automatically extracted from the URI into a username string.
         // UserId is extracted from the user's cookie. This is required to identify the user to update the following list of.
-        routes.MapPost("/api/users/unfollow/{username}", (string username, HttpContext context, IFollowService followService) =>
-        {            
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            try
-            {                
-                followService.UnfollowUser(userId, username);
-                return Results.Ok();
-            }
-            catch (InvalidOperationException)
-            {
-                return Results.Forbid();
-            }
-        })
-            .WithName("UnfollowUser")
-            .WithTags("Users")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
     }
 

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:323:24
         // This endpoint removes a user from the current user's following list. 
         // The username of the user to unfollow is automatically extracted from the URI into a username string.
         // UserId is extracted from the user's cookie. This is required to identify the user to update the following list of.
-        routes.MapPost("/api/users/unfollow/{username}", (string username, HttpContext context, IFollowService followService) =>
+        routes.MapPost("", (string username, HttpContext context, IFollowService followService) =>
         {            
             var userIdStr = context.User.FindFirst("UserId")?.Value;
