[Killed] Block removal mutation
src/Endpoints/Models/NewUserComments.cs:9:5
     public string CommentedUserUsername { get; set; }
 
     public NewUserComment(string comment, int posterUserId, string commentedUserUsername)
-    {
-        this.Comment = comment;
-        this.PosterUserId = posterUserId;
-        this.CommentedUserUsername = commentedUserUsername;
-    }
+    {}
 }
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest
