[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:330:17
                 return Results.Unauthorized();
             try
             {                
-                followService.UnfollowUser(userId, username);
+                ;
                 return Results.Ok();
             }

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:348:9
     {
         // This endpoint initializes the user list for the game and returns a random user to start the game. 
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/users/game", (HttpContext context, IUserGameService userGameService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            return Results.Ok(userGameService.InitializeUserGame(new CurrentUser(userId)));
-        })
-            .WithName("InitializeUserGame")
-            .WithTags("User Game")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint allows the user to reject the current user in the game and receive the next user.

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:348:24
     {
         // This endpoint initializes the user list for the game and returns a random user to start the game. 
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/users/game", (HttpContext context, IUserGameService userGameService) =>
+        routes.MapPost("", (HttpContext context, IUserGameService userGameService) =>
         {
             var userIdStr = context.User.FindFirst("UserId")?.Value;

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:356:23
             return Results.Ok(userGameService.InitializeUserGame(new CurrentUser(userId)));
         })
             .WithName("InitializeUserGame")
-            .WithTags("User Game")
+            .WithTags("")
             .WithOpenApi()
             .RequireAuthorization();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:362:9
 
         // This endpoint allows the user to reject the current user in the game and receive the next user.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/users/game/reject/{username}", (string username, HttpContext context, IUserGameService userGameService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            return Results.Ok(userGameService.RejectUser(new CurrentUser(userId), username));
-        })
-            .WithName("RejectUser")
-            .WithTags("User Game")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
 
         // This endpoint allows the user to accept the current job in the game and receive the next job.

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:369:23
                 return Results.Unauthorized();
             return Results.Ok(userGameService.RejectUser(new CurrentUser(userId), username));
         })
-            .WithName("RejectUser")
+            .WithName("")
             .WithTags("User Game")
             .WithOpenApi()

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:370:23
             return Results.Ok(userGameService.RejectUser(new CurrentUser(userId), username));
         })
             .WithName("RejectUser")
-            .WithTags("User Game")
+            .WithTags("")
             .WithOpenApi()
             .RequireAuthorization();

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:376:9
 
         // This endpoint allows the user to accept the current job in the game and receive the next job.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/users/game/accept/{username}", (string username, HttpContext context, IUserGameService userGameService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            return Results.Ok(userGameService.AcceptUser(new CurrentUser(userId), username));
-        })
-            .WithName("AcceptUser")
-            .WithTags("User Game")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
         
         // This endpoint allows the user to retrieve the current game statistics, including the number of accepted and rejected users.

[NoCoverage] Statement mutation
Back-end/src/Endpoints/UserEndpoints.cs:390:9
         
         // This endpoint allows the user to retrieve the current game statistics, including the number of accepted and rejected users.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/users/game/stats", (HttpContext context, IUserGameService userGameService) =>
-        {
-            var userIdStr = context.User.FindFirst("UserId")?.Value;
-            if (!int.TryParse(userIdStr, out var userId))
-                return Results.Unauthorized();
-            return Results.Ok(userGameService.GetGameStats(new CurrentUser(userId)));
-        })
-            .WithName("GetUserGameStats")
-            .WithTags("User Game")
-            .WithOpenApi()
-            .RequireAuthorization();
+        ;
     }
 }

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:390:24
         
         // This endpoint allows the user to retrieve the current game statistics, including the number of accepted and rejected users.
         // UserId is extracted from the user's cookie. This is required to identify the user to connect the game's instance to.
-        routes.MapPost("/api/users/game/stats", (HttpContext context, IUserGameService userGameService) =>
+        routes.MapPost("", (HttpContext context, IUserGameService userGameService) =>
         {
             var userIdStr = context.User.FindFirst("UserId")?.Value;

[NoCoverage] String mutation
Back-end/src/Endpoints/UserEndpoints.cs:397:23
                 return Results.Unauthorized();
             return Results.Ok(userGameService.GetGameStats(new CurrentUser(userId)));
         })
-            .WithName("GetUserGameStats")
+            .WithName("")
             .WithTags("User Game")
             .WithOpenApi()
