[Killed] Block removal mutation
src/Endpoints/Models/Profile.cs:20:5
     public List<Job>? PostedJobs { get; set; }
 
-    {
-        this.UserId = userId;
-        this.Username = username;
-        this.Email = email;
-        this.FirstName = firstName;
-        this.LastName = lastName;
-        this.Bio = bio;
-        this.Experiences = experiences;
-        this.IsEmployer = isEmployer;
-        this.EmployerName = EmployerName;
-        this.IsSelf = isSelf;
-        this.PostedJobs = postedJobs;
-    }
+    {}
 }
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest
