[Killed] Block removal mutation
src/Endpoints/Models/QuizGameResponse.cs:8:5
     public string answer { get; set; }
     
     public QuizGameResponse(string answer)
-    {
-        this.answer = answer;
-    }
+    {}
 }
killedBy: QuizGameServiceTest.EmptyAnswerTest; QuizGameServiceTest.SpaceAnswerTest
