[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:13:1
 using Microsoft.AspNetCore.HttpOverrides;
 using Resend;
 // Load environment variables from .env file
-Env.Load();
+;
 
 var builder = WebApplication.CreateBuilder(args);

[NoCoverage] Null coalescing mutation (remove left)
GetEmployedCS/Back-end/src/Program.cs:16:12
 Env.Load();
 
 var builder = WebApplication.CreateBuilder(args);
-var port = Environment.GetEnvironmentVariable("PORT") ?? "8080";
+var port = "8080";
 
 // Add services to the container.

[NoCoverage] String mutation
GetEmployedCS/Back-end/src/Program.cs:16:58
 Env.Load();
 
 var builder = WebApplication.CreateBuilder(args);
-var port = Environment.GetEnvironmentVariable("PORT") ?? "8080";
+var port = Environment.GetEnvironmentVariable("PORT") ?? "";
 
 // Add services to the container.

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:20:1
 
 // Add services to the container.
 // Learn more about configuring Swagger/OpenAPI at https://aka.ms/aspnetcore/swashbuckle
-builder.Services.AddEndpointsApiExplorer();
+;
 builder.Services.AddSwaggerGen();
 builder.Services.Configure<Microsoft.AspNetCore.Http.Json.JsonOptions>(options =>

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:22:1
 // Learn more about configuring Swagger/OpenAPI at https://aka.ms/aspnetcore/swashbuckle
 builder.Services.AddEndpointsApiExplorer();
 builder.Services.AddSwaggerGen();
-builder.Services.Configure<Microsoft.AspNetCore.Http.Json.JsonOptions>(options =>
-{
-    options.SerializerOptions.AllowTrailingCommas = true;
-});
+;
 builder.Services.AddScoped<IJobPersistence, JobPersistence>();
 builder.Services.AddScoped<IQuizItemsPersistence, QuizItemsPersisitence>();

[NoCoverage] Boolean mutation
GetEmployedCS/Back-end/src/Program.cs:24:53
 builder.Services.AddSwaggerGen();
 builder.Services.Configure<Microsoft.AspNetCore.Http.Json.JsonOptions>(options =>
 {
-    options.SerializerOptions.AllowTrailingCommas = true;
+    options.SerializerOptions.AllowTrailingCommas = false;
 });
 builder.Services.AddScoped<IJobPersistence, JobPersistence>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:26:1
 {
     options.SerializerOptions.AllowTrailingCommas = true;
 });
-builder.Services.AddScoped<IJobPersistence, JobPersistence>();
+;
 builder.Services.AddScoped<IQuizItemsPersistence, QuizItemsPersisitence>();
 builder.Services.AddScoped<IJobIndexManager, ShuffleJobsService>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:27:1
     options.SerializerOptions.AllowTrailingCommas = true;
 });
 builder.Services.AddScoped<IJobPersistence, JobPersistence>();
-builder.Services.AddScoped<IQuizItemsPersistence, QuizItemsPersisitence>();
+;
 builder.Services.AddScoped<IJobIndexManager, ShuffleJobsService>();
 builder.Services.AddScoped<IResumePersistence, ResumePersistence>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:28:1
 });
 builder.Services.AddScoped<IJobPersistence, JobPersistence>();
 builder.Services.AddScoped<IQuizItemsPersistence, QuizItemsPersisitence>();
-builder.Services.AddScoped<IJobIndexManager, ShuffleJobsService>();
+;
 builder.Services.AddScoped<IResumePersistence, ResumePersistence>();
 builder.Services.AddSingleton<IGroqService, GroqService>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:29:1
 builder.Services.AddScoped<IJobPersistence, JobPersistence>();
 builder.Services.AddScoped<IQuizItemsPersistence, QuizItemsPersisitence>();
 builder.Services.AddScoped<IJobIndexManager, ShuffleJobsService>();
-builder.Services.AddScoped<IResumePersistence, ResumePersistence>();
+;
 builder.Services.AddSingleton<IGroqService, GroqService>();
 builder.Services.AddScoped<IGenericWordsService, GenericWordsService>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:30:1
 builder.Services.AddScoped<IQuizItemsPersistence, QuizItemsPersisitence>();
 builder.Services.AddScoped<IJobIndexManager, ShuffleJobsService>();
 builder.Services.AddScoped<IResumePersistence, ResumePersistence>();
-builder.Services.AddSingleton<IGroqService, GroqService>();
+;
 builder.Services.AddScoped<IGenericWordsService, GenericWordsService>();
 builder.Services.AddScoped<IAiGenericWordsService, GroqGenericWordsService>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:31:1
 builder.Services.AddScoped<IJobIndexManager, ShuffleJobsService>();
 builder.Services.AddScoped<IResumePersistence, ResumePersistence>();
 builder.Services.AddSingleton<IGroqService, GroqService>();
-builder.Services.AddScoped<IGenericWordsService, GenericWordsService>();
+;
 builder.Services.AddScoped<IAiGenericWordsService, GroqGenericWordsService>();
 builder.Services.AddScoped<IJobService, JobService>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:32:1
 builder.Services.AddScoped<IResumePersistence, ResumePersistence>();
 builder.Services.AddSingleton<IGroqService, GroqService>();
 builder.Services.AddScoped<IGenericWordsService, GenericWordsService>();
-builder.Services.AddScoped<IAiGenericWordsService, GroqGenericWordsService>();
+;
 builder.Services.AddScoped<IJobService, JobService>();
 builder.Services.AddScoped<IJobAddService, JobAddService>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:33:1
 builder.Services.AddSingleton<IGroqService, GroqService>();
 builder.Services.AddScoped<IGenericWordsService, GenericWordsService>();
 builder.Services.AddScoped<IAiGenericWordsService, GroqGenericWordsService>();
-builder.Services.AddScoped<IJobService, JobService>();
+;
 builder.Services.AddScoped<IJobAddService, JobAddService>();
 builder.Services.AddSingleton<IJobGameService, GameServiceSingleton>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:34:1
 builder.Services.AddScoped<IGenericWordsService, GenericWordsService>();
 builder.Services.AddScoped<IAiGenericWordsService, GroqGenericWordsService>();
 builder.Services.AddScoped<IJobService, JobService>();
-builder.Services.AddScoped<IJobAddService, JobAddService>();
+;
 builder.Services.AddSingleton<IJobGameService, GameServiceSingleton>();
 builder.Services.AddSingleton<IUserGameService, UserGameSingleton>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:35:1
 builder.Services.AddScoped<IAiGenericWordsService, GroqGenericWordsService>();
 builder.Services.AddScoped<IJobService, JobService>();
 builder.Services.AddScoped<IJobAddService, JobAddService>();
-builder.Services.AddSingleton<IJobGameService, GameServiceSingleton>();
+;
 builder.Services.AddSingleton<IUserGameService, UserGameSingleton>();
 builder.Services.AddSingleton<IQuizGameService, QuizGameSingleton>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:36:1
 builder.Services.AddScoped<IJobService, JobService>();
 builder.Services.AddScoped<IJobAddService, JobAddService>();
 builder.Services.AddSingleton<IJobGameService, GameServiceSingleton>();
-builder.Services.AddSingleton<IUserGameService, UserGameSingleton>();
+;
 builder.Services.AddSingleton<IQuizGameService, QuizGameSingleton>();
 builder.Services.AddScoped<IUserPersistence, UserPersistence>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:37:1
 builder.Services.AddScoped<IJobAddService, JobAddService>();
 builder.Services.AddSingleton<IJobGameService, GameServiceSingleton>();
 builder.Services.AddSingleton<IUserGameService, UserGameSingleton>();
-builder.Services.AddSingleton<IQuizGameService, QuizGameSingleton>();
+;
 builder.Services.AddScoped<IUserPersistence, UserPersistence>();
 builder.Services.AddScoped<IUserService, UserService>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:38:1
 builder.Services.AddSingleton<IJobGameService, GameServiceSingleton>();
 builder.Services.AddSingleton<IUserGameService, UserGameSingleton>();
 builder.Services.AddSingleton<IQuizGameService, QuizGameSingleton>();
-builder.Services.AddScoped<IUserPersistence, UserPersistence>();
+;
 builder.Services.AddScoped<IUserService, UserService>();
 builder.Services.AddScoped<ICommentsService, CommentsService>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:39:1
 builder.Services.AddSingleton<IUserGameService, UserGameSingleton>();
 builder.Services.AddSingleton<IQuizGameService, QuizGameSingleton>();
 builder.Services.AddScoped<IUserPersistence, UserPersistence>();
-builder.Services.AddScoped<IUserService, UserService>();
+;
 builder.Services.AddScoped<ICommentsService, CommentsService>();
 builder.Services.AddScoped<IUserCommentsService, UserCommentsService>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:40:1
 builder.Services.AddSingleton<IQuizGameService, QuizGameSingleton>();
 builder.Services.AddScoped<IUserPersistence, UserPersistence>();
 builder.Services.AddScoped<IUserService, UserService>();
-builder.Services.AddScoped<ICommentsService, CommentsService>();
+;
 builder.Services.AddScoped<IUserCommentsService, UserCommentsService>();
 builder.Services.AddScoped<IFollowService, FollowService>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:41:1
 builder.Services.AddScoped<IUserPersistence, UserPersistence>();
 builder.Services.AddScoped<IUserService, UserService>();
 builder.Services.AddScoped<ICommentsService, CommentsService>();
-builder.Services.AddScoped<IUserCommentsService, UserCommentsService>();
+;
 builder.Services.AddScoped<IFollowService, FollowService>();
 builder.Services.AddScoped<IEmailService, EmailService>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:42:1
 builder.Services.AddScoped<IUserService, UserService>();
 builder.Services.AddScoped<ICommentsService, CommentsService>();
 builder.Services.AddScoped<IUserCommentsService, UserCommentsService>();
-builder.Services.AddScoped<IFollowService, FollowService>();
+;
 builder.Services.AddScoped<IEmailService, EmailService>();
 builder.Services.AddOptions();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:43:1
 builder.Services.AddScoped<ICommentsService, CommentsService>();
 builder.Services.AddScoped<IUserCommentsService, UserCommentsService>();
 builder.Services.AddScoped<IFollowService, FollowService>();
-builder.Services.AddScoped<IEmailService, EmailService>();
+;
 builder.Services.AddOptions();
 builder.Services.AddHttpClient<ResendClient>();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:44:1
 builder.Services.AddScoped<IUserCommentsService, UserCommentsService>();
 builder.Services.AddScoped<IFollowService, FollowService>();
 builder.Services.AddScoped<IEmailService, EmailService>();
-builder.Services.AddOptions();
+;
 builder.Services.AddHttpClient<ResendClient>();
 builder.Services.Configure<ResendClientOptions>(o =>

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:45:1
 builder.Services.AddScoped<IFollowService, FollowService>();
 builder.Services.AddScoped<IEmailService, EmailService>();
 builder.Services.AddOptions();
-builder.Services.AddHttpClient<ResendClient>();
+;
 builder.Services.Configure<ResendClientOptions>(o =>
 {

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:46:1
 builder.Services.AddScoped<IEmailService, EmailService>();
 builder.Services.AddOptions();
 builder.Services.AddHttpClient<ResendClient>();
-builder.Services.Configure<ResendClientOptions>(o =>
-{
-    o.ApiToken = Environment.GetEnvironmentVariable("RESEND_API_KEY")
-        ?? throw new InvalidOperationException("RESEND_API_KEY environment variable is required");
-});
+;
 builder.Services.AddTransient<IResend, ResendClient>();
 builder.Services.AddScoped<Microsoft.AspNetCore.Identity.IPasswordHasher<User>, Microsoft.AspNetCore.Identity.PasswordHasher<User>>();

[NoCoverage] Null coalescing mutation (remove right)
GetEmployedCS/Back-end/src/Program.cs:48:18
 builder.Services.AddHttpClient<ResendClient>();
 builder.Services.Configure<ResendClientOptions>(o =>
 {
-    o.ApiToken = Environment.GetEnvironmentVariable("RESEND_API_KEY")
-        ?? throw new InvalidOperationException("RESEND_API_KEY environment variable is required");
+    o.ApiToken = Environment.GetEnvironmentVariable("RESEND_API_KEY");
 });
 builder.Services.AddTransient<IResend, ResendClient>();

[NoCoverage] String mutation
GetEmployedCS/Back-end/src/Program.cs:48:53
 builder.Services.AddHttpClient<ResendClient>();
 builder.Services.Configure<ResendClientOptions>(o =>
 {
-    o.ApiToken = Environment.GetEnvironmentVariable("RESEND_API_KEY")
+    o.ApiToken = Environment.GetEnvironmentVariable("")
         ?? throw new InvalidOperationException("RESEND_API_KEY environment variable is required");
 });

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:51:1
     o.ApiToken = Environment.GetEnvironmentVariable("RESEND_API_KEY")
         ?? throw new InvalidOperationException("RESEND_API_KEY environment variable is required");
 });
-builder.Services.AddTransient<IResend, ResendClient>();
+;
 builder.Services.AddScoped<Microsoft.AspNetCore.Identity.IPasswordHasher<User>, Microsoft.AspNetCore.Identity.PasswordHasher<User>>();
 

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:52:1
         ?? throw new InvalidOperationException("RESEND_API_KEY environment variable is required");
 });
 builder.Services.AddTransient<IResend, ResendClient>();
-builder.Services.AddScoped<Microsoft.AspNetCore.Identity.IPasswordHasher<User>, Microsoft.AspNetCore.Identity.PasswordHasher<User>>();
+;
 
 builder.Services.Configure<ForwardedHeadersOptions>(options =>

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:54:1
 builder.Services.AddTransient<IResend, ResendClient>();
 builder.Services.AddScoped<Microsoft.AspNetCore.Identity.IPasswordHasher<User>, Microsoft.AspNetCore.Identity.PasswordHasher<User>>();
 
-builder.Services.Configure<ForwardedHeadersOptions>(options =>
-{
-    options.ForwardedHeaders = ForwardedHeaders.XForwardedFor | ForwardedHeaders.XForwardedProto;
-    options.KnownNetworks.Clear(); 
-    options.KnownProxies.Clear();
-});
+;
 
 builder.Services.AddCors(options =>

[NoCoverage] Bitwise mutation
GetEmployedCS/Back-end/src/Program.cs:56:32
 
 builder.Services.Configure<ForwardedHeadersOptions>(options =>
 {
-    options.ForwardedHeaders = ForwardedHeaders.XForwardedFor | ForwardedHeaders.XForwardedProto;
+    options.ForwardedHeaders = ForwardedHeaders.XForwardedFor & ForwardedHeaders.XForwardedProto;
     options.KnownNetworks.Clear(); 
     options.KnownProxies.Clear();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:57:5
 builder.Services.Configure<ForwardedHeadersOptions>(options =>
 {
     options.ForwardedHeaders = ForwardedHeaders.XForwardedFor | ForwardedHeaders.XForwardedProto;
-    options.KnownNetworks.Clear(); 
+    ; 
     options.KnownProxies.Clear();
 });

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:58:5
 {
     options.ForwardedHeaders = ForwardedHeaders.XForwardedFor | ForwardedHeaders.XForwardedProto;
     options.KnownNetworks.Clear(); 
-    options.KnownProxies.Clear();
+    ;
 });
 

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:61:1
     options.KnownProxies.Clear();
 });
 
-builder.Services.AddCors(options =>
-{
-    options.AddDefaultPolicy(policy =>
-    {
-        var origins = new HashSet<string> {"https://localhost", "https://localhost:3000", "https://getemployedcs.ca", "https://www.getemployedcs.ca"};
-        var envOrigin = Environment.GetEnvironmentVariable("FRONTEND_URL");
-
-        if (!string.IsNullOrEmpty(envOrigin))
-        {
-            origins.Add(envOrigin);
-        }
-
-        policy.WithOrigins([.. origins])
-              .AllowAnyHeader()
-              .AllowAnyMethod()
-              .AllowCredentials();
-    });
-});
+;
 
 

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:63:5
 
 builder.Services.AddCors(options =>
 {
-    options.AddDefaultPolicy(policy =>
-    {
-        var origins = new HashSet<string> {"https://localhost", "https://localhost:3000", "https://getemployedcs.ca", "https://www.getemployedcs.ca"};
-        var envOrigin = Environment.GetEnvironmentVariable("FRONTEND_URL");
-
-        if (!string.IsNullOrEmpty(envOrigin))
-        {
-            origins.Add(envOrigin);
-        }
-
-        policy.WithOrigins([.. origins])
-              .AllowAnyHeader()
-              .AllowAnyMethod()
-              .AllowCredentials();
-    });
+    ;
 });
 

[NoCoverage] String mutation
GetEmployedCS/Back-end/src/Program.cs:65:119
 {
     options.AddDefaultPolicy(policy =>
     {
-        var origins = new HashSet<string> {"https://localhost", "https://localhost:3000", "https://getemployedcs.ca", "https://www.getemployedcs.ca"};
+        var origins = new HashSet<string> {"https://localhost", "https://localhost:3000", "https://getemployedcs.ca", ""};
         var envOrigin = Environment.GetEnvironmentVariable("FRONTEND_URL");
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
GetEmployedCS/Back-end/src/Program.cs:68:13
         var origins = new HashSet<string> {"https://localhost", "https://localhost:3000", "https://getemployedcs.ca", "https://www.getemployedcs.ca"};
         var envOrigin = Environment.GetEnvironmentVariable("FRONTEND_URL");
 
-        if (!string.IsNullOrEmpty(envOrigin))
+        if (string.IsNullOrEmpty(envOrigin))
         {
             origins.Add(envOrigin);

[NoCoverage] String mutation
GetEmployedCS/Back-end/src/Program.cs:68:14
         var origins = new HashSet<string> {"https://localhost", "https://localhost:3000", "https://getemployedcs.ca", "https://www.getemployedcs.ca"};
         var envOrigin = Environment.GetEnvironmentVariable("FRONTEND_URL");
 
-        if (!string.IsNullOrEmpty(envOrigin))
+        if (!(envOrigin!=null))
         {
             origins.Add(envOrigin);

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:70:13
 
         if (!string.IsNullOrEmpty(envOrigin))
         {
-            origins.Add(envOrigin);
+            ;
         }
 

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:73:9
             origins.Add(envOrigin);
         }
 
-        policy.WithOrigins([.. origins])
-              .AllowAnyHeader()
-              .AllowAnyMethod()
-              .AllowCredentials();
+        ;
     });
 });

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:81:1
 });
 
 
-builder.Services.AddAuthentication(CookieAuthenticationDefaults.AuthenticationScheme)
-    .AddCookie(options =>
-    {
-        options.Cookie.Name = "auth";
-        options.Cookie.Domain = builder.Environment.IsDevelopment()
-            ? null : ".getemployedcs.ca";
-        options.Cookie.HttpOnly = true;
-        options.Cookie.SameSite = SameSiteMode.Lax;
-        options.Cookie.SecurePolicy = builder.Environment.IsDevelopment() 
-            ? CookieSecurePolicy.SameAsRequest : CookieSecurePolicy.Always;
-        options.SlidingExpiration = true;
-        options.ExpireTimeSpan = TimeSpan.FromHours(1);
-        options.Events.OnRedirectToLogin = ctx =>
-        {
-            ctx.Response.StatusCode = StatusCodes.Status401Unauthorized;
-            return Task.CompletedTask;
-        };
-        options.Events.OnRedirectToAccessDenied = ctx =>
-        {
-            ctx.Response.StatusCode = StatusCodes.Status403Forbidden;
-            return Task.CompletedTask;
-        };
-    });
+;
 
 builder.Services.AddAuthorization();

[NoCoverage] String mutation
GetEmployedCS/Back-end/src/Program.cs:84:31
 builder.Services.AddAuthentication(CookieAuthenticationDefaults.AuthenticationScheme)
     .AddCookie(options =>
     {
-        options.Cookie.Name = "auth";
+        options.Cookie.Name = "";
         options.Cookie.Domain = builder.Environment.IsDevelopment()
             ? null : ".getemployedcs.ca";

[NoCoverage] Conditional (false) mutation
GetEmployedCS/Back-end/src/Program.cs:85:33
     .AddCookie(options =>
     {
         options.Cookie.Name = "auth";
-        options.Cookie.Domain = builder.Environment.IsDevelopment()
-            ? null : ".getemployedcs.ca";
+        options.Cookie.Domain = (false?null :".getemployedcs.ca");
         options.Cookie.HttpOnly = true;
         options.Cookie.SameSite = SameSiteMode.Lax;

[NoCoverage] Conditional (true) mutation
GetEmployedCS/Back-end/src/Program.cs:85:33
     .AddCookie(options =>
     {
         options.Cookie.Name = "auth";
-        options.Cookie.Domain = builder.Environment.IsDevelopment()
-            ? null : ".getemployedcs.ca";
+        options.Cookie.Domain = (true?null :".getemployedcs.ca");
         options.Cookie.HttpOnly = true;
         options.Cookie.SameSite = SameSiteMode.Lax;

[NoCoverage] Boolean mutation
GetEmployedCS/Back-end/src/Program.cs:87:35
         options.Cookie.Name = "auth";
         options.Cookie.Domain = builder.Environment.IsDevelopment()
             ? null : ".getemployedcs.ca";
-        options.Cookie.HttpOnly = true;
+        options.Cookie.HttpOnly = false;
         options.Cookie.SameSite = SameSiteMode.Lax;
         options.Cookie.SecurePolicy = builder.Environment.IsDevelopment() 

[NoCoverage] Conditional (false) mutation
GetEmployedCS/Back-end/src/Program.cs:89:39
             ? null : ".getemployedcs.ca";
         options.Cookie.HttpOnly = true;
         options.Cookie.SameSite = SameSiteMode.Lax;
-        options.Cookie.SecurePolicy = builder.Environment.IsDevelopment() 
-            ? CookieSecurePolicy.SameAsRequest : CookieSecurePolicy.Always;
+        options.Cookie.SecurePolicy = (false?CookieSecurePolicy.SameAsRequest :CookieSecurePolicy.Always);
         options.SlidingExpiration = true;
         options.ExpireTimeSpan = TimeSpan.FromHours(1);

[NoCoverage] Conditional (true) mutation
GetEmployedCS/Back-end/src/Program.cs:89:39
             ? null : ".getemployedcs.ca";
         options.Cookie.HttpOnly = true;
         options.Cookie.SameSite = SameSiteMode.Lax;
-        options.Cookie.SecurePolicy = builder.Environment.IsDevelopment() 
-            ? CookieSecurePolicy.SameAsRequest : CookieSecurePolicy.Always;
+        options.Cookie.SecurePolicy = (true?CookieSecurePolicy.SameAsRequest :CookieSecurePolicy.Always);
         options.SlidingExpiration = true;
         options.ExpireTimeSpan = TimeSpan.FromHours(1);

[NoCoverage] Boolean mutation
GetEmployedCS/Back-end/src/Program.cs:91:37
         options.Cookie.SameSite = SameSiteMode.Lax;
         options.Cookie.SecurePolicy = builder.Environment.IsDevelopment() 
             ? CookieSecurePolicy.SameAsRequest : CookieSecurePolicy.Always;
-        options.SlidingExpiration = true;
+        options.SlidingExpiration = false;
         options.ExpireTimeSpan = TimeSpan.FromHours(1);
         options.Events.OnRedirectToLogin = ctx =>

[NoCoverage] Block removal mutation
GetEmployedCS/Back-end/src/Program.cs:94:9
         options.SlidingExpiration = true;
         options.ExpireTimeSpan = TimeSpan.FromHours(1);
         options.Events.OnRedirectToLogin = ctx =>
-        {
-            ctx.Response.StatusCode = StatusCodes.Status401Unauthorized;
-            return Task.CompletedTask;
-        };
+        {};
         options.Events.OnRedirectToAccessDenied = ctx =>
         {

[NoCoverage] Block removal mutation
GetEmployedCS/Back-end/src/Program.cs:99:9
             return Task.CompletedTask;
         };
         options.Events.OnRedirectToAccessDenied = ctx =>
-        {
-            ctx.Response.StatusCode = StatusCodes.Status403Forbidden;
-            return Task.CompletedTask;
-        };
+        {};
     });
 

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:105:1
         };
     });
 
-builder.Services.AddAuthorization();
+;
 
 

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:115:5
 {
     app.UseSwagger();
     app.UseSwaggerUI();
-    app.UseHttpsRedirection();
+    ;
 }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
GetEmployedCS/Back-end/src/Program.cs:118:5
     app.UseHttpsRedirection();
 }
 
-if (!app.Environment.IsDevelopment())
+if (app.Environment.IsDevelopment())
 {
     app.UseForwardedHeaders();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:120:5
 
 if (!app.Environment.IsDevelopment())
 {
-    app.UseForwardedHeaders();
+    ;
 }
 

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:124:1
 }
 
 app.UseCors();
-app.UseAuthentication();
+;
 app.UseAuthorization();
 

[NoCoverage] String mutation
GetEmployedCS/Back-end/src/Program.cs:129:38
 
 var summaries = new[]
 {
-    "Freezing", "Bracing", "Chilly", "Cool", "Mild", "Warm", "Balmy", "Hot", "Sweltering", "Scorching"
+    "Freezing", "Bracing", "Chilly", "", "Mild", "Warm", "Balmy", "Hot", "Sweltering", "Scorching"
 };
 

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:132:1
     "Freezing", "Bracing", "Chilly", "Cool", "Mild", "Warm", "Balmy", "Hot", "Sweltering", "Scorching"
 };
 
-app.MapGet("/weatherforecast", () =>
-{
-    var forecast =  Enumerable.Range(1, 5).Select(index =>
-        new WeatherForecast
-        (
-            DateOnly.FromDateTime(DateTime.Now.AddDays(index)),
-            Random.Shared.Next(-20, 55),
-            summaries[Random.Shared.Next(summaries.Length)]
-        ))
-        .ToArray();
-    return forecast;
-})
-.WithName("GetWeatherForecast")
-.WithOpenApi();
+;
 
 app.MapJobEndpoints();

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
GetEmployedCS/Back-end/src/Program.cs:138:32
         new WeatherForecast
         (
             DateOnly.FromDateTime(DateTime.Now.AddDays(index)),
-            Random.Shared.Next(-20, 55),
+            Random.Shared.Next(+20, 55),
             summaries[Random.Shared.Next(summaries.Length)]
         ))

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:147:1
 .WithName("GetWeatherForecast")
 .WithOpenApi();
 
-app.MapJobEndpoints();
+;
 app.MapJobGameEndpoints();
 app.MapJobCreationEndpoints();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:148:1
 .WithOpenApi();
 
 app.MapJobEndpoints();
-app.MapJobGameEndpoints();
+;
 app.MapJobCreationEndpoints();
 app.MapUserEndpoints();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:149:1
 
 app.MapJobEndpoints();
 app.MapJobGameEndpoints();
-app.MapJobCreationEndpoints();
+;
 app.MapUserEndpoints();
 app.MapUserGameEndpoints();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:150:1
 app.MapJobEndpoints();
 app.MapJobGameEndpoints();
 app.MapJobCreationEndpoints();
-app.MapUserEndpoints();
+;
 app.MapUserGameEndpoints();
 app.MapCommentsEndpoints();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:151:1
 app.MapJobGameEndpoints();
 app.MapJobCreationEndpoints();
 app.MapUserEndpoints();
-app.MapUserGameEndpoints();
+;
 app.MapCommentsEndpoints();
 app.MapQuizGameEndpoints();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:152:1
 app.MapJobCreationEndpoints();
 app.MapUserEndpoints();
 app.MapUserGameEndpoints();
-app.MapCommentsEndpoints();
+;
 app.MapQuizGameEndpoints();
 app.MapGenericWordEndpoints();

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:153:1
 app.MapUserEndpoints();
 app.MapUserGameEndpoints();
 app.MapCommentsEndpoints();
-app.MapQuizGameEndpoints();
+;
 app.MapGenericWordEndpoints();
 

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:154:1
 app.MapUserGameEndpoints();
 app.MapCommentsEndpoints();
 app.MapQuizGameEndpoints();
-app.MapGenericWordEndpoints();
+;
 
 if (app.Environment.IsDevelopment())

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:158:5
 
 if (app.Environment.IsDevelopment())
 {
-    app.Run();
+    ;
 }
 else

[NoCoverage] Statement mutation
GetEmployedCS/Back-end/src/Program.cs:162:5
 }
 else
 {
-    app.Run($"http://0.0.0.0:{port}");
+    ;
 }
 

[NoCoverage] String mutation
GetEmployedCS/Back-end/src/Program.cs:162:13
 }
 else
 {
-    app.Run($"http://0.0.0.0:{port}");
+    app.Run($"");
 }
 

[NoCoverage] Arithmetic mutation
GetEmployedCS/Back-end/src/Program.cs:167:32
 
 record WeatherForecast(DateOnly Date, int TemperatureC, string? Summary)
 {
-    public int TemperatureF => 32 + (int)(TemperatureC / 0.5556);
+    public int TemperatureF => 32 - (int)(TemperatureC / 0.5556);
 }
 

[NoCoverage] Arithmetic mutation
GetEmployedCS/Back-end/src/Program.cs:167:43
 
 record WeatherForecast(DateOnly Date, int TemperatureC, string? Summary)
 {
-    public int TemperatureF => 32 + (int)(TemperatureC / 0.5556);
+    public int TemperatureF => 32 + (int)(TemperatureC * 0.5556);
 }
 
