[Killed] Block removal mutation
Back-end/src/Objects/Experience.cs:11:5
     public string JobDescription { get; set; }
 
     public Experience(int experienceId, string companyName, string positionTitle, string jobDescription)
-    {
-        this.ExperienceId = experienceId;
-        this.CompanyName = companyName;
-        this.PositionTitle = positionTitle;
-        this.JobDescription = jobDescription;
-    }
+    {}
 }
killedBy: test.ExperienceObjectAdapterTest.EmptyCompanyNameTest; test.ExperienceObjectAdapterTest.EmptyPositionTitleTest; test.ExperienceObjectAdapterTest.HappyCaseTest
