[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/AI/GroqService.cs:23:23
     public GroqService(IConfiguration config)
     {
         var apiKey = config["GROQ_API_KEY"];
-        IsAvailable = !string.IsNullOrEmpty(apiKey);
+        IsAvailable = string.IsNullOrEmpty(apiKey);
 
         apiUrl = config["GROQ_API_URL"] ?? throw new InvalidOperationException("GROQ_API_URL is not configured.");

[NoCoverage] String mutation
Services/Implementations/AI/GroqService.cs:23:24
     public GroqService(IConfiguration config)
     {
         var apiKey = config["GROQ_API_KEY"];
-        IsAvailable = !string.IsNullOrEmpty(apiKey);
+        IsAvailable = !(apiKey!=null);
 
         apiUrl = config["GROQ_API_URL"] ?? throw new InvalidOperationException("GROQ_API_URL is not configured.");

[NoCoverage] Null coalescing mutation (remove right)
Services/Implementations/AI/GroqService.cs:25:18
         var apiKey = config["GROQ_API_KEY"];
         IsAvailable = !string.IsNullOrEmpty(apiKey);
 
-        apiUrl = config["GROQ_API_URL"] ?? throw new InvalidOperationException("GROQ_API_URL is not configured.");
+        apiUrl = config["GROQ_API_URL"];
         model = config["GROQ_MODEL"] ?? throw new InvalidOperationException("GROQ_MODEL is not configured.");
 

[NoCoverage] String mutation
Services/Implementations/AI/GroqService.cs:25:80
         var apiKey = config["GROQ_API_KEY"];
         IsAvailable = !string.IsNullOrEmpty(apiKey);
 
-        apiUrl = config["GROQ_API_URL"] ?? throw new InvalidOperationException("GROQ_API_URL is not configured.");
+        apiUrl = config["GROQ_API_URL"] ?? throw new InvalidOperationException("");
         model = config["GROQ_MODEL"] ?? throw new InvalidOperationException("GROQ_MODEL is not configured.");
 

[NoCoverage] Null coalescing mutation (remove right)
Services/Implementations/AI/GroqService.cs:26:17
         IsAvailable = !string.IsNullOrEmpty(apiKey);
 
         apiUrl = config["GROQ_API_URL"] ?? throw new InvalidOperationException("GROQ_API_URL is not configured.");
-        model = config["GROQ_MODEL"] ?? throw new InvalidOperationException("GROQ_MODEL is not configured.");
+        model = config["GROQ_MODEL"];
 
         httpClient = new HttpClient { Timeout = Timeout };

[NoCoverage] Object initializer mutation
Services/Implementations/AI/GroqService.cs:28:22
         apiUrl = config["GROQ_API_URL"] ?? throw new InvalidOperationException("GROQ_API_URL is not configured.");
         model = config["GROQ_MODEL"] ?? throw new InvalidOperationException("GROQ_MODEL is not configured.");
 
-        httpClient = new HttpClient { Timeout = Timeout };
+        httpClient = new HttpClient {};
 
         if (IsAvailable)

[NoCoverage] Negate expression
Services/Implementations/AI/GroqService.cs:30:13
 
         httpClient = new HttpClient { Timeout = Timeout };
 
-        if (IsAvailable)
+        if (!(IsAvailable))
         {
             httpClient.DefaultRequestHeaders.Authorization =

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/AI/GroqService.cs:43:13
     /// <returns>The model's response as a plain string.</returns>
     public async Task<string> CompleteAsync(string systemPrompt, string userPrompt)
     {
-        if (!IsAvailable)
+        if (IsAvailable)
             throw new InvalidOperationException("Groq API key is not configured.");
 

[NoCoverage] Statement mutation
Services/Implementations/AI/GroqService.cs:44:13
     public async Task<string> CompleteAsync(string systemPrompt, string userPrompt)
     {
         if (!IsAvailable)
-            throw new InvalidOperationException("Groq API key is not configured.");
+            ;
 
         var requestBody = new

[NoCoverage] String mutation
Services/Implementations/AI/GroqService.cs:51:30
             model = model,
             messages = new[]
             {
-                new { role = "system", content = systemPrompt },
+                new { role = "", content = systemPrompt },
                 new { role = "user", content = userPrompt }
             },

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/AI/GroqService.cs:62:13
         var content = new StringContent(json, Encoding.UTF8, "application/json");
 
         var response = await httpClient.PostAsync(apiUrl, content);
-        if (!response.IsSuccessStatusCode)
+        if (response.IsSuccessStatusCode)
         {
             var errorBody = await response.Content.ReadAsStringAsync();

[NoCoverage] Statement mutation
Services/Implementations/AI/GroqService.cs:65:13
         if (!response.IsSuccessStatusCode)
         {
             var errorBody = await response.Content.ReadAsStringAsync();
-            throw new HttpRequestException($"{(int)response.StatusCode} {response.ReasonPhrase}: {errorBody}");
+            ;
         }
 

[NoCoverage] String mutation
Services/Implementations/AI/GroqService.cs:65:44
         if (!response.IsSuccessStatusCode)
         {
             var errorBody = await response.Content.ReadAsStringAsync();
-            throw new HttpRequestException($"{(int)response.StatusCode} {response.ReasonPhrase}: {errorBody}");
+            throw new HttpRequestException($"");
         }
 

[NoCoverage] Null coalescing mutation (remove right)
Services/Implementations/AI/GroqService.cs:71:16
         var responseJson = await response.Content.ReadAsStringAsync();
         using var doc = JsonDocument.Parse(responseJson);
 
-        return doc.RootElement
-            .GetProperty("choices")[0]
-            .GetProperty("message")
-            .GetProperty("content")
-            .GetString() ?? throw new InvalidOperationException("Empty response from Groq.");
+        return doc.RootElement
+            .GetProperty("choices")[0]
+            .GetProperty("message")
+            .GetProperty("content")
+            .GetString();
     }
 }

[NoCoverage] String mutation
Services/Implementations/AI/GroqService.cs:72:26
         using var doc = JsonDocument.Parse(responseJson);
 
         return doc.RootElement
-            .GetProperty("choices")[0]
+            .GetProperty("")[0]
             .GetProperty("message")
             .GetProperty("content")

[NoCoverage] String mutation
Services/Implementations/AI/GroqService.cs:73:26
 
         return doc.RootElement
             .GetProperty("choices")[0]
-            .GetProperty("message")
+            .GetProperty("")
             .GetProperty("content")
             .GetString() ?? throw new InvalidOperationException("Empty response from Groq.");

[NoCoverage] String mutation
Services/Implementations/AI/GroqService.cs:74:26
         return doc.RootElement
             .GetProperty("choices")[0]
             .GetProperty("message")
-            .GetProperty("content")
+            .GetProperty("")
             .GetString() ?? throw new InvalidOperationException("Empty response from Groq.");
     }
