[Killed] Block removal mutation
Back-end/src/Objects/Job.cs:20:5
     public string JobDescription { get; set; }
 
-    {
-        this.JobTitle = jobTitle;
-        this.ApplicationDeadline = applicationDeadline;
-        this.PosterName = posterName;
-        this.EmployerPoster = employerPoster;
-        this.ApplicationLink = applicationLink;
-        this.HasRemote = hasRemote;
-        this.HasHybrid = hasHybrid;
-        this.PositionType = positionType;
-        this.EmploymentType = employmentType;
-        this.Locations = locations;
-        this.ProgrammingLanguages = programmingLanguages;
-        this.JobDescription = jobDescription;
-    }
+    {}
 
     //Construct all non-nullable types.
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Block removal mutation
Back-end/src/Objects/Job.cs:37:5
 
     //Construct all non-nullable types.
     public Job(string jobTitle, string applicationLink, string positionType, string employmentType, string jobDescription)
-    {
-        this.JobTitle = jobTitle;
-        this.ApplicationLink = applicationLink;
-        this.PositionType = positionType;
-        this.EmploymentType = employmentType;
-        this.JobDescription = jobDescription;
-    }
+    {}
 }
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest
