[Killed] Block removal mutation
Back-end/src/Objects/JobComment.cs:12:5
     public string PosterUsername { get; set; }
 
     public JobComment(string comment, int posterId, int jobId, string posterUsername)
-    {
-        this.Comment = comment;
-        this.PosterUserId = posterId;
-        this.JobId = jobId;
-        this.PosterUsername = posterUsername;
-    }
+    {}
 }
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest
