[Survived] Block removal mutation
Back-end/src/Objects/QuizItem.cs:10:5
     public string strongSentence {get; set;}
 
     public QuizItem(string weakSentence, string strongSentence)
-    {
-        this.weakSentence = weakSentence;
-        this.strongSentence = strongSentence;
-    }
+    {}
 }
