[NoCoverage] Equality mutation
Back-end/src/Objects/QuizOptions.cs:12:13
     public QuizOptions(QuizItem quizItem) 
     {
         Random rnd = new Random();
-        if (rnd.Next(0, 2) == 0)
+        if (rnd.Next(0, 2) != 0)
         {
             sentence1 = quizItem.strongSentence;

[NoCoverage] Block removal mutation
Back-end/src/Objects/QuizOptions.cs:13:9
     {
         Random rnd = new Random();
         if (rnd.Next(0, 2) == 0)
-        {
-            sentence1 = quizItem.strongSentence;
-            sentence2 = quizItem.weakSentence;
-        }
+        {}
         else
         {

[NoCoverage] Block removal mutation
Back-end/src/Objects/QuizOptions.cs:18:9
             sentence2 = quizItem.weakSentence;
         }
         else
-        {
-            sentence1 = quizItem.weakSentence;
-            sentence2 = quizItem.strongSentence;
-        }
+        {}
     }
 }
