[Killed] Block removal mutation
Back-end/src/Objects/User.cs:18:5
     public bool Verified { get; set; }
 
     protected User(int userId, string email, string username, string password, string about)
-    {
-        this.UserId = userId;
-        this.Email = email;
-        this.Username = username;
-        this.Password = password;
-        this.About = about;
-    }
+    {}
 
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Boolean mutation
Back-end/src/Objects/User.cs:31:27
         this.FirstName = firstName;
         this.LastName = lastName;
         this.Experiences = experiences;
-        this.IsEmployer = false;
+        this.IsEmployer = true;
     }
 
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Survived] Boolean mutation
Back-end/src/Objects/User.cs:37:27
     public User(int userId, string email, string username, string password, string about, string employerName) : this(userId, email, username, password, about)
     {
         this.EmployerName = employerName;
-        this.IsEmployer = true;
+        this.IsEmployer = false;
     }
 }
