[Timeout] Block removal mutation
Back-end/src/Objects/UserComment.cs:11:5
     public string PosterUsername { get; set; }
 
     public UserComment(string comment, int posterId, int profileUserId, string posterUsername)
-    {
-        this.Comment = comment;
-        this.PosterUserId = posterId;
-        this.ProfileUserId = profileUserId;
-        this.PosterUsername = posterUsername;
-    }
+    {}
 }
