[Killed] Negate expression
Implementations/Adapters/EntityAdapters/ExperienceEntityAdapter.cs:11:13
 {
     private static void ValidateEntity(ExperienceEntity experienceEntity)
     {
-        if (experienceEntity.company_name.Trim().Equals(String.Empty))
+        if (!(experienceEntity.company_name.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("Experience entity cannot have empty company name.");
killedBy: test.ExperienceEntityAdapterTest.EmptyCompanyNameTest; test.ExperienceEntityAdapterTest.HappyCaseTest; test.ExperienceEntityAdapterTest.SpaceCompanyNameTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/ExperienceEntityAdapter.cs:13:13
     {
         if (experienceEntity.company_name.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Experience entity cannot have empty company name.");
+            ;
         }
 
killedBy: test.ExperienceEntityAdapterTest.EmptyCompanyNameTest; test.ExperienceEntityAdapterTest.SpaceCompanyNameTest

[Killed] Negate expression
Implementations/Adapters/EntityAdapters/ExperienceEntityAdapter.cs:16:13
             throw new ObjectConversionException("Experience entity cannot have empty company name.");
         }
 
-        if (experienceEntity.position_title.Trim().Equals(String.Empty))
+        if (!(experienceEntity.position_title.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("Experience entity cannot have empty position title.");
killedBy: test.ExperienceEntityAdapterTest.EmptyPositionTitleTest; test.ExperienceEntityAdapterTest.HappyCaseTest; test.ExperienceEntityAdapterTest.SpacePositionTitleTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/ExperienceEntityAdapter.cs:18:13
 
         if (experienceEntity.position_title.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Experience entity cannot have empty position title.");
+            ;
         }
     }
killedBy: test.ExperienceEntityAdapterTest.EmptyPositionTitleTest; test.ExperienceEntityAdapterTest.SpacePositionTitleTest

[Survived] String mutation
Implementations/Adapters/EntityAdapters/ExperienceEntityAdapter.cs:18:49
 
         if (experienceEntity.position_title.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Experience entity cannot have empty position title.");
+            throw new ObjectConversionException("");
         }
     }

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/ExperienceEntityAdapter.cs:24:9
 
     {
-        ValidateEntity(experienceEntity);
+        ;
     }
 }
killedBy: test.ExperienceEntityAdapterTest.EmptyCompanyNameTest; test.ExperienceEntityAdapterTest.EmptyPositionTitleTest; test.ExperienceEntityAdapterTest.SpaceCompanyNameTest
