[Killed] Negate expression
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:13:13
 {
     private static void ValidateEntity(JobEntity jobEntity)
     {
-        if (jobEntity.job_title.Trim().Equals(String.Empty))
+        if (!(jobEntity.job_title.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("Job entity cannot have empty job title.");
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:15:13
     {
         if (jobEntity.job_title.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Job entity cannot have empty job title.");
+            ;
         }
 
killedBy: test.JobEntityAdapterTest.EmptyJobTitleTest; test.JobEntityAdapterTest.SpaceJobTitleTest

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:18:13
             throw new ObjectConversionException("Job entity cannot have empty job title.");
         }
 
-        if (!ValidationRegex.linkRegex.IsMatch(jobEntity.application_link))
+        if (ValidationRegex.linkRegex.IsMatch(jobEntity.application_link))
         {
             throw new ObjectConversionException("Job entity must have a valid application link.");
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobEntityAdapterTest.EmptyApplicationLinkTest; test.JobEntityAdapterTest.HappyCaseTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:20:13
 
         if (!ValidationRegex.linkRegex.IsMatch(jobEntity.application_link))
         {
-            throw new ObjectConversionException("Job entity must have a valid application link.");
+            ;
         }
 
killedBy: test.JobEntityAdapterTest.EmptyApplicationLinkTest; test.JobEntityAdapterTest.MissingPostfixApplicationLinkTest; test.JobEntityAdapterTest.MissingPrefixApplicationLinkTest

[Survived] String mutation
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:20:49
 
         if (!ValidationRegex.linkRegex.IsMatch(jobEntity.application_link))
         {
-            throw new ObjectConversionException("Job entity must have a valid application link.");
+            throw new ObjectConversionException("");
         }
 

[Killed] Negate expression
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:23:13
             throw new ObjectConversionException("Job entity must have a valid application link.");
         }
 
-        if (jobEntity.position_type.Trim().Equals(String.Empty))
+        if (!(jobEntity.position_type.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("Job entity cannot have empty position type.");
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:25:13
 
         if (jobEntity.position_type.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Job entity cannot have empty position type.");
+            ;
         }
 
killedBy: test.JobEntityAdapterTest.EmptyPositionTypeTest; test.JobEntityAdapterTest.SpacePositionTypeTest

[Killed] Negate expression
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:28:13
             throw new ObjectConversionException("Job entity cannot have empty position type.");
         }
 
-        if (jobEntity.employment_type.Trim().Equals(String.Empty))
+        if (!(jobEntity.employment_type.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("Job entity cannot have empty employment type.");
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobEntityAdapterTest.EmptyEmploymentTypeTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:30:13
 
         if (jobEntity.employment_type.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Job entity cannot have empty employment type.");
+            ;
         }
 
killedBy: test.JobEntityAdapterTest.EmptyEmploymentTypeTest; test.JobEntityAdapterTest.SpaceEmploymentTypeTest

[Survived] String mutation
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:30:49
 
         if (jobEntity.employment_type.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Job entity cannot have empty employment type.");
+            throw new ObjectConversionException("");
         }
 

[Killed] Negate expression
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:33:13
             throw new ObjectConversionException("Job entity cannot have empty employment type.");
         }
 
-        if (jobEntity.job_description.Trim().Equals(String.Empty))
+        if (!(jobEntity.job_description.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("Job entity cannot have empty job description.");
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobEntityAdapterTest.EmptyJobDescriptionTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:35:13
 
         if (jobEntity.job_description.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Job entity cannot have empty job description.");
+            ;
         }
     }
killedBy: test.JobEntityAdapterTest.EmptyJobDescriptionTest; test.JobEntityAdapterTest.SpaceJobDescriptionTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:41:9
 
     public JobEntityAdapter(JobEntity jobEntity) : base(jobEntity.job_title, jobEntity.application_link, jobEntity.position_type, jobEntity.employment_type, jobEntity.job_description)
     {
-        ValidateEntity(jobEntity);
+        ;
 
         JobId = jobEntity.job_id;
killedBy: test.JobEntityAdapterTest.EmptyApplicationLinkTest; test.JobEntityAdapterTest.EmptyEmploymentTypeTest; test.JobEntityAdapterTest.EmptyJobDescriptionTest

[Survived] Statement mutation
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:58:9
         Locations = new();
         List<JobLocationEntity> jobLocationEntities = jobEntity.locations!.ToList();
 
-        jobLocationEntities.ForEach(e =>
-        {
-            Locations.Add(new JobLocation(e.location!).Location);
-        });
+        ;
 
         ProgrammingLanguages = new List<string>();

[NoCoverage] Statement mutation
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:60:13
 
         jobLocationEntities.ForEach(e =>
         {
-            Locations.Add(new JobLocation(e.location!).Location);
+            ;
         });
 

[Survived] Statement mutation
Implementations/Adapters/EntityAdapters/JobEntityAdapter.cs:64:9
         });
 
         ProgrammingLanguages = new List<string>();
-        jobEntity.programmingLanguages?.ToList().ForEach(e => ProgrammingLanguages.Add(e.language_name));
+        ;
     }
 }
