[Killed] Negate expression
Implementations/Adapters/EntityAdapters/QuizItemEntityAdapter.cs:11:13
 {
     private static void ValidateEntity(QuizItemEntity quizItemEntity)
     {
-        if (quizItemEntity.strong_sentence.Trim().Equals(String.Empty))
+        if (!(quizItemEntity.strong_sentence.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("QuizItemEntity entity cannot have empty strong sentence.");
killedBy: QuizItemAdapterTest.EmptyStrongTest; QuizItemAdapterTest.HappyCaseTest; QuizItemAdapterTest.SpaceStrongTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/QuizItemEntityAdapter.cs:13:13
     {
         if (quizItemEntity.strong_sentence.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("QuizItemEntity entity cannot have empty strong sentence.");
+            ;
         }
 
killedBy: QuizItemAdapterTest.EmptyStrongTest; QuizItemAdapterTest.SpaceStrongTest

[Killed] Negate expression
Implementations/Adapters/EntityAdapters/QuizItemEntityAdapter.cs:16:13
             throw new ObjectConversionException("QuizItemEntity entity cannot have empty strong sentence.");
         }
 
-        if (quizItemEntity.weak_sentence.Trim().Equals(String.Empty))
+        if (!(quizItemEntity.weak_sentence.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("QuizItemEntity entity cannot have empty weak setence.");
killedBy: QuizItemAdapterTest.EmptyWeakTest; QuizItemAdapterTest.HappyCaseTest; QuizItemAdapterTest.SpaceWeakTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/QuizItemEntityAdapter.cs:18:13
 
         if (quizItemEntity.weak_sentence.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("QuizItemEntity entity cannot have empty weak setence.");
+            ;
         }
     }
killedBy: QuizItemAdapterTest.EmptyWeakTest; QuizItemAdapterTest.SpaceWeakTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/QuizItemEntityAdapter.cs:24:9
 
     public QuizItemEntityAdapter(QuizItemEntity quizItemEntity) : base(quizItemEntity.weak_sentence, quizItemEntity.strong_sentence)
     {
-        ValidateEntity(quizItemEntity);
+        ;
     }
 }
killedBy: QuizItemAdapterTest.EmptyStrongTest; QuizItemAdapterTest.EmptyWeakTest; QuizItemAdapterTest.SpaceStrongTest
