[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/UserCommentEntityAdapter.cs:11:9
 {
     {
-        ValidateEntity(userCommentEntity);
+        ;
     }
 
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Negate expression
Implementations/Adapters/EntityAdapters/UserCommentEntityAdapter.cs:16:12
 
     private static void ValidateEntity(UserCommentEntity userCommentEntity)
     {
-        if(userCommentEntity.comment.Trim().Equals(String.Empty))
+        if(!(userCommentEntity.comment.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("User comment entity must have non-empty comment");
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[NoCoverage] Statement mutation
Implementations/Adapters/EntityAdapters/UserCommentEntityAdapter.cs:18:13
     {
         if(userCommentEntity.comment.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("User comment entity must have non-empty comment");
+            ;
         }
 

[Killed] Equality mutation
Implementations/Adapters/EntityAdapters/UserCommentEntityAdapter.cs:21:12
             throw new ObjectConversionException("User comment entity must have non-empty comment");
         }
 
-        if(userCommentEntity.poster_id < 0)
+        if(userCommentEntity.poster_id > 0)
         {
             throw new ObjectConversionException("User comment entity must have non-negative poster user ID");
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Equality mutation
Implementations/Adapters/EntityAdapters/UserCommentEntityAdapter.cs:21:12
             throw new ObjectConversionException("User comment entity must have non-empty comment");
         }
 
-        if(userCommentEntity.poster_id < 0)
+        if(userCommentEntity.poster_id <= 0)
         {
             throw new ObjectConversionException("User comment entity must have non-negative poster user ID");
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[NoCoverage] Statement mutation
Implementations/Adapters/EntityAdapters/UserCommentEntityAdapter.cs:23:13
 
         if(userCommentEntity.poster_id < 0)
         {
-            throw new ObjectConversionException("User comment entity must have non-negative poster user ID");
+            ;
         }
 

[Killed] Equality mutation
Implementations/Adapters/EntityAdapters/UserCommentEntityAdapter.cs:26:12
             throw new ObjectConversionException("User comment entity must have non-negative poster user ID");
         }
 
-        if(userCommentEntity.profile_id < 0)
+        if(userCommentEntity.profile_id > 0)
         {
             throw new ObjectConversionException("User comment entity must have non-negative profile user ID");
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Negate expression
Implementations/Adapters/EntityAdapters/UserCommentEntityAdapter.cs:26:12
             throw new ObjectConversionException("User comment entity must have non-negative poster user ID");
         }
 
-        if(userCommentEntity.profile_id < 0)
+        if(!(userCommentEntity.profile_id < 0))
         {
             throw new ObjectConversionException("User comment entity must have non-negative profile user ID");
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[NoCoverage] Statement mutation
Implementations/Adapters/EntityAdapters/UserCommentEntityAdapter.cs:28:13
 
         if(userCommentEntity.profile_id < 0)
         {
-            throw new ObjectConversionException("User comment entity must have non-negative profile user ID");
+            ;
         }
 

[NoCoverage] String mutation
Implementations/Adapters/EntityAdapters/UserCommentEntityAdapter.cs:28:49
 
         if(userCommentEntity.profile_id < 0)
         {
-            throw new ObjectConversionException("User comment entity must have non-negative profile user ID");
+            throw new ObjectConversionException("");
         }
 

[Killed] Negate expression
Implementations/Adapters/EntityAdapters/UserCommentEntityAdapter.cs:31:12
             throw new ObjectConversionException("User comment entity must have non-negative profile user ID");
         }
 
-        if(userCommentEntity.posterUser!.username.Trim().Equals(String.Empty))
+        if(!(userCommentEntity.posterUser!.username.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("User comment entity must have non-empty username");
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[NoCoverage] Statement mutation
Implementations/Adapters/EntityAdapters/UserCommentEntityAdapter.cs:33:13
 
         if(userCommentEntity.posterUser!.username.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("User comment entity must have non-empty username");
+            ;
         }
     }
