[Killed] Equality mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:12:13
 {
     private static void ValidateEntity(UserEntity userEntity)
     {
-        if (userEntity.user_id < 0)
+        if (userEntity.user_id > 0)
         {
             throw new ObjectConversionException("User entity cannot have negative user ID.");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Equality mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:12:13
 {
     private static void ValidateEntity(UserEntity userEntity)
     {
-        if (userEntity.user_id < 0)
+        if (userEntity.user_id <= 0)
         {
             throw new ObjectConversionException("User entity cannot have negative user ID.");
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:14:13
     {
         if (userEntity.user_id < 0)
         {
-            throw new ObjectConversionException("User entity cannot have negative user ID.");
+            ;
         }
 
killedBy: test.UserEntityAdapterTest.InvalidUserIdTest

[Killed] Negate expression
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:17:13
             throw new ObjectConversionException("User entity cannot have negative user ID.");
         }
 
-        if (userEntity.username.Trim().Equals(String.Empty))
+        if (!(userEntity.username.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("User entity cannot have empty username.");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:19:13
 
         if (userEntity.username.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("User entity cannot have empty username.");
+            ;
         }
 
killedBy: test.UserEntityAdapterTest.EmptyUsernameTest; test.UserEntityAdapterTest.SpaceUsernameTest

[Survived] String mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:19:49
 
         if (userEntity.username.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("User entity cannot have empty username.");
+            throw new ObjectConversionException("");
         }
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:22:13
             throw new ObjectConversionException("User entity cannot have empty username.");
         }
 
-        if (!ValidationRegex.IsValidEmail(userEntity.email))
+        if (ValidationRegex.IsValidEmail(userEntity.email))
         {
             throw new ObjectConversionException(
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:24:13
 
         if (!ValidationRegex.IsValidEmail(userEntity.email))
         {
-            throw new ObjectConversionException(
-                $"User entity must have a valid email (user_id={userEntity.user_id}).");
+            ;
         }
 
killedBy: test.UserEntityAdapterTest.CutOffEmailTest; test.UserEntityAdapterTest.EmptyEmailTest; test.UserEntityAdapterTest.MissingCenterEmailTest

[Killed] Negate expression
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:28:13
                 $"User entity must have a valid email (user_id={userEntity.user_id}).");
         }
 
-        if (userEntity.password.Trim().Equals(String.Empty))
+        if (!(userEntity.password.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("User entity cannot have empty password.");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:30:13
 
         if (userEntity.password.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("User entity cannot have empty password.");
+            ;
         }
 
killedBy: test.UserEntityAdapterTest.EmptyPasswordTest; test.UserEntityAdapterTest.SpacePasswordTest

[Killed] Equality mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:33:13
             throw new ObjectConversionException("User entity cannot have empty password.");
         }
 
-        if (userEntity.jobSeeker is null && userEntity.employer is null)
+        if (userEntity.jobSeeker is not null && userEntity.employer is null)
         {
             throw new ObjectConversionException("User entity is not related to any job seeker or employer entity.");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Negate expression
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:33:13
             throw new ObjectConversionException("User entity cannot have empty password.");
         }
 
-        if (userEntity.jobSeeker is null && userEntity.employer is null)
+        if (!(userEntity.jobSeeker is null && userEntity.employer is null))
         {
             throw new ObjectConversionException("User entity is not related to any job seeker or employer entity.");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[NoCoverage] Statement mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:35:13
 
         if (userEntity.jobSeeker is null && userEntity.employer is null)
         {
-            throw new ObjectConversionException("User entity is not related to any job seeker or employer entity.");
+            ;
         }
     }

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:41:9
 
     public UserEntityAdapter(UserEntity userEntity) : base(userEntity.user_id, userEntity.email, userEntity.username, userEntity.password, userEntity.about_string)
     {
-        ValidateEntity(userEntity);
+        ;
         this.Verified = userEntity.verified;
 
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Equality mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:44:13
         ValidateEntity(userEntity);
         this.Verified = userEntity.verified;
 
-        if (userEntity.jobSeeker != null)
+        if (userEntity.jobSeeker == null)
         {
             this.Experiences = new();
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Statement mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:49:13
             this.Experiences = new();
 
             // Convert the experience entities to logic objects
-            userEntity.jobSeeker.experiences?.ToList().ForEach(e => this.Experiences.Add(new ExperienceEntityAdapter(e)));
+            ;
 
             // Create new job seeker user object
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Boolean mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:54:31
             // Create new job seeker user object
             this.FirstName = userEntity.jobSeeker.first_name;
             this.LastName = userEntity.jobSeeker.last_name;
-            this.IsEmployer = false;
+            this.IsEmployer = true;
         }
         else if (userEntity.employer != null)
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[NoCoverage] Equality mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:56:18
             this.LastName = userEntity.jobSeeker.last_name;
             this.IsEmployer = false;
         }
-        else if (userEntity.employer != null)
+        else if (userEntity.employer == null)
         {
             // Create new employer user object

[NoCoverage] Boolean mutation
Implementations/Adapters/EntityAdapters/UserEntityAdapter.cs:60:31
         {
             // Create new employer user object
             this.EmployerName = userEntity.employer.employer_name;
-            this.IsEmployer = true;
+            this.IsEmployer = false;
         }
     }
