[Survived] Null coalescing mutation (remove left)
Implementations/Adapters/ObjectAdapters/ExperienceObjectAdapter.cs:12:116
 public class ExperienceObjectAdapter : ExperienceEntity
 {
     [SetsRequiredMembers]
-    public ExperienceObjectAdapter(Experience experience) : base(experience.CompanyName, experience.PositionTitle, experience.JobDescription ?? string.Empty)
+    public ExperienceObjectAdapter(Experience experience) : base(experience.CompanyName, experience.PositionTitle, string.Empty)
     {
         ValidateObject(experience);

[NoCoverage] String mutation
Implementations/Adapters/ObjectAdapters/ExperienceObjectAdapter.cs:12:145
 public class ExperienceObjectAdapter : ExperienceEntity
 {
     [SetsRequiredMembers]
-    public ExperienceObjectAdapter(Experience experience) : base(experience.CompanyName, experience.PositionTitle, experience.JobDescription ?? string.Empty)
+    public ExperienceObjectAdapter(Experience experience) : base(experience.CompanyName, experience.PositionTitle, experience.JobDescription ?? "Stryker was here!")
     {
         ValidateObject(experience);

[Killed] Statement mutation
Implementations/Adapters/ObjectAdapters/ExperienceObjectAdapter.cs:14:9
     [SetsRequiredMembers]
     public ExperienceObjectAdapter(Experience experience) : base(experience.CompanyName, experience.PositionTitle, experience.JobDescription ?? string.Empty)
     {
-        ValidateObject(experience);
+        ;
     }
 
killedBy: test.ExperienceObjectAdapterTest.EmptyCompanyNameTest; test.ExperienceObjectAdapterTest.EmptyPositionTitleTest; test.ExperienceObjectAdapterTest.SpaceCompanyNameTest

[Killed] Negate expression
Implementations/Adapters/ObjectAdapters/ExperienceObjectAdapter.cs:19:12
 
     private void ValidateObject(Experience experience)
     {
-        if(experience.CompanyName.Trim().Equals(String.Empty))
+        if(!(experience.CompanyName.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("Experience cannot have empty company name.");
killedBy: test.ExperienceObjectAdapterTest.EmptyCompanyNameTest; test.ExperienceObjectAdapterTest.HappyCaseTest; test.ExperienceObjectAdapterTest.SpaceCompanyNameTest

[Killed] Statement mutation
Implementations/Adapters/ObjectAdapters/ExperienceObjectAdapter.cs:21:13
     {
         if(experience.CompanyName.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Experience cannot have empty company name.");
+            ;
         }
 
killedBy: test.ExperienceObjectAdapterTest.EmptyCompanyNameTest; test.ExperienceObjectAdapterTest.SpaceCompanyNameTest

[Killed] Negate expression
Implementations/Adapters/ObjectAdapters/ExperienceObjectAdapter.cs:24:12
             throw new ObjectConversionException("Experience cannot have empty company name.");
         }
 
-        if(experience.PositionTitle.Trim().Equals(String.Empty))
+        if(!(experience.PositionTitle.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("Experience cannot have empty position title.");
killedBy: test.ExperienceObjectAdapterTest.EmptyPositionTitleTest; test.ExperienceObjectAdapterTest.HappyCaseTest; test.ExperienceObjectAdapterTest.SpacePositionTitleTest

[Killed] Statement mutation
Implementations/Adapters/ObjectAdapters/ExperienceObjectAdapter.cs:26:13
 
         if(experience.PositionTitle.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Experience cannot have empty position title.");
+            ;
         }
     }
killedBy: test.ExperienceObjectAdapterTest.EmptyPositionTitleTest; test.ExperienceObjectAdapterTest.SpacePositionTitleTest
