[Killed] Statement mutation
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:14:9
     [SetsRequiredMembers]
     {
-        ValidateObject(job);
+        ;
     }
 
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Negate expression
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:19:12
 
     private void ValidateObject(Job job)
     {
-        if(job.JobTitle.Trim().Equals(String.Empty))
+        if(!(job.JobTitle.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("Job cannot have empty title.");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Statement mutation
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:21:13
     {
         if(job.JobTitle.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Job cannot have empty title.");
+            ;
         }
 
killedBy: test.JobObjectAdapterTest.EmptyJobTitleTest; test.JobObjectAdapterTest.SpaceJobTitleTest

[Survived] String mutation
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:21:49
     {
         if(job.JobTitle.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Job cannot have empty title.");
+            throw new ObjectConversionException("");
         }
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:24:12
             throw new ObjectConversionException("Job cannot have empty title.");
         }
 
-        if(!ValidationRegex.linkRegex.IsMatch(job.ApplicationLink))
+        if(ValidationRegex.linkRegex.IsMatch(job.ApplicationLink))
         {
             throw new ObjectConversionException("Job must have a valid application link.");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Statement mutation
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:26:13
 
         if(!ValidationRegex.linkRegex.IsMatch(job.ApplicationLink))
         {
-            throw new ObjectConversionException("Job must have a valid application link.");
+            ;
         }
 
killedBy: test.JobObjectAdapterTest.EmptyApplicationLinkTest; test.JobObjectAdapterTest.MissingPostfixApplicationLinkTest; test.JobObjectAdapterTest.MissingPrefixApplicationLinkTest

[Killed] Negate expression
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:29:13
             throw new ObjectConversionException("Job must have a valid application link.");
         }
 
-        if (job.PositionType.Trim().Equals(String.Empty))
+        if (!(job.PositionType.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("Job entity cannot have empty position type.");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Survived] String mutation
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:31:49
 
         if (job.PositionType.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Job entity cannot have empty position type.");
+            throw new ObjectConversionException("");
         }
 

[Killed] Negate expression
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:34:13
             throw new ObjectConversionException("Job entity cannot have empty position type.");
         }
 
-        if (job.EmploymentType.Trim().Equals(String.Empty))
+        if (!(job.EmploymentType.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("Job cannot have empty employment type.");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Statement mutation
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:36:13
 
         if (job.EmploymentType.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Job cannot have empty employment type.");
+            ;
         }
 
killedBy: test.JobObjectAdapterTest.EmptyEmploymentTypeTest; test.JobObjectAdapterTest.SpaceEmploymentTypeTest

[Killed] Negate expression
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:39:13
             throw new ObjectConversionException("Job cannot have empty employment type.");
         }
 
-        if (job.JobDescription.Trim().Equals(String.Empty))
+        if (!(job.JobDescription.Trim().Equals(String.Empty)))
         {
             throw new ObjectConversionException("Job cannot have empty job description.");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Statement mutation
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:41:13
 
         if (job.JobDescription.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Job cannot have empty job description.");
+            ;
         }
     }
killedBy: test.JobObjectAdapterTest.EmptyJobDescriptionTest; test.JobObjectAdapterTest.SpaceJobDescriptionTest

[Survived] String mutation
Implementations/Adapters/ObjectAdapters/JobObjectAdapter.cs:41:49
 
         if (job.JobDescription.Trim().Equals(String.Empty))
         {
-            throw new ObjectConversionException("Job cannot have empty job description.");
+            throw new ObjectConversionException("");
         }
     }
