[Killed] Statement mutation
Implementations/Adapters/ObjectAdapters/LocationStringAdapter.cs:18:9
 
         string[] splitLocation = location.Split(',', StringSplitOptions.TrimEntries);
 
-        ValidateObject(splitLocation);
+        ;
 
         this.country = splitLocation[SplitCountryIndex];
killedBy: test.LocationStringAdapterTest.EmptyComponentTest; test.LocationStringAdapterTest.EmptyStringTest; test.LocationStringAdapterTest.ExtraComponentTest

[Killed] Equality mutation
Implementations/Adapters/ObjectAdapters/LocationStringAdapter.cs:29:12
     {
         const int ExpectedSplitSize = 3;
         
-        if(splitLocation.Length != ExpectedSplitSize)
+        if(splitLocation.Length == ExpectedSplitSize)
         {
             throw new ObjectConversionException("Location string must have exactly 3 components.");
killedBy: test.LocationStringAdapterTest.ExtraComponentTest; test.LocationStringAdapterTest.HappyCaseTest; test.LocationStringAdapterTest.MissingComponentTest

[Killed] Statement mutation
Implementations/Adapters/ObjectAdapters/LocationStringAdapter.cs:31:13
         
         if(splitLocation.Length != ExpectedSplitSize)
         {
-            throw new ObjectConversionException("Location string must have exactly 3 components.");
+            ;
         }
 
killedBy: test.LocationStringAdapterTest.ExtraComponentTest; test.LocationStringAdapterTest.MissingComponentTest; test.LocationStringAdapterTest.MissingDelimitterTest

[Survived] String mutation
Implementations/Adapters/ObjectAdapters/LocationStringAdapter.cs:31:49
         
         if(splitLocation.Length != ExpectedSplitSize)
         {
-            throw new ObjectConversionException("Location string must have exactly 3 components.");
+            throw new ObjectConversionException("");
         }
 

[Killed] Negate expression
Implementations/Adapters/ObjectAdapters/LocationStringAdapter.cs:36:16
 
         foreach(string s in splitLocation)
         {
-            if(s.Equals(String.Empty))
+            if(!(s.Equals(String.Empty)))
             {
                 throw new ObjectConversionException("Location string cannot have empty components.");
killedBy: test.LocationStringAdapterTest.HappyCaseTest

[Killed] Statement mutation
Implementations/Adapters/ObjectAdapters/LocationStringAdapter.cs:38:17
         {
             if(s.Equals(String.Empty))
             {
-                throw new ObjectConversionException("Location string cannot have empty components.");
+                ;
             }
         }
killedBy: test.LocationStringAdapterTest.EmptyComponentTest; test.LocationStringAdapterTest.SpaceComponentTest
