[Killed] Block removal mutation
src/persistence/Implementations/AppDbContext.cs:32:5
     public DbSet<UserCommentEntity> UserComments { get; set; }
 
     public AppDbContext(IConfiguration config)
-    {
-        this.config = config;
-    }
+    {}
 
     protected override void OnConfiguring(DbContextOptionsBuilder optionsBuilder)
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest; test.GenericWordIntegrationTest.FollowUserIntegrationTest

[Killed] Negate expression
src/persistence/Implementations/AppDbContext.cs:40:13
     {
         string? connectionString = config.GetConnectionString("DefaultConnection");
 
-        if (string.IsNullOrEmpty(connectionString))
+        if (!(string.IsNullOrEmpty(connectionString)))
         {
             // Save connection string from environment variables, or throw exception if it returns null
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest; test.GenericWordIntegrationTest.FollowUserIntegrationTest

[Killed] String mutation
src/persistence/Implementations/AppDbContext.cs:40:13
     {
         string? connectionString = config.GetConnectionString("DefaultConnection");
 
-        if (string.IsNullOrEmpty(connectionString))
+        if ((connectionString!=null))
         {
             // Save connection string from environment variables, or throw exception if it returns null
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest; test.GenericWordIntegrationTest.FollowUserIntegrationTest

[Killed] Block removal mutation
src/persistence/Implementations/AppDbContext.cs:41:9
         string? connectionString = config.GetConnectionString("DefaultConnection");
 
         if (string.IsNullOrEmpty(connectionString))
-        {
-            // Save connection string from environment variables, or throw exception if it returns null
-            connectionString = config.GetValue<string>(AppConfig.DB_ENV_KEY);
-        }
+        {}
 
         if (string.IsNullOrEmpty(connectionString))
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest; test.GenericWordIntegrationTest.FollowUserIntegrationTest

[Killed] String mutation
src/persistence/Implementations/AppDbContext.cs:46:13
             connectionString = config.GetValue<string>(AppConfig.DB_ENV_KEY);
         }
 
-        if (string.IsNullOrEmpty(connectionString))
+        if ((connectionString!=""))
         {
             throw new ObjectNotFoundException("Could not find 'ConnectionStrings:DefaultConnection' in appsettings or environment variables.");      
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest; test.GenericWordIntegrationTest.FollowUserIntegrationTest

[NoCoverage] Statement mutation
src/persistence/Implementations/AppDbContext.cs:48:13
 
         if (string.IsNullOrEmpty(connectionString))
         {
-            throw new ObjectNotFoundException("Could not find 'ConnectionStrings:DefaultConnection' in appsettings or environment variables.");      
+            ;      
         }
         

[NoCoverage] String mutation
src/persistence/Implementations/AppDbContext.cs:48:47
 
         if (string.IsNullOrEmpty(connectionString))
         {
-            throw new ObjectNotFoundException("Could not find 'ConnectionStrings:DefaultConnection' in appsettings or environment variables.");      
+            throw new ObjectNotFoundException("");      
         }
         

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:51:9
             throw new ObjectNotFoundException("Could not find 'ConnectionStrings:DefaultConnection' in appsettings or environment variables.");      
         }
         
-        optionsBuilder.UseMySQL(connectionString);
+        ;
     }
 
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest; test.GenericWordIntegrationTest.FollowUserIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:57:9
     protected override void OnModelCreating(ModelBuilder modelBuilder)
     {
         // Define relationship between Jobs and Users
-        modelBuilder.Entity<JobEntity>()
-          .HasOne(e => e.poster)
-          .WithMany(e => e.postedJobs)
-          .HasForeignKey(e => e.poster_id)
-          .HasPrincipalKey(e => e.user_id);
+        ;
 
         // Define relationship between Jobs, JobLocations, and Locations
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:64:9
           .HasPrincipalKey(e => e.user_id);
 
         // Define relationship between Jobs, JobLocations, and Locations
-        modelBuilder.Entity<JobLocationEntity>()
-          .HasKey(e => new { e.job_id, e.location_id });
+        ;
 
         modelBuilder.Entity<JobLocationEntity>()
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Survived] Statement mutation
src/persistence/Implementations/AppDbContext.cs:67:9
         modelBuilder.Entity<JobLocationEntity>()
           .HasKey(e => new { e.job_id, e.location_id });
 
-        modelBuilder.Entity<JobLocationEntity>()
-          .HasOne(e => e.location)
-          .WithMany(e => e.jobs)
-          .HasForeignKey(e => e.location_id);
+        ;
 
         modelBuilder.Entity<JobLocationEntity>()

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:72:9
           .WithMany(e => e.jobs)
           .HasForeignKey(e => e.location_id);
 
-        modelBuilder.Entity<JobLocationEntity>()
-          .HasOne(e => e.job)
-          .WithMany(e => e.locations)
-          .HasForeignKey(e => e.job_id);
+        ;
 
         // Define relationship between JobSeekers, Likes, and Jobs
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Survived] Statement mutation
src/persistence/Implementations/AppDbContext.cs:78:9
           .HasForeignKey(e => e.job_id);
 
         // Define relationship between JobSeekers, Likes, and Jobs
-        modelBuilder.Entity<LikeEntity>()
-          .HasKey(e => new { e.job_id, e.seeker_id });
+        ;
 
         modelBuilder.Entity<LikeEntity>()

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:81:9
         modelBuilder.Entity<LikeEntity>()
           .HasKey(e => new { e.job_id, e.seeker_id });
 
-        modelBuilder.Entity<LikeEntity>()
-          .HasOne(e => e.jobSaver)
-          .WithMany(e => e.likes)
-          .HasForeignKey(e => e.seeker_id);
+        ;
 
         modelBuilder.Entity<LikeEntity>()
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:86:9
           .WithMany(e => e.likes)
           .HasForeignKey(e => e.seeker_id);
 
-        modelBuilder.Entity<LikeEntity>()
-          .HasOne(e => e.savedJob)
-          .WithMany(e => e.likes)
-          .HasForeignKey(e => e.job_id);
+        ;
 
         // Define relationship between Jobs, JobProgrammingLanguages, and ProgrammingLanguages
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:92:9
           .HasForeignKey(e => e.job_id);
 
         // Define relationship between Jobs, JobProgrammingLanguages, and ProgrammingLanguages
-        modelBuilder.Entity<JobLanguageEntity>()
-          .HasKey(e => new { e.job_id, e.language_name });
+        ;
 
         modelBuilder.Entity<JobLanguageEntity>()
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:95:9
         modelBuilder.Entity<JobLanguageEntity>()
           .HasKey(e => new { e.job_id, e.language_name });
 
-        modelBuilder.Entity<JobLanguageEntity>()
-          .HasOne(e => e.job)
-          .WithMany(e => e.programmingLanguages)
-          .HasForeignKey(e => e.job_id);
+        ;
 
         modelBuilder.Entity<JobLanguageEntity>()
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:100:9
           .WithMany(e => e.programmingLanguages)
           .HasForeignKey(e => e.job_id);
 
-        modelBuilder.Entity<JobLanguageEntity>()
-          .HasOne(e => e.language)
-          .WithMany(e => e.jobs)
-          .HasForeignKey(e => e.language_name);
+        ;
 
         // Define relationship between Users and Employers/JobSeekers
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:106:9
           .HasForeignKey(e => e.language_name);
 
         // Define relationship between Users and Employers/JobSeekers
-        modelBuilder.Entity<UserEntity>()
-          .HasOne(e => e.employer)
-          .WithOne(e => e.user)
-          .HasForeignKey<EmployerEntity>(e => e.user_id);
+        ;
 
         modelBuilder.Entity<UserEntity>()
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:111:9
           .WithOne(e => e.user)
           .HasForeignKey<EmployerEntity>(e => e.user_id);
 
-        modelBuilder.Entity<UserEntity>()
-          .HasOne(e => e.jobSeeker)
-          .WithOne(e => e.user)
-          .HasForeignKey<JobSeekerEntity>(e => e.user_id);
+        ;
 
         // Enforce unique usernames
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:117:9
           .HasForeignKey<JobSeekerEntity>(e => e.user_id);
 
         // Enforce unique usernames
-        modelBuilder.Entity<UserEntity>()
-          .HasIndex(e => e.username)
-          .IsUnique();
+        ;
 
         // Enforce unique emails
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:122:9
           .IsUnique();
 
         // Enforce unique emails
-        modelBuilder.Entity<UserEntity>()
-          .HasIndex(e => e.email)
-          .IsUnique();
+        ;
 
         // Define relationship between JobSeekers and Experiences
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:127:9
           .IsUnique();
 
         // Define relationship between JobSeekers and Experiences
-        modelBuilder.Entity<JobSeekerEntity>()
-          .HasMany(e => e.experiences)
-          .WithOne(e => e.jobSeeker)
-          .HasForeignKey(e => e.seeker_id);
+        ;
 
         // Define relationship between Users, JobComments, and Jobs
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:133:9
           .HasForeignKey(e => e.seeker_id);
 
         // Define relationship between Users, JobComments, and Jobs
-        modelBuilder.Entity<JobCommentEntity>()
-          .HasOne(e => e.poster)
-          .WithMany(e => e.jobComments)
-          .HasForeignKey(e => e.poster_id);
+        ;
 
         modelBuilder.Entity<JobCommentEntity>()
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:138:9
           .WithMany(e => e.jobComments)
           .HasForeignKey(e => e.poster_id);
 
-        modelBuilder.Entity<JobCommentEntity>()
-          .HasOne(e => e.job)
-          .WithMany(e => e.comments)
-          .HasForeignKey(e => e.job_id);
+        ;
 
         // Define relationship between Users and Follows
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Survived] Statement mutation
src/persistence/Implementations/AppDbContext.cs:144:9
           .HasForeignKey(e => e.job_id);
 
         // Define relationship between Users and Follows
-        modelBuilder.Entity<FollowsEntity>()
-            .HasOne(e => e.follower)
-            .WithMany(e => e.follows)
-            .HasForeignKey(e => e.follower_id);
+        ;
 
         modelBuilder.Entity<FollowsEntity>()

[Killed] Statement mutation
src/persistence/Implementations/AppDbContext.cs:149:9
             .WithMany(e => e.follows)
             .HasForeignKey(e => e.follower_id);
 
-        modelBuilder.Entity<FollowsEntity>()
-            .HasOne(e => e.followed)
-            .WithMany(e => e.followers)
-            .HasForeignKey(e => e.followed_id);
+        ;
 
         // Define relationship between Users and UserComments
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Survived] Statement mutation
src/persistence/Implementations/AppDbContext.cs:155:9
             .HasForeignKey(e => e.followed_id);
 
         // Define relationship between Users and UserComments
-        modelBuilder.Entity<UserCommentEntity>()
-            .HasOne(e => e.posterUser)
-            .WithMany(e => e.postedComments)
-            .HasForeignKey(e => e.poster_id);
+        ;
 
         modelBuilder.Entity<UserCommentEntity>()

[Survived] Statement mutation
src/persistence/Implementations/AppDbContext.cs:160:9
             .WithMany(e => e.postedComments)
             .HasForeignKey(e => e.poster_id);
 
-        modelBuilder.Entity<UserCommentEntity>()
-            .HasOne(e => e.profileUser)
-            .WithMany(e => e.profileComments)
-            .HasForeignKey(e => e.profile_id);
+        ;
     }
 }
