[Killed] Block removal mutation
src/persistence/Implementations/JobPersistence.cs:18:5
     private IConfiguration config;
 
     public JobPersistence(IConfiguration config)
-    {
-        this.config = config;
-    }
+    {}
 
     private List<JobEntity> FilterQuery(IQueryable<JobEntity> query, string searchTerm, List<string> languages, List<string> positionTypes, List<string> employmentTypes, int startIndex, int pageSize)
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/persistence/Implementations/JobPersistence.cs:25:9
     private List<JobEntity> FilterQuery(IQueryable<JobEntity> query, string searchTerm, List<string> languages, List<string> positionTypes, List<string> employmentTypes, int startIndex, int pageSize)
 {
      // Add filters to query if present
-    if (!string.IsNullOrWhiteSpace(searchTerm))
+    if (string.IsNullOrWhiteSpace(searchTerm))
     {
         var term = searchTerm.ToLower();
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Killed] String mutation
src/persistence/Implementations/JobPersistence.cs:25:10
     private List<JobEntity> FilterQuery(IQueryable<JobEntity> query, string searchTerm, List<string> languages, List<string> positionTypes, List<string> employmentTypes, int startIndex, int pageSize)
 {
      // Add filters to query if present
-    if (!string.IsNullOrWhiteSpace(searchTerm))
+    if (!(searchTerm!=null))
     {
         var term = searchTerm.ToLower();
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest; test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest

[Killed] Logical mutation
src/persistence/Implementations/JobPersistence.cs:29:13
     {
         var term = searchTerm.ToLower();
         query = query.Where(e =>
-            e.job_title.ToLower().Contains(term) ||
-            (e.poster!.employer != null && e.poster!.employer.employer_name.ToLower().Contains(term)) ||
-            (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
+            e.job_title.ToLower().Contains(term) ||
+            (e.poster!.employer != null && e.poster!.employer.employer_name.ToLower().Contains(term)) &&
+            (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
             e.locations!.Any(l =>
killedBy: test.JobServiceIntegrationTest.GetJobsIntegrationTest; test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest

[Killed] Logical mutation
src/persistence/Implementations/JobPersistence.cs:29:13
     {
         var term = searchTerm.ToLower();
         query = query.Where(e =>
-            e.job_title.ToLower().Contains(term) ||
-            (e.poster!.employer != null && e.poster!.employer.employer_name.ToLower().Contains(term)) ||
-            (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
-            (e.poster!.jobSeeker != null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
+            e.job_title.ToLower().Contains(term) ||
+            (e.poster!.employer != null && e.poster!.employer.employer_name.ToLower().Contains(term)) ||
+            (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) &&
+            (e.poster!.jobSeeker != null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
             e.locations!.Any(l =>
                 l.location!.city.ToLower().Contains(term) ||
killedBy: test.JobServiceIntegrationTest.GetJobsIntegrationTest; test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest

[Killed] Logical mutation
src/persistence/Implementations/JobPersistence.cs:30:14
         var term = searchTerm.ToLower();
         query = query.Where(e =>
             e.job_title.ToLower().Contains(term) ||
-            (e.poster!.employer != null && e.poster!.employer.employer_name.ToLower().Contains(term)) ||
+            (e.poster!.employer != null || e.poster!.employer.employer_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
killedBy: test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Survived] Equality mutation
src/persistence/Implementations/JobPersistence.cs:30:14
         var term = searchTerm.ToLower();
         query = query.Where(e =>
             e.job_title.ToLower().Contains(term) ||
-            (e.poster!.employer != null && e.poster!.employer.employer_name.ToLower().Contains(term)) ||
+            (e.poster!.employer == null && e.poster!.employer.employer_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||

[Killed] Logical mutation
src/persistence/Implementations/JobPersistence.cs:31:14
         query = query.Where(e =>
             e.job_title.ToLower().Contains(term) ||
             (e.poster!.employer != null && e.poster!.employer.employer_name.ToLower().Contains(term)) ||
-            (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
+            (e.poster!.jobSeeker != null || e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
             e.locations!.Any(l =>
killedBy: test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Survived] Equality mutation
src/persistence/Implementations/JobPersistence.cs:31:14
         query = query.Where(e =>
             e.job_title.ToLower().Contains(term) ||
             (e.poster!.employer != null && e.poster!.employer.employer_name.ToLower().Contains(term)) ||
-            (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
+            (e.poster!.jobSeeker == null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
             e.locations!.Any(l =>

[Killed] Logical mutation
src/persistence/Implementations/JobPersistence.cs:32:14
             e.job_title.ToLower().Contains(term) ||
             (e.poster!.employer != null && e.poster!.employer.employer_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
-            (e.poster!.jobSeeker != null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
+            (e.poster!.jobSeeker != null || e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
             e.locations!.Any(l =>
                 l.location!.city.ToLower().Contains(term) ||
killedBy: test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/JobPersistence.cs:32:14
             e.job_title.ToLower().Contains(term) ||
             (e.poster!.employer != null && e.poster!.employer.employer_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
-            (e.poster!.jobSeeker != null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
+            (e.poster!.jobSeeker == null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
             e.locations!.Any(l =>
                 l.location!.city.ToLower().Contains(term) ||
killedBy: test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Killed] Linq method mutation (Any() to All())
src/persistence/Implementations/JobPersistence.cs:33:13
             (e.poster!.employer != null && e.poster!.employer.employer_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
-            e.locations!.Any(l =>
+            e.locations!.All(l =>
                 l.location!.city.ToLower().Contains(term) ||
                 l.location.state.ToLower().Contains(term) ||
killedBy: test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Survived] Logical mutation
src/persistence/Implementations/JobPersistence.cs:34:17
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
             e.locations!.Any(l =>
-                l.location!.city.ToLower().Contains(term) ||
-                l.location.state.ToLower().Contains(term) ||
-                l.location.country.ToLower().Contains(term)
+                l.location!.city.ToLower().Contains(term) ||
+                l.location.state.ToLower().Contains(term) &&
+                l.location.country.ToLower().Contains(term)
             )
         );

[Timeout] Logical mutation
src/persistence/Implementations/JobPersistence.cs:34:17
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.first_name.ToLower().Contains(term)) ||
             (e.poster!.jobSeeker != null && e.poster!.jobSeeker.last_name.ToLower().Contains(term)) ||
             e.locations!.Any(l =>
-                l.location!.city.ToLower().Contains(term) ||
-                l.location.state.ToLower().Contains(term) ||
+                l.location!.city.ToLower().Contains(term) &&
+                l.location.state.ToLower().Contains(term) ||
                 l.location.country.ToLower().Contains(term)
             )

[Killed] Negate expression
src/persistence/Implementations/JobPersistence.cs:41:9
         );
     }
 
-    if (languages.Any())
+    if (!(languages.Any()))
     {
         var lowerLangs = languages.Select(l => l.ToLower()).ToList();
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[NoCoverage] Linq method mutation (Any() to All())
src/persistence/Implementations/JobPersistence.cs:44:34
     if (languages.Any())
     {
         var lowerLangs = languages.Select(l => l.ToLower()).ToList();
-        query = query.Where(e => e.programmingLanguages!.Any(l => lowerLangs.Contains(l.language_name.ToLower())));
+        query = query.Where(e => e.programmingLanguages!.All(l => lowerLangs.Contains(l.language_name.ToLower())));
     }
     

[Killed] Negate expression
src/persistence/Implementations/JobPersistence.cs:47:9
         query = query.Where(e => e.programmingLanguages!.Any(l => lowerLangs.Contains(l.language_name.ToLower())));
     }
     
-    if (positionTypes.Any())
+    if (!(positionTypes.Any()))
     {
         var lowerPos = positionTypes.Select(p => p.ToLower()).ToList();
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[NoCoverage] Block removal mutation
src/persistence/Implementations/JobPersistence.cs:48:5
     }
     
     if (positionTypes.Any())
-    {
-        var lowerPos = positionTypes.Select(p => p.ToLower()).ToList();
-        query = query.Where(e => lowerPos.Contains(e.position_type.ToLower()));
-    }
+    {}
     
     if (employmentTypes.Any())

[Killed] Negate expression
src/persistence/Implementations/JobPersistence.cs:53:9
         query = query.Where(e => lowerPos.Contains(e.position_type.ToLower()));
     }
     
-    if (employmentTypes.Any())
+    if (!(employmentTypes.Any()))
     {
         var lowerEmp = employmentTypes.Select(e => e.ToLower()).ToList();
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[NoCoverage] Block removal mutation
src/persistence/Implementations/JobPersistence.cs:54:5
     }
     
     if (employmentTypes.Any())
-    {
-        var lowerEmp = employmentTypes.Select(e => e.ToLower()).ToList();
-        query = query.Where(e => lowerEmp.Contains(e.employment_type.ToLower()));
-    }
+    {}
 
     // Filter number of jobs

[Killed] Linq method mutation (Take() to Skip())
src/persistence/Implementations/JobPersistence.cs:60:13
     }
 
     // Filter number of jobs
-    query = query.OrderBy(e => e.job_id)
-                 .Skip(startIndex)
-                 .Take(pageSize);
+    query = query.OrderBy(e => e.job_id)
+                 .Skip(startIndex)
+                 .Skip(pageSize);
 
     return query.ToList();
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Killed] Linq method mutation (Skip() to Take())
src/persistence/Implementations/JobPersistence.cs:60:13
     }
 
     // Filter number of jobs
-    query = query.OrderBy(e => e.job_id)
-                 .Skip(startIndex)
+    query = query.OrderBy(e => e.job_id)
+                 .Take(startIndex)
                  .Take(pageSize);
 
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/JobPersistence.cs:85:13
             List<JobEntity> jobEntities = FilterQuery(query.Query, searchTerm, languages, positionTypes, employmentTypes, startIndex, pageSize);
 
             // Convert entities to business objects and add to the return list
-            jobEntities.ForEach(e =>
-            {
-                filteredList.Add(new JobEntityAdapter(e));
-            });
+            ;
         }
 
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Timeout] Statement mutation
src/persistence/Implementations/JobPersistence.cs:87:17
             // Convert entities to business objects and add to the return list
             jobEntities.ForEach(e =>
             {
-                filteredList.Add(new JobEntityAdapter(e));
+                ;
             });
         }

[NoCoverage] Equality mutation
src/persistence/Implementations/JobPersistence.cs:107:17
             ICollection<LikeEntity>? likes = jobSeekerEntity?.likes?.ToList();
 
             //Compare provided jobs list with the job seeker's likes
-            if (likes != null)
+            if (likes == null)
             {
                 jobs.ForEach(job =>

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:109:17
             //Compare provided jobs list with the job seeker's likes
             if (likes != null)
             {
-                jobs.ForEach(job =>
-                {
-                    if (likes.Any(likeEntry => job.JobId == likeEntry.job_id))
-                    {
-                        savedSublist.Add(job);
-                    }
-                });
+                ;
             }
         }

[NoCoverage] Linq method mutation (Any() to All())
src/persistence/Implementations/JobPersistence.cs:111:25
             {
                 jobs.ForEach(job =>
                 {
-                    if (likes.Any(likeEntry => job.JobId == likeEntry.job_id))
+                    if (likes.All(likeEntry => job.JobId == likeEntry.job_id))
                     {
                         savedSublist.Add(job);

[NoCoverage] Equality mutation
src/persistence/Implementations/JobPersistence.cs:111:48
             {
                 jobs.ForEach(job =>
                 {
-                    if (likes.Any(likeEntry => job.JobId == likeEntry.job_id))
+                    if (likes.Any(likeEntry => job.JobId != likeEntry.job_id))
                     {
                         savedSublist.Add(job);

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:113:25
                 {
                     if (likes.Any(likeEntry => job.JobId == likeEntry.job_id))
                     {
-                        savedSublist.Add(job);
+                        ;
                     }
                 });

[Killed] Statement mutation
src/persistence/Implementations/JobPersistence.cs:133:13
 
             // Gather liked jobs into a list
             List<JobEntity> jobEntities = new();
-            jobSeekerEntity?.likes?.ToList().ForEach(e =>
-            {
-                jobEntities.Add(e.savedJob!);
-            });
+            ;
 
             // Run filter on query and convert each entity to business object
killedBy: test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/JobPersistence.cs:135:17
             List<JobEntity> jobEntities = new();
             jobSeekerEntity?.likes?.ToList().ForEach(e =>
             {
-                jobEntities.Add(e.savedJob!);
+                ;
             });
 
killedBy: test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest; test.UserServiceIntegrationTest.SaveJobIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/JobPersistence.cs:139:13
             });
 
             // Run filter on query and convert each entity to business object
-            FilterQuery(jobEntities.AsQueryable(), searchTerm, languages, positionTypes, employmentTypes, startIndex, pageSize)
-              .ForEach(e =>
-              {
-                  savedJobs.Add(new JobEntityAdapter(e));
-              });
+            ;
         }
 
killedBy: test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest; test.UserServiceIntegrationTest.SaveJobIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/JobPersistence.cs:142:19
             FilterQuery(jobEntities.AsQueryable(), searchTerm, languages, positionTypes, employmentTypes, startIndex, pageSize)
               .ForEach(e =>
               {
-                  savedJobs.Add(new JobEntityAdapter(e));
+                  ;
               });
         }
killedBy: test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest; test.UserServiceIntegrationTest.SaveJobIntegrationTest

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:155:13
 
         using (AppDbContext context = new(this.config))
         {
-            context.ProgrammingLanguages.ToList()
-              .ForEach(e => languages.Add(e.language_name));
+            ;
         }
 

[NoCoverage] Block removal mutation
src/persistence/Implementations/JobPersistence.cs:163:5
     }
 
     public int GetNumberOfJobs(string searchTerm, List<string> languages, List<string> positionTypes, List<string> employmentTypes)
-    {
-        return GetJobs(searchTerm, languages, positionTypes, employmentTypes, 0, int.MaxValue).Count();
-    }
+    {}
 
     public int GetNumberOfSavedJobs(int userId, string searchTerm, List<string> languages, List<string> positionTypes, List<string> employmentTypes)

[NoCoverage] Block removal mutation
src/persistence/Implementations/JobPersistence.cs:168:5
     }
 
     public int GetNumberOfSavedJobs(int userId, string searchTerm, List<string> languages, List<string> positionTypes, List<string> employmentTypes)
-    {
-        return GetSavedJobs(userId, searchTerm, languages, positionTypes, employmentTypes, 0, int.MaxValue).Count();
-    }
+    {}
 
     public List<JobComment> GetJobComments(int jobId)

[NoCoverage] Equality mutation
src/persistence/Implementations/JobPersistence.cs:178:54
 
         using (AppDbContext context = new(this.config))
         {
-            JobEntity? job = context.Jobs.Where(e => e.job_id == jobId)
+            JobEntity? job = context.Jobs.Where(e => e.job_id != jobId)
               .Include(e => e.comments!)
                 .ThenInclude(e => e.poster)

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
src/persistence/Implementations/JobPersistence.cs:178:30
 
         using (AppDbContext context = new(this.config))
         {
-            JobEntity? job = context.Jobs.Where(e => e.job_id == jobId)
-              .Include(e => e.comments!)
-                .ThenInclude(e => e.poster)
-                  .ThenInclude(e => e!.employer)
-              .SingleOrDefault();
+            JobEntity? job = context.Jobs.Where(e => e.job_id == jobId)
+              .Include(e => e.comments!)
+                .ThenInclude(e => e.poster)
+                  .ThenInclude(e => e!.employer)
+              .Single();
 
             // Add the retrieved jobs comments to the list that will be returned

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:185:13
               .SingleOrDefault();
 
             // Add the retrieved jobs comments to the list that will be returned
-            job?.comments?.ToList().ForEach(e =>
-            {
-                comments.Add(new JobComment(e.comment, e.poster_id, e.job!.job_id, e.poster!.username));
-            });
+            ;
         }
 

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:187:17
             // Add the retrieved jobs comments to the list that will be returned
             job?.comments?.ToList().ForEach(e =>
             {
-                comments.Add(new JobComment(e.comment, e.poster_id, e.job!.job_id, e.poster!.username));
+                ;
             });
         }

[Survived] Statement mutation
src/persistence/Implementations/JobPersistence.cs:206:13
                 comment = comment.Comment
             };
 
-            context.JobComments.Add(newComment);
+            ;
             context.SaveChanges();
 

[Survived] Statement mutation
src/persistence/Implementations/JobPersistence.cs:207:13
             };
 
             context.JobComments.Add(newComment);
-            context.SaveChanges();
+            ;
 
         }

[Killed] Equality mutation
src/persistence/Implementations/JobPersistence.cs:222:13
         JobEntity? e = new JobQuery(context.Jobs)
             .IncludeLocations()
             .GetJobByJobId(jobId);
-        if (e != null)
+        if (e == null)
             {
                 job = new JobEntityAdapter(e);
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Block removal mutation
src/persistence/Implementations/JobPersistence.cs:223:13
             .IncludeLocations()
             .GetJobByJobId(jobId);
         if (e != null)
-            {
-                job = new JobEntityAdapter(e);
-            }
+            {}
         return job;   
       }
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/JobPersistence.cs:238:16
             JobEntity newJobEntity = new JobObjectAdapter(job);
 
             // Set the poster
-            if(job.PosterName is not null)
+            if(job.PosterName is null)
             {
                 // Try to get ID from an employer
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest

[Killed] Linq method mutation (SingleOrDefault() to Single())
src/persistence/Implementations/JobPersistence.cs:241:44
             if(job.PosterName is not null)
             {
                 // Try to get ID from an employer
-                EmployerEntity? employer = context.Employers.Where(e => e.employer_name.Equals(job.PosterName)).SingleOrDefault();
+                EmployerEntity? employer = context.Employers.Where(e => e.employer_name.Equals(job.PosterName)).Single();
                 if(employer is not null)
                 {
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/JobPersistence.cs:242:20
             {
                 // Try to get ID from an employer
                 EmployerEntity? employer = context.Employers.Where(e => e.employer_name.Equals(job.PosterName)).SingleOrDefault();
-                if(employer is not null)
+                if(employer is null)
                 {
                     newJobEntity.poster_id = employer.user_id;
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest

[Killed] Boolean mutation
src/persistence/Implementations/JobPersistence.cs:251:64
                 {
                     // Create a poster object to split the name into first and last
                     // Poster ID is set to default value 0 if no matching employer/job seeker is found as the poster
-                    Poster poster = new Poster(job.PosterName, false);
+                    Poster poster = new Poster(job.PosterName, true);
                     newJobEntity.poster_id = context.JobSeekers.Where(e => e.first_name.ToLower().Equals(poster.FullName!.FirstName.ToLower()) 
                                                         && e.last_name.ToLower().Equals(poster.FullName.LastName.ToLower()))
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest

[Killed] Linq method mutation (SingleOrDefault() to Single())
src/persistence/Implementations/JobPersistence.cs:252:46
                     // Create a poster object to split the name into first and last
                     // Poster ID is set to default value 0 if no matching employer/job seeker is found as the poster
                     Poster poster = new Poster(job.PosterName, false);
-                    newJobEntity.poster_id = context.JobSeekers.Where(e => e.first_name.ToLower().Equals(poster.FullName!.FirstName.ToLower()) 
-                                                        && e.last_name.ToLower().Equals(poster.FullName.LastName.ToLower()))
-                                                    .SingleOrDefault()?
+                    newJobEntity.poster_id = context.JobSeekers.Where(e => e.first_name.ToLower().Equals(poster.FullName!.FirstName.ToLower()) 
+                                                        && e.last_name.ToLower().Equals(poster.FullName.LastName.ToLower()))
+                                                    .Single()?
                                                     .user_id ?? 0;
                 }
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Logical mutation
src/persistence/Implementations/JobPersistence.cs:252:76
                     // Create a poster object to split the name into first and last
                     // Poster ID is set to default value 0 if no matching employer/job seeker is found as the poster
                     Poster poster = new Poster(job.PosterName, false);
-                    newJobEntity.poster_id = context.JobSeekers.Where(e => e.first_name.ToLower().Equals(poster.FullName!.FirstName.ToLower()) 
-                                                        && e.last_name.ToLower().Equals(poster.FullName.LastName.ToLower()))
+                    newJobEntity.poster_id = context.JobSeekers.Where(e => e.first_name.ToLower().Equals(poster.FullName!.FirstName.ToLower()) 
+                                                        || e.last_name.ToLower().Equals(poster.FullName.LastName.ToLower()))
                                                     .SingleOrDefault()?
                                                     .user_id ?? 0;
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/JobPersistence.cs:260:13
             }
 
             // Save job entity before setting navigations
-            context.Jobs.Add(newJobEntity);
+            ;
             context.SaveChanges();
 
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/JobPersistence.cs:261:13
 
             // Save job entity before setting navigations
             context.Jobs.Add(newJobEntity);
-            context.SaveChanges();
+            ;
 
             // Set locations
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest
