[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
src/persistence/Implementations/JobPersistence.cs:268:58
             job.Locations?.ForEach(locationString =>
             {
                 LocationEntity locationEntity = new LocationStringAdapter(locationString);
-                LocationEntity? matchingLocationEntity = context.Locations.Where(e => e.country.ToLower().Equals(locationEntity.country.ToLower()) 
-                                                                && e.state.ToLower().Equals(locationEntity.state.ToLower()) 
-                                                                && e.city.ToLower().Equals(locationEntity.city.ToLower()))
-                                                        .SingleOrDefault();
+                LocationEntity? matchingLocationEntity = context.Locations.Where(e => e.country.ToLower().Equals(locationEntity.country.ToLower()) 
+                                                                && e.state.ToLower().Equals(locationEntity.state.ToLower()) 
+                                                                && e.city.ToLower().Equals(locationEntity.city.ToLower()))
+                                                        .Single();
 
                 int locationEntityId;

[NoCoverage] Logical mutation
src/persistence/Implementations/JobPersistence.cs:268:87
             job.Locations?.ForEach(locationString =>
             {
                 LocationEntity locationEntity = new LocationStringAdapter(locationString);
-                LocationEntity? matchingLocationEntity = context.Locations.Where(e => e.country.ToLower().Equals(locationEntity.country.ToLower()) 
-                                                                && e.state.ToLower().Equals(locationEntity.state.ToLower()) 
+                LocationEntity? matchingLocationEntity = context.Locations.Where(e => e.country.ToLower().Equals(locationEntity.country.ToLower()) 
+                                                                || e.state.ToLower().Equals(locationEntity.state.ToLower()) 
                                                                 && e.city.ToLower().Equals(locationEntity.city.ToLower()))
                                                         .SingleOrDefault();

[NoCoverage] Equality mutation
src/persistence/Implementations/JobPersistence.cs:276:20
                 int locationEntityId;
 
                 // Save location if not existing in the database already
-                if(matchingLocationEntity is null)
+                if(matchingLocationEntity is not null)
                 {
                     context.Locations.Add(locationEntity);

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:278:21
                 // Save location if not existing in the database already
                 if(matchingLocationEntity is null)
                 {
-                    context.Locations.Add(locationEntity);
+                    ;
                     context.SaveChanges();
                     locationEntityId = locationEntity.location_id;

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:279:21
                 if(matchingLocationEntity is null)
                 {
                     context.Locations.Add(locationEntity);
-                    context.SaveChanges();
+                    ;
                     locationEntityId = locationEntity.location_id;
                 }

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:289:17
 
                 // Add to join table
                 JobLocationEntity jobLocationEntity = new JobLocationEntity(newJobEntity.job_id, locationEntityId);
-                context.JobLocations.Add(jobLocationEntity);
+                ;
             });
 

[Killed] Statement mutation
src/persistence/Implementations/JobPersistence.cs:294:13
 
             // Set programming languages
             newJobEntity.programmingLanguages = new List<JobLanguageEntity>();
-            job.ProgrammingLanguages?.ForEach(languageString =>
-            {
-                ProgrammingLanguageEntity? languageEntity = context.ProgrammingLanguages.Where(e => e.language_name.ToLower().Equals(languageString.ToLower())).SingleOrDefault();
-
-                // Save language if not existing in the database already
-                if(languageEntity is null)
-                {
-                    languageEntity = new ProgrammingLanguageEntity(languageString);
-                    context.ProgrammingLanguages.Add(languageEntity);
-                    context.SaveChanges();
-                }
-
-                // Add to join table
-                JobLanguageEntity jobLanguageEntity = new JobLanguageEntity(newJobEntity.job_id, languageEntity.language_name);
-                context.JobLanguages.Add(jobLanguageEntity);
-            });
+            ;
 
             // Save changes to populate join tables in database
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
src/persistence/Implementations/JobPersistence.cs:296:61
             newJobEntity.programmingLanguages = new List<JobLanguageEntity>();
             job.ProgrammingLanguages?.ForEach(languageString =>
             {
-                ProgrammingLanguageEntity? languageEntity = context.ProgrammingLanguages.Where(e => e.language_name.ToLower().Equals(languageString.ToLower())).SingleOrDefault();
+                ProgrammingLanguageEntity? languageEntity = context.ProgrammingLanguages.Where(e => e.language_name.ToLower().Equals(languageString.ToLower())).Single();
 
                 // Save language if not existing in the database already

[NoCoverage] Equality mutation
src/persistence/Implementations/JobPersistence.cs:299:20
                 ProgrammingLanguageEntity? languageEntity = context.ProgrammingLanguages.Where(e => e.language_name.ToLower().Equals(languageString.ToLower())).SingleOrDefault();
 
                 // Save language if not existing in the database already
-                if(languageEntity is null)
+                if(languageEntity is not null)
                 {
                     languageEntity = new ProgrammingLanguageEntity(languageString);

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:302:21
                 if(languageEntity is null)
                 {
                     languageEntity = new ProgrammingLanguageEntity(languageString);
-                    context.ProgrammingLanguages.Add(languageEntity);
+                    ;
                     context.SaveChanges();
                 }

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:303:21
                 {
                     languageEntity = new ProgrammingLanguageEntity(languageString);
                     context.ProgrammingLanguages.Add(languageEntity);
-                    context.SaveChanges();
+                    ;
                 }
 

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:308:17
 
                 // Add to join table
                 JobLanguageEntity jobLanguageEntity = new JobLanguageEntity(newJobEntity.job_id, languageEntity.language_name);
-                context.JobLanguages.Add(jobLanguageEntity);
+                ;
             });
 

[Killed] Statement mutation
src/persistence/Implementations/JobPersistence.cs:312:13
             });
 
             // Save changes to populate join tables in database
-            context.SaveChanges();
+            ;
 
             // Return ID of new job
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Block removal mutation
src/persistence/Implementations/JobPersistence.cs:322:9
     public List<Job> GetJobsByUsername(string username)
     {
         using(AppDbContext context = new(this.config))
-        {
-            return new JobQuery(context.Jobs)
-                        .IncludeLocations()
-                        .IncludePoster()
-                        .IncludeProgrammingLanguages()
-                        .GetJobByPosterUsername(username);
-        }
+        {}
     }
 
killedBy: test.UserServiceIntegrationTest.UpdateUserIntegrationTest

[NoCoverage] Null coalescing mutation (remove right)
src/persistence/Implementations/JobPersistence.cs:335:36
     {
         using(AppDbContext context = new(this.config))
         {
-            JobEntity? jobEntity = new JobQuery(context.Jobs).GetJobByJobId(jobId) ?? throw new InvalidOperationException("Existing job not found in the database");
+            JobEntity? jobEntity = new JobQuery(context.Jobs).GetJobByJobId(jobId);
 
             context.Jobs.Remove(jobEntity);

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:337:13
         {
             JobEntity? jobEntity = new JobQuery(context.Jobs).GetJobByJobId(jobId) ?? throw new InvalidOperationException("Existing job not found in the database");
 
-            context.Jobs.Remove(jobEntity);
+            ;
             context.SaveChanges();
         }

[NoCoverage] Statement mutation
src/persistence/Implementations/JobPersistence.cs:338:13
             JobEntity? jobEntity = new JobQuery(context.Jobs).GetJobByJobId(jobId) ?? throw new InvalidOperationException("Existing job not found in the database");
 
             context.Jobs.Remove(jobEntity);
-            context.SaveChanges();
+            ;
         }
     }

[NoCoverage] Equality mutation
src/persistence/Implementations/JobPersistence.cs:347:20
         using(AppDbContext context = new(this.config))
         {
             JobEntity? jobEntity = new JobQuery(context.Jobs).GetJobByJobId(jobId);
-            return jobEntity?.poster_id == userId;
+            return jobEntity?.poster_id != userId;
         }
     }
