[Killed] Block removal mutation
persistence/Implementations/Queries/JobQuery.cs:13:5
     public IQueryable<JobEntity> Query { get; set; }
 
     public JobQuery(DbSet<JobEntity> jobs)
-    {
-        this.Query = jobs;
-    }
+    {}
 
     public JobQuery IncludeLocations()
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Block removal mutation
persistence/Implementations/Queries/JobQuery.cs:18:5
     }
 
     public JobQuery IncludeLocations()
-    {
-        this.Query = this.Query.Include(e => e.locations!)
-                    .ThenInclude(e => e.location);
-
-        return this;
-    }
+    {}
 
     public JobQuery IncludeProgrammingLanguages()
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest

[Killed] Block removal mutation
persistence/Implementations/Queries/JobQuery.cs:26:5
     }
 
     public JobQuery IncludeProgrammingLanguages()
-    {
-        this.Query = this.Query.Include(e => e.programmingLanguages);
-
-        return this;
-    }
+    {}
 
     public JobQuery IncludePoster()
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Block removal mutation
persistence/Implementations/Queries/JobQuery.cs:33:5
     }
 
     public JobQuery IncludePoster()
-    {
-        this.Query = this.Query.Include(e => e.poster)
-                    .ThenInclude(e => e!.employer)
-                  .Include(e => e.poster)
-                    .ThenInclude(e => e!.jobSeeker);
-
-        return this;
-    }
+    {}
 
     public JobEntity? GetJobByJobId(int jobId)
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Killed] Equality mutation
persistence/Implementations/Queries/JobQuery.cs:44:38
 
     public JobEntity? GetJobByJobId(int jobId)
     {
-        return this.Query.Where(e => e.job_id == jobId).SingleOrDefault();
+        return this.Query.Where(e => e.job_id != jobId).SingleOrDefault();
     }
 
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Linq method mutation (SingleOrDefault() to Single())
persistence/Implementations/Queries/JobQuery.cs:44:16
 
     public JobEntity? GetJobByJobId(int jobId)
     {
-        return this.Query.Where(e => e.job_id == jobId).SingleOrDefault();
+        return this.Query.Where(e => e.job_id == jobId).Single();
     }
 
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Survived] Block removal mutation
persistence/Implementations/Queries/JobQuery.cs:48:5
     }
 
     public List<Job> GetJobByPosterUsername(string username)
-    {
-        return this.Query
-                    .Where(e => e.poster!.username.Equals(username))
-                    .ToList()
-                    .Select(e => (Job)new JobEntityAdapter(e))
-                    .ToList();
-    }
+    {}
 }
