[Killed] Block removal mutation
persistence/Implementations/Queries/JobSeekerQuery.cs:11:5
     public IQueryable<JobSeekerEntity> Query { get; set; }
 
     public JobSeekerQuery(DbSet<JobSeekerEntity> jobSeekerEntities)
-    {
-        this.Query = jobSeekerEntities;
-    }
+    {}
 
     public JobSeekerQuery IncludeLikes()
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest; test.UserServiceIntegrationTest.SaveJobIntegrationTest

[Killed] Block removal mutation
persistence/Implementations/Queries/JobSeekerQuery.cs:16:5
     }
 
     public JobSeekerQuery IncludeLikes()
-    {
-        this.Query = this.Query.Include(e => e.likes!)
-                                    .ThenInclude(e => e.savedJob)
-                                        .ThenInclude(e => e!.programmingLanguages)
-                                .Include(e => e.likes!)
-                                    .ThenInclude(e => e.savedJob)
-                                        .ThenInclude(e => e!.poster)
-                                            .ThenInclude(e => e!.employer)
-                                .Include(e => e.likes!)
-                                    .ThenInclude(e => e.savedJob)
-                                        .ThenInclude(e => e!.poster)
-                                            .ThenInclude(e => e!.jobSeeker)
-                                .Include(e => e.likes!)
-                                    .ThenInclude(e => e.savedJob)
-                                    .ThenInclude(e => e!.locations!)
-                                        .ThenInclude(e => e.location);
-
-        return this;
-    }
+    {}
 
     public JobSeekerQuery IncludeExperiences()
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest

[NoCoverage] Block removal mutation
persistence/Implementations/Queries/JobSeekerQuery.cs:37:5
     }
 
     public JobSeekerQuery IncludeExperiences()
-    {
-        this.Query = this.Query.Include(e => e.experiences);
-
-        return this;
-    }
+    {}
 
     public JobSeekerEntity? GetJobSeekerByUserId(int userId)

[Killed] Linq method mutation (SingleOrDefault() to Single())
persistence/Implementations/Queries/JobSeekerQuery.cs:45:16
 
     public JobSeekerEntity? GetJobSeekerByUserId(int userId)
     {
-        return this.Query.Where(e => e.user_id == userId).SingleOrDefault();
+        return this.Query.Where(e => e.user_id == userId).Single();
     }
 }
killedBy: test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest

[Killed] Equality mutation
persistence/Implementations/Queries/JobSeekerQuery.cs:45:38
 
     public JobSeekerEntity? GetJobSeekerByUserId(int userId)
     {
-        return this.Query.Where(e => e.user_id == userId).SingleOrDefault();
+        return this.Query.Where(e => e.user_id != userId).SingleOrDefault();
     }
 }
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest
