[Killed] Block removal mutation
src/persistence/Implementations/QuizItemsPersistence.cs:13:5
     private IConfiguration config;
 
     public QuizItemsPersisitence(IConfiguration config)
-    {
-        this.config = config;
-    }
+    {}
 
     public List<QuizItem> GetQuizItems(int max)
killedBy: test.QuizGameServiceIntegrationTest.RejectJobIntegrationTest

[Survived] Linq method mutation (Take() to Skip())
src/persistence/Implementations/QuizItemsPersistence.cs:21:20
     {
         using (AppDbContext context = new(this.config))
         {
-            return context.QuizItems
-                .Take(max)
+            return context.QuizItems
+                .Skip(max)
                 .Select(quizItemEntity => new QuizItemEntityAdapter(quizItemEntity))
                 .ToList<QuizItem>();
