[Killed] Block removal mutation
src/persistence/Implementations/ResumePersistence.cs:10:5
     private IConfiguration config;
 
     public ResumePersistence(IConfiguration config)
-    {
-        this.config = config;
-    }
+    {}
 
     public List<string> GetGenericWords()
killedBy: test.GenericWordIntegrationTest.FollowUserIntegrationTest

[Survived] Statement mutation
src/persistence/Implementations/ResumePersistence.cs:20:13
 
         using (AppDbContext context = new(this.config))
         {
-            context.GenericWords.ToList().ForEach(e =>
-            {
-                words.Add(e.word);
-            });
+            ;
         }
 

[NoCoverage] Statement mutation
src/persistence/Implementations/ResumePersistence.cs:22:17
         {
             context.GenericWords.ToList().ForEach(e =>
             {
-                words.Add(e.word);
+                ;
             });
         }
