[Killed] Equality mutation
persistence/Implementations/Types/ApplicationDate.cs:9:13
 
     public ApplicationDate(DateTime? dateTime)
     {
-        if (dateTime != null)
+        if (dateTime == null)
         {
             this.Date = DateOnly.FromDateTime((DateTime)dateTime);
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobEntityAdapterTest.HappyCaseTest

[NoCoverage] Block removal mutation
persistence/Implementations/Types/ApplicationDate.cs:10:9
     public ApplicationDate(DateTime? dateTime)
     {
         if (dateTime != null)
-        {
-            this.Date = DateOnly.FromDateTime((DateTime)dateTime);
-        }
+        {}
     }
 }
