[NoCoverage] String mutation
persistence/Implementations/Types/JobLocation.cs:11:47
 
     public JobLocation(LocationEntity locationEntity)
     {
-        this.Location = locationEntity.city + ", " + locationEntity.state + ", " + locationEntity.country;
+        this.Location = locationEntity.city + "" + locationEntity.state + ", " + locationEntity.country;
     }
 }
