[Killed] Block removal mutation
persistence/Implementations/Types/Name.cs:11:5
     public string LastName { get; }
 
     public Name(JobSeekerEntity jobSeeker)
-    {
-        this.FirstName = jobSeeker.first_name;
-        this.LastName = jobSeeker.last_name;
-    }
+    {}
 
     public Name(string fullName)
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Killed] Equality mutation
persistence/Implementations/Types/Name.cs:24:12
         this.FirstName = string.Join(" ", splitName[..^1]);
 
         
-        if(splitName.Length > 1)
+        if(splitName.Length < 1)
         {
             this.LastName = splitName[splitName.Length - 1];
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Equality mutation
persistence/Implementations/Types/Name.cs:24:12
         this.FirstName = string.Join(" ", splitName[..^1]);
 
         
-        if(splitName.Length > 1)
+        if(splitName.Length >= 1)
         {
             this.LastName = splitName[splitName.Length - 1];
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest

[Killed] Arithmetic mutation
persistence/Implementations/Types/Name.cs:26:39
         
         if(splitName.Length > 1)
         {
-            this.LastName = splitName[splitName.Length - 1];
+            this.LastName = splitName[splitName.Length + 1];
         }
         else
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest
