[Killed] Logical mutation
persistence/Implementations/Types/Poster.cs:15:13
     {
         this.IsEmployer = employerPoster;
 
-        if (poster != null && employerPoster && poster.employer != null)
+        if (poster != null && employerPoster || poster.employer != null)
         {
             this.EmployerName = poster.employer.employer_name;
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobEntityAdapterTest.HappyCaseTest

[Killed] Negate expression
persistence/Implementations/Types/Poster.cs:15:13
     {
         this.IsEmployer = employerPoster;
 
-        if (poster != null && employerPoster && poster.employer != null)
+        if (!(poster != null && employerPoster && poster.employer != null))
         {
             this.EmployerName = poster.employer.employer_name;
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobEntityAdapterTest.HappyCaseTest

[NoCoverage] Block removal mutation
persistence/Implementations/Types/Poster.cs:16:9
         this.IsEmployer = employerPoster;
 
         if (poster != null && employerPoster && poster.employer != null)
-        {
-            this.EmployerName = poster.employer.employer_name;
-        }
+        {}
         else if (poster != null && !employerPoster && poster.jobSeeker != null)
         {

[Killed] Logical mutation
persistence/Implementations/Types/Poster.cs:19:18
         {
             this.EmployerName = poster.employer.employer_name;
         }
-        else if (poster != null && !employerPoster && poster.jobSeeker != null)
+        else if (poster != null && !employerPoster || poster.jobSeeker != null)
         {
             this.FullName = new Name(poster.jobSeeker);
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobEntityAdapterTest.HappyCaseTest

[Killed] Equality mutation
persistence/Implementations/Types/Poster.cs:19:55
         {
             this.EmployerName = poster.employer.employer_name;
         }
-        else if (poster != null && !employerPoster && poster.jobSeeker != null)
+        else if (poster != null && !employerPoster && poster.jobSeeker == null)
         {
             this.FullName = new Name(poster.jobSeeker);
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Block removal mutation
persistence/Implementations/Types/Poster.cs:20:9
             this.EmployerName = poster.employer.employer_name;
         }
         else if (poster != null && !employerPoster && poster.jobSeeker != null)
-        {
-            this.FullName = new Name(poster.jobSeeker);
-        }
+        {}
     }
 
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest

[Killed] Negate expression
persistence/Implementations/Types/Poster.cs:29:12
     {
         this.IsEmployer = employerPoster;
 
-        if(employerPoster)
+        if(!(employerPoster))
         {
             this.EmployerName = name;
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[NoCoverage] Block removal mutation
persistence/Implementations/Types/Poster.cs:30:9
         this.IsEmployer = employerPoster;
 
         if(employerPoster)
-        {
-            this.EmployerName = name;
-        }
+        {}
         else
         {

[Killed] Block removal mutation
persistence/Implementations/Types/Poster.cs:34:9
             this.EmployerName = name;
         }
         else
-        {
-            this.FullName = new Name(name);
-        }
+        {}
     }
 
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Conditional (false) mutation
persistence/Implementations/Types/Poster.cs:41:16
 
     public override string? ToString()
     {
-        return this.IsEmployer ? this.EmployerName : this.FullName?.ToString();
+        return (false?this.EmployerName :this.FullName?.ToString());
     }
 }
killedBy: test.JobServiceIntegrationTest.GetJobsIntegrationTest; test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest

[Killed] Conditional (true) mutation
persistence/Implementations/Types/Poster.cs:41:16
 
     public override string? ToString()
     {
-        return this.IsEmployer ? this.EmployerName : this.FullName?.ToString();
+        return (true?this.EmployerName :this.FullName?.ToString());
     }
 }
killedBy: test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest
