[Killed] Block removal mutation
src/persistence/Implementations/UserPersistence.cs:19:5
     private readonly IPasswordHasher<User> passwordHasher;
 
     public UserPersistence(IConfiguration config, IPasswordHasher<User> passwordHasher)
-    {
-        this.config = config;
-        this.passwordHasher = passwordHasher;
-    }
+    {}
 
     //<summary>
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Linq method mutation (SingleOrDefault() to Single())
src/persistence/Implementations/UserPersistence.cs:36:38
         using (AppDbContext context = new(this.config))
         {
             // Build the query for the user in question
-            UserEntity? userEntity = context.Users
-              .Where(e => e.user_id == userId)
-              .Include(e => e.employer)
-              .Include(e => e.jobSeeker)
-                .ThenInclude(e => e!.experiences)
-              .SingleOrDefault();
+            UserEntity? userEntity = context.Users
+              .Where(e => e.user_id == userId)
+              .Include(e => e.employer)
+              .Include(e => e.jobSeeker)
+                .ThenInclude(e => e!.experiences)
+              .Single();
 
             if (userEntity != null)
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:37:27
         {
             // Build the query for the user in question
             UserEntity? userEntity = context.Users
-              .Where(e => e.user_id == userId)
+              .Where(e => e.user_id != userId)
               .Include(e => e.employer)
               .Include(e => e.jobSeeker)
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:43:17
                 .ThenInclude(e => e!.experiences)
               .SingleOrDefault();
 
-            if (userEntity != null)
+            if (userEntity == null)
             {
                 user = new UserEntityAdapter(userEntity);
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Timeout] Block removal mutation
src/persistence/Implementations/UserPersistence.cs:44:13
               .SingleOrDefault();
 
             if (userEntity != null)
-            {
-                user = new UserEntityAdapter(userEntity);
-            }
+            {}
         }
 

[NoCoverage] Negate expression
src/persistence/Implementations/UserPersistence.cs:67:16
             string lowerSearchTerm = searchTerm.ToLower();
             List<User> users;
 
-            if(employer)
+            if(!(employer))
             {
                 users = context.Employers

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:106:20
             var result = new List<User>(capacity: amount);
             var skip = startIndex;
 
-            while (result.Count < amount)
+            while (result.Count <= amount)
             {
                 var batch = context.Users
killedBy: test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Negate expression
src/persistence/Implementations/UserPersistence.cs:106:20
             var result = new List<User>(capacity: amount);
             var skip = startIndex;
 
-            while (result.Count < amount)
+            while (!(result.Count < amount))
             {
                 var batch = context.Users
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
src/persistence/Implementations/UserPersistence.cs:108:29
 
             while (result.Count < amount)
             {
-                var batch = context.Users
-                  .Where(e => e.user_id != currentUserId && e.employer == null)
-                  .OrderBy(e => e.user_id)
+                var batch = context.Users
+                  .Where(e => e.user_id != currentUserId && e.employer == null)
+                  .OrderByDescending(e => e.user_id)
                   .Skip(skip)
                   .Take(batchSize)
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest

[Killed] Linq method mutation (Skip() to Take())
src/persistence/Implementations/UserPersistence.cs:108:29
 
             while (result.Count < amount)
             {
-                var batch = context.Users
-                  .Where(e => e.user_id != currentUserId && e.employer == null)
-                  .OrderBy(e => e.user_id)
-                  .Skip(skip)
+                var batch = context.Users
+                  .Where(e => e.user_id != currentUserId && e.employer == null)
+                  .OrderBy(e => e.user_id)
+                  .Take(skip)
                   .Take(batchSize)
                   .Include(e => e.employer)
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Logical mutation
src/persistence/Implementations/UserPersistence.cs:109:31
             while (result.Count < amount)
             {
                 var batch = context.Users
-                  .Where(e => e.user_id != currentUserId && e.employer == null)
+                  .Where(e => e.user_id != currentUserId || e.employer == null)
                   .OrderBy(e => e.user_id)
                   .Skip(skip)
killedBy: test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:109:61
             while (result.Count < amount)
             {
                 var batch = context.Users
-                  .Where(e => e.user_id != currentUserId && e.employer == null)
+                  .Where(e => e.user_id != currentUserId && e.employer != null)
                   .OrderBy(e => e.user_id)
                   .Skip(skip)
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Negate expression
src/persistence/Implementations/UserPersistence.cs:125:25
 
                 foreach (UserEntity entity in batch)
                 {
-                    if (result.Count >= amount)
+                    if (!(result.Count >= amount))
                     {
                         break;
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Timeout] Equality mutation
src/persistence/Implementations/UserPersistence.cs:125:25
 
                 foreach (UserEntity entity in batch)
                 {
-                    if (result.Count >= amount)
+                    if (result.Count > amount)
                     {
                         break;

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:132:25
 
                     try
                     {
-                        result.Add(new UserEntityAdapter(entity));
+                        ;
                     }
                     catch (ObjectConversionException)
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Linq method mutation (SingleOrDefault() to Single())
src/persistence/Implementations/UserPersistence.cs:159:38
         using (AppDbContext context = new(this.config))
         {
             // Build the query for the user in question
-            UserEntity? userEntity = context.Users
-              .Where(e => e.username == username)
-              .Include(e => e.employer)
-              .Include(e => e.jobSeeker)
-                .ThenInclude(e => e!.experiences)
-              .SingleOrDefault();
+            UserEntity? userEntity = context.Users
+              .Where(e => e.username == username)
+              .Include(e => e.employer)
+              .Include(e => e.jobSeeker)
+                .ThenInclude(e => e!.experiences)
+              .Single();
 
             if (userEntity != null)
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:160:27
         {
             // Build the query for the user in question
             UserEntity? userEntity = context.Users
-              .Where(e => e.username == username)
+              .Where(e => e.username != username)
               .Include(e => e.employer)
               .Include(e => e.jobSeeker)
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest; test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Boolean mutation
src/persistence/Implementations/UserPersistence.cs:192:28
                 username = newUser.Username,
                 password = hashedPassword,
                 about_string = newUser.About,
-                verified = false,
+                verified = true,
                 verify_token = Guid.NewGuid().ToString()
             };
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:196:13
                 verify_token = Guid.NewGuid().ToString()
             };
 
-            context.Users.Add(newUserEntity);
+            ;
             context.SaveChanges();
 
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:197:13
             };
 
             context.Users.Add(newUserEntity);
-            context.SaveChanges();
+            ;
 
             // Determine if we need to add a corresponding employer or job seeker to the employer or job seeker tables respectively
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Negate expression
src/persistence/Implementations/UserPersistence.cs:200:17
             context.SaveChanges();
 
             // Determine if we need to add a corresponding employer or job seeker to the employer or job seeker tables respectively
-            if (newUser.IsEmployer)
+            if (!(newUser.IsEmployer))
             {
                 EmployerEntity newEmployerEntity = new()
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[NoCoverage] Statement mutation
src/persistence/Implementations/UserPersistence.cs:209:17
                 };
 
                 newUserEntity.employer = newEmployerEntity;
-                context.Employers.Add(newEmployerEntity);
+                ;
                 context.SaveChanges();
             }

[NoCoverage] Statement mutation
src/persistence/Implementations/UserPersistence.cs:210:17
 
                 newUserEntity.employer = newEmployerEntity;
                 context.Employers.Add(newEmployerEntity);
-                context.SaveChanges();
+                ;
             }
             else

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:216:17
             {
                 // Need to convert the experience objects to experience entities
                 List<ExperienceEntity> experienceEntities = new();
-                newUser.Experiences!.ForEach(e => experienceEntities.Add(new ExperienceObjectAdapter(e)));
+                ;
 
                 JobSeekerEntity newJobSeekerEntity = new()
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:227:17
 
                 // Add job seeker entities before its experiences to ensure FK constraints aren't violated
                 newUserEntity.jobSeeker = newJobSeekerEntity;
-                context.JobSeekers.Add(newJobSeekerEntity);
+                ;
                 context.SaveChanges();
 
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:228:17
                 // Add job seeker entities before its experiences to ensure FK constraints aren't violated
                 newUserEntity.jobSeeker = newJobSeekerEntity;
                 context.JobSeekers.Add(newJobSeekerEntity);
-                context.SaveChanges();
+                ;
 
                 // Add experience entities
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:231:17
                 context.SaveChanges();
 
                 // Add experience entities
-                context.Experiences.AddRange(experienceEntities);
+                ;
                 context.SaveChanges();
             }
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:232:17
 
                 // Add experience entities
                 context.Experiences.AddRange(experienceEntities);
-                context.SaveChanges();
+                ;
             }
 
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
src/persistence/Implementations/UserPersistence.cs:248:23
     //<returns>0 if successful, else returns -1.</returns>
     public int SaveJob(int userId, int jobId)
     {
-        int success = -1;
+        int success = +1;
 
         using (AppDbContext context = new(this.config))
killedBy: test.UserServiceIntegrationTest.SaveJobIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:257:17
 
             // Make the entity and save it in the Likes table
             LikeEntity? newLikeEntity;
-            if (jobSeekerEntity is not null)
+            if (jobSeekerEntity is null)
             {
                 newLikeEntity = new()
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest; test.UserServiceIntegrationTest.SaveJobIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:265:17
                     job_id = jobId,
                 };
 
-                context.Likes.Add(newLikeEntity);
+                ;
                 context.SaveChanges();
                 success = 0;
killedBy: test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:266:17
                 };
 
                 context.Likes.Add(newLikeEntity);
-                context.SaveChanges();
+                ;
                 success = 0;
             }
killedBy: test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest

[NoCoverage] Boolean mutation
src/persistence/Implementations/UserPersistence.cs:282:23
     //<returns>True if successful, else returns false.</returns>
     public bool UnsaveJob(int userId, int jobId)
     {
-        bool result = false;
+        bool result = true;
 
         using (AppDbContext context = new(this.config))

[NoCoverage] Equality mutation
src/persistence/Implementations/UserPersistence.cs:289:16
             // Query for the job seeker that is unsaving the job
             JobSeekerEntity? jobSeeker = new JobSeekerQuery(context.JobSeekers).IncludeLikes().GetJobSeekerByUserId(userId);
 
-            if(jobSeeker is not null)
+            if(jobSeeker is null)
             {
                 // Get the corresponding like entity

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
src/persistence/Implementations/UserPersistence.cs:292:42
             if(jobSeeker is not null)
             {
                 // Get the corresponding like entity
-                LikeEntity? likeEntity = context.Likes.Where(e => e.seeker_id == jobSeeker.seeker_id && e.job_id == jobId).SingleOrDefault();
+                LikeEntity? likeEntity = context.Likes.Where(e => e.seeker_id == jobSeeker.seeker_id && e.job_id == jobId).Single();
 
                 // If the like entity is null, then the user has not saved this job

[NoCoverage] Equality mutation
src/persistence/Implementations/UserPersistence.cs:292:67
             if(jobSeeker is not null)
             {
                 // Get the corresponding like entity
-                LikeEntity? likeEntity = context.Likes.Where(e => e.seeker_id == jobSeeker.seeker_id && e.job_id == jobId).SingleOrDefault();
+                LikeEntity? likeEntity = context.Likes.Where(e => e.seeker_id != jobSeeker.seeker_id && e.job_id == jobId).SingleOrDefault();
 
                 // If the like entity is null, then the user has not saved this job

[NoCoverage] Equality mutation
src/persistence/Implementations/UserPersistence.cs:295:20
                 LikeEntity? likeEntity = context.Likes.Where(e => e.seeker_id == jobSeeker.seeker_id && e.job_id == jobId).SingleOrDefault();
 
                 // If the like entity is null, then the user has not saved this job
-                if(likeEntity is not null)
+                if(likeEntity is null)
                 {
                     context.Likes.Remove(likeEntity);

[NoCoverage] Statement mutation
src/persistence/Implementations/UserPersistence.cs:297:21
                 // If the like entity is null, then the user has not saved this job
                 if(likeEntity is not null)
                 {
-                    context.Likes.Remove(likeEntity);
+                    ;
                     context.SaveChanges();
                     result = true;

[NoCoverage] Statement mutation
src/persistence/Implementations/UserPersistence.cs:298:21
                 if(likeEntity is not null)
                 {
                     context.Likes.Remove(likeEntity);
-                    context.SaveChanges();
+                    ;
                     result = true;
                 }

[NoCoverage] Boolean mutation
src/persistence/Implementations/UserPersistence.cs:299:30
                 {
                     context.Likes.Remove(likeEntity);
                     context.SaveChanges();
-                    result = true;
+                    result = false;
                 }
             }

[Killed] Boolean mutation
src/persistence/Implementations/UserPersistence.cs:315:26
     //<returns>True if successful, else returns false.</returns>
     public bool IsJobInLikes(int userId, int jobId)
     {
-        bool isInLikes = false;
+        bool isInLikes = true;
 
         using (AppDbContext context = new(this.config))
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:322:17
             //Get the JobSeekerEntity matching the given user ID 
             JobSeekerEntity? jobSeekerEntity = new JobSeekerQuery(context.JobSeekers).IncludeLikes().GetJobSeekerByUserId(userId);
 
-            if (jobSeekerEntity is not null)
+            if (jobSeekerEntity is null)
             {
                 //find if the job seeker has liked the specified job - isInLikes = true if so
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest; test.UserServiceIntegrationTest.SaveJobIntegrationTest

[Killed] Linq method mutation (Any() to All())
src/persistence/Implementations/UserPersistence.cs:325:51
             if (jobSeekerEntity is not null)
             {
                 //find if the job seeker has liked the specified job - isInLikes = true if so
-                isInLikes = jobSeekerEntity.likes?.Any(like => like.job_id == jobId) ?? false;
+                isInLikes = jobSeekerEntity.likes?.All(like => like.job_id == jobId) ?? false;
             }
             return isInLikes;
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest; test.UserServiceIntegrationTest.SaveJobIntegrationTest

[Killed] Null coalescing mutation (remove left)
src/persistence/Implementations/UserPersistence.cs:325:29
             if (jobSeekerEntity is not null)
             {
                 //find if the job seeker has liked the specified job - isInLikes = true if so
-                isInLikes = jobSeekerEntity.likes?.Any(like => like.job_id == jobId) ?? false;
+                isInLikes = false;
             }
             return isInLikes;
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest; test.UserServiceIntegrationTest.SaveJobIntegrationTest

[Killed] Linq method mutation (SingleOrDefault() to Single())
src/persistence/Implementations/UserPersistence.cs:343:38
 
         using (AppDbContext context = new(this.config))
         {
-            UserEntity? userEntity = context.Users
-              .Where(e => e.email.Equals(email))
-              .Include(e => e.employer)
-              .Include(e => e.jobSeeker)
-                .ThenInclude(e => e!.experiences)
-              .SingleOrDefault();
+            UserEntity? userEntity = context.Users
+              .Where(e => e.email.Equals(email))
+              .Include(e => e.employer)
+              .Include(e => e.jobSeeker)
+                .ThenInclude(e => e!.experiences)
+              .Single();
 
             if (userEntity != null)
killedBy: test.UserServiceIntegrationTest.LoginIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:358:21
                     userEntity.password,
                     password);
 
-                if (verificationResult == PasswordVerificationResult.Success ||
+                if (verificationResult != PasswordVerificationResult.Success ||
                     verificationResult == PasswordVerificationResult.SuccessRehashNeeded)
                 {
killedBy: test.UserServiceIntegrationTest.LoginIntegrationTest

[Killed] Negate expression
src/persistence/Implementations/UserPersistence.cs:358:21
                     userEntity.password,
                     password);
 
-                if (verificationResult == PasswordVerificationResult.Success ||
-                    verificationResult == PasswordVerificationResult.SuccessRehashNeeded)
+                if (!(verificationResult == PasswordVerificationResult.Success ||
+                    verificationResult == PasswordVerificationResult.SuccessRehashNeeded))
                 {
                     user = candidateUser;
killedBy: test.UserServiceIntegrationTest.LoginIntegrationTest

[NoCoverage] Equality mutation
src/persistence/Implementations/UserPersistence.cs:359:21
                     password);
 
                 if (verificationResult == PasswordVerificationResult.Success ||
-                    verificationResult == PasswordVerificationResult.SuccessRehashNeeded)
+                    verificationResult != PasswordVerificationResult.SuccessRehashNeeded)
                 {
                     user = candidateUser;

[Killed] Block removal mutation
src/persistence/Implementations/UserPersistence.cs:360:17
 
                 if (verificationResult == PasswordVerificationResult.Success ||
                     verificationResult == PasswordVerificationResult.SuccessRehashNeeded)
-                {
-                    user = candidateUser;
-                }
+                {}
             }
         }
killedBy: test.UserServiceIntegrationTest.LoginIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:378:13
     {
         using(AppDbContext context = new(this.config))
         {
-            context.Follows.Add(new FollowsEntity(followerId, followedId));
+            ;
             context.SaveChanges();
         }
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:379:13
         using(AppDbContext context = new(this.config))
         {
             context.Follows.Add(new FollowsEntity(followerId, followedId));
-            context.SaveChanges();
+            ;
         }
     }
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[NoCoverage] Logical mutation
src/persistence/Implementations/UserPersistence.cs:392:40
     {
         using(AppDbContext context = new(this.config))
         {
-            context.Follows.Where(e => e.follower_id == followerId && e.followed_id == followedId).ExecuteDelete();
+            context.Follows.Where(e => e.follower_id == followerId || e.followed_id == followedId).ExecuteDelete();
         }
     }

[NoCoverage] Statement mutation
src/persistence/Implementations/UserPersistence.cs:392:13
     {
         using(AppDbContext context = new(this.config))
         {
-            context.Follows.Where(e => e.follower_id == followerId && e.followed_id == followedId).ExecuteDelete();
+            ;
         }
     }

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:406:78
     {
         using(AppDbContext context = new(this.config))
         {
-            return context.Follows.Where(e => e.follower_id == followerId && e.followed_id == followedId).SingleOrDefault() is not null;
+            return context.Follows.Where(e => e.follower_id == followerId && e.followed_id != followedId).SingleOrDefault() is not null;
         }
     }
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Logical mutation
src/persistence/Implementations/UserPersistence.cs:406:47
     {
         using(AppDbContext context = new(this.config))
         {
-            return context.Follows.Where(e => e.follower_id == followerId && e.followed_id == followedId).SingleOrDefault() is not null;
+            return context.Follows.Where(e => e.follower_id == followerId || e.followed_id == followedId).SingleOrDefault() is not null;
         }
     }
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest

[NoCoverage] Equality mutation
src/persistence/Implementations/UserPersistence.cs:422:49
         using(AppDbContext context = new(this.config))
         {
             followers = context.Follows
-                                    .Where(e => e.followed_id == userId)
+                                    .Where(e => e.followed_id != userId)
                                     .Include(e => e.follower)
                                         .ThenInclude(e => e!.employer)

[NoCoverage] Equality mutation
src/persistence/Implementations/UserPersistence.cs:444:45
         using(AppDbContext context = new(this.config))
         {
             return context.Follows
-                                .Where(e => e.follower_id == userId)
+                                .Where(e => e.follower_id != userId)
                                 .Include(e => e.followed)
                                     .ThenInclude(e => e!.employer)

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
src/persistence/Implementations/UserPersistence.cs:463:20
     {
         using(AppDbContext context = new(this.config))
         {
-            return context.Employers.Where(e => e.user_id == userId).SingleOrDefault() is not null;
+            return context.Employers.Where(e => e.user_id == userId).Single() is not null;
         }
     }

[NoCoverage] Equality mutation
src/persistence/Implementations/UserPersistence.cs:463:20
     {
         using(AppDbContext context = new(this.config))
         {
-            return context.Employers.Where(e => e.user_id == userId).SingleOrDefault() is not null;
+            return context.Employers.Where(e => e.user_id == userId).SingleOrDefault() is null;
         }
     }

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:479:35
 
             // Update user fields
             userEntity.username = updatedUser.Username;
-            userEntity.password = updatedUser.Password == userEntity.password
+            userEntity.password = updatedUser.Password != userEntity.password
                 ? userEntity.password
                 : passwordHasher.HashPassword(updatedUser, updatedUser.Password);
killedBy: test.UserServiceIntegrationTest.UpdateUserIntegrationTest

[Survived] Conditional (false) mutation
src/persistence/Implementations/UserPersistence.cs:479:35
 
             // Update user fields
             userEntity.username = updatedUser.Username;
-            userEntity.password = updatedUser.Password == userEntity.password
-                ? userEntity.password
-                : passwordHasher.HashPassword(updatedUser, updatedUser.Password);
+            userEntity.password = (false?userEntity.password
+:passwordHasher.HashPassword(updatedUser, updatedUser.Password));
             userEntity.about_string = updatedUser.About;
             userEntity.email = updatedUser.Email;
