[Killed] Negate expression
src/persistence/Implementations/UserPersistence.cs:486:16
             userEntity.email = updatedUser.Email;
             
             // Update fields specific to each user type
-            if(updatedUser.IsEmployer && updatedUser.EmployerName is not null)
+            if(!(updatedUser.IsEmployer && updatedUser.EmployerName is not null))
             {
                 EmployerEntity? employerEntity = context.Employers.Where(e => e.user_id == updatedUser.UserId).SingleOrDefault();
killedBy: test.UserServiceIntegrationTest.UpdateUserIntegrationTest

[Killed] Logical mutation
src/persistence/Implementations/UserPersistence.cs:486:16
             userEntity.email = updatedUser.Email;
             
             // Update fields specific to each user type
-            if(updatedUser.IsEmployer && updatedUser.EmployerName is not null)
+            if(updatedUser.IsEmployer || updatedUser.EmployerName is not null)
             {
                 EmployerEntity? employerEntity = context.Employers.Where(e => e.user_id == updatedUser.UserId).SingleOrDefault();
killedBy: test.UserServiceIntegrationTest.UpdateUserIntegrationTest

[NoCoverage] Equality mutation
src/persistence/Implementations/UserPersistence.cs:488:79
             // Update fields specific to each user type
             if(updatedUser.IsEmployer && updatedUser.EmployerName is not null)
             {
-                EmployerEntity? employerEntity = context.Employers.Where(e => e.user_id == updatedUser.UserId).SingleOrDefault();
+                EmployerEntity? employerEntity = context.Employers.Where(e => e.user_id != updatedUser.UserId).SingleOrDefault();
                 if(employerEntity is not null)
                 {

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
src/persistence/Implementations/UserPersistence.cs:488:50
             // Update fields specific to each user type
             if(updatedUser.IsEmployer && updatedUser.EmployerName is not null)
             {
-                EmployerEntity? employerEntity = context.Employers.Where(e => e.user_id == updatedUser.UserId).SingleOrDefault();
+                EmployerEntity? employerEntity = context.Employers.Where(e => e.user_id == updatedUser.UserId).Single();
                 if(employerEntity is not null)
                 {

[NoCoverage] Equality mutation
src/persistence/Implementations/UserPersistence.cs:489:20
             if(updatedUser.IsEmployer && updatedUser.EmployerName is not null)
             {
                 EmployerEntity? employerEntity = context.Employers.Where(e => e.user_id == updatedUser.UserId).SingleOrDefault();
-                if(employerEntity is not null)
+                if(employerEntity is null)
                 {
                     employerEntity.employer_name = updatedUser.EmployerName;

[NoCoverage] Block removal mutation
src/persistence/Implementations/UserPersistence.cs:490:17
             {
                 EmployerEntity? employerEntity = context.Employers.Where(e => e.user_id == updatedUser.UserId).SingleOrDefault();
                 if(employerEntity is not null)
-                {
-                    employerEntity.employer_name = updatedUser.EmployerName;
-                }
+                {}
             }
             else if(!updatedUser.IsEmployer && updatedUser.FirstName is not null && updatedUser.LastName is not null)

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/persistence/Implementations/UserPersistence.cs:494:21
                     employerEntity.employer_name = updatedUser.EmployerName;
                 }
             }
-            else if(!updatedUser.IsEmployer && updatedUser.FirstName is not null && updatedUser.LastName is not null)
+            else if(updatedUser.IsEmployer && updatedUser.FirstName is not null && updatedUser.LastName is not null)
             {
                 JobSeekerEntity? jobSeekerEntity = context.JobSeekers.Where(e => e.user_id == updatedUser.UserId).SingleOrDefault();
killedBy: test.UserServiceIntegrationTest.UpdateUserIntegrationTest

[Killed] Logical mutation
src/persistence/Implementations/UserPersistence.cs:494:21
                     employerEntity.employer_name = updatedUser.EmployerName;
                 }
             }
-            else if(!updatedUser.IsEmployer && updatedUser.FirstName is not null && updatedUser.LastName is not null)
+            else if(!updatedUser.IsEmployer && updatedUser.FirstName is not null || updatedUser.LastName is not null)
             {
                 JobSeekerEntity? jobSeekerEntity = context.JobSeekers.Where(e => e.user_id == updatedUser.UserId).SingleOrDefault();
killedBy: test.UserServiceIntegrationTest.UpdateUserIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:496:82
             }
             else if(!updatedUser.IsEmployer && updatedUser.FirstName is not null && updatedUser.LastName is not null)
             {
-                JobSeekerEntity? jobSeekerEntity = context.JobSeekers.Where(e => e.user_id == updatedUser.UserId).SingleOrDefault();
+                JobSeekerEntity? jobSeekerEntity = context.JobSeekers.Where(e => e.user_id != updatedUser.UserId).SingleOrDefault();
                 if(jobSeekerEntity is not null)
                 {
killedBy: test.UserServiceIntegrationTest.UpdateUserIntegrationTest

[Survived] Linq method mutation (SingleOrDefault() to Single())
src/persistence/Implementations/UserPersistence.cs:496:52
             }
             else if(!updatedUser.IsEmployer && updatedUser.FirstName is not null && updatedUser.LastName is not null)
             {
-                JobSeekerEntity? jobSeekerEntity = context.JobSeekers.Where(e => e.user_id == updatedUser.UserId).SingleOrDefault();
+                JobSeekerEntity? jobSeekerEntity = context.JobSeekers.Where(e => e.user_id == updatedUser.UserId).Single();
                 if(jobSeekerEntity is not null)
                 {

[Timeout] Equality mutation
src/persistence/Implementations/UserPersistence.cs:497:20
             else if(!updatedUser.IsEmployer && updatedUser.FirstName is not null && updatedUser.LastName is not null)
             {
                 JobSeekerEntity? jobSeekerEntity = context.JobSeekers.Where(e => e.user_id == updatedUser.UserId).SingleOrDefault();
-                if(jobSeekerEntity is not null)
+                if(jobSeekerEntity is null)
                 {
                     jobSeekerEntity.first_name = updatedUser.FirstName;

[Killed] Block removal mutation
src/persistence/Implementations/UserPersistence.cs:498:17
             {
                 JobSeekerEntity? jobSeekerEntity = context.JobSeekers.Where(e => e.user_id == updatedUser.UserId).SingleOrDefault();
                 if(jobSeekerEntity is not null)
-                {
-                    jobSeekerEntity.first_name = updatedUser.FirstName;
-                    jobSeekerEntity.last_name = updatedUser.LastName;
-                }
+                {}
             }
 
killedBy: test.UserServiceIntegrationTest.UpdateUserIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:504:13
                 }
             }
 
-            context.SaveChanges();
+            ;
         }
     }
killedBy: test.UserServiceIntegrationTest.UpdateUserIntegrationTest

[NoCoverage] Null coalescing mutation (remove right)
src/persistence/Implementations/UserPersistence.cs:518:42
     {
         using(AppDbContext context = new(this.config))
         {
-            JobSeekerEntity? jobSeeker = new JobSeekerQuery(context.JobSeekers)
-                                            .IncludeExperiences()
-                                            .GetJobSeekerByUserId(userId) 
-                                            ?? throw new InvalidOperationException("An existing user could not be found in database");
+            JobSeekerEntity? jobSeeker = new JobSeekerQuery(context.JobSeekers)
+                                            .IncludeExperiences()
+                                            .GetJobSeekerByUserId(userId);
 
             ExperienceEntity experienceEntity = new ExperienceObjectAdapter(experience);

[NoCoverage] Statement mutation
src/persistence/Implementations/UserPersistence.cs:524:13
                                             ?? throw new InvalidOperationException("An existing user could not be found in database");
 
             ExperienceEntity experienceEntity = new ExperienceObjectAdapter(experience);
-            jobSeeker.experiences!.Add(experienceEntity);
+            ;
             context.SaveChanges();
 

[NoCoverage] Statement mutation
src/persistence/Implementations/UserPersistence.cs:525:13
 
             ExperienceEntity experienceEntity = new ExperienceObjectAdapter(experience);
             jobSeeker.experiences!.Add(experienceEntity);
-            context.SaveChanges();
+            ;
 
             return experienceEntity.experience_id;

[NoCoverage] Null coalescing mutation (remove right)
src/persistence/Implementations/UserPersistence.cs:540:41
     {
         using(AppDbContext context = new(this.config))
         {
-            JobSeekerEntity jobSeeker = new JobSeekerQuery(context.JobSeekers)
-                                            .IncludeExperiences()
-                                            .GetJobSeekerByUserId(userId)
-                                            ?? throw new InvalidOperationException("An existing user could not be found in database");
+            JobSeekerEntity jobSeeker = new JobSeekerQuery(context.JobSeekers)
+                                            .IncludeExperiences()
+                                            .GetJobSeekerByUserId(userId);
 
             return jobSeeker.experiences!

[NoCoverage] String mutation
src/persistence/Implementations/UserPersistence.cs:543:84
             JobSeekerEntity jobSeeker = new JobSeekerQuery(context.JobSeekers)
                                             .IncludeExperiences()
                                             .GetJobSeekerByUserId(userId)
-                                            ?? throw new InvalidOperationException("An existing user could not be found in database");
+                                            ?? throw new InvalidOperationException("");
 
             return jobSeeker.experiences!

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
src/persistence/Implementations/UserPersistence.cs:566:49
                                             .GetJobSeekerByUserId(userId)
                                             ?? throw new InvalidOperationException("An existing user could not be found in database");
 
-            ExperienceEntity experienceEntity = jobSeeker.experiences!
-                                                    .AsQueryable()
-                                                    .Where(e => e.company_name.Equals(oldExperience.CompanyName)
-                                                        && e.position_title.Equals(oldExperience.PositionTitle)
-                                                        && e.job_description.Equals(oldExperience.JobDescription))
-                                                    .Single();
+            ExperienceEntity experienceEntity = jobSeeker.experiences!
+                                                    .AsQueryable()
+                                                    .Where(e => e.company_name.Equals(oldExperience.CompanyName)
+                                                        && e.position_title.Equals(oldExperience.PositionTitle)
+                                                        && e.job_description.Equals(oldExperience.JobDescription))
+                                                    .SingleOrDefault();
 
             ExperienceEntity newEntity = new ExperienceObjectAdapter(newExperience)

[NoCoverage] Logical mutation
src/persistence/Implementations/UserPersistence.cs:568:65
 
             ExperienceEntity experienceEntity = jobSeeker.experiences!
                                                     .AsQueryable()
-                                                    .Where(e => e.company_name.Equals(oldExperience.CompanyName)
-                                                        && e.position_title.Equals(oldExperience.PositionTitle)
+                                                    .Where(e => e.company_name.Equals(oldExperience.CompanyName)
+                                                        || e.position_title.Equals(oldExperience.PositionTitle)
                                                         && e.job_description.Equals(oldExperience.JobDescription))
                                                     .Single();

[NoCoverage] Logical mutation
src/persistence/Implementations/UserPersistence.cs:568:65
 
             ExperienceEntity experienceEntity = jobSeeker.experiences!
                                                     .AsQueryable()
-                                                    .Where(e => e.company_name.Equals(oldExperience.CompanyName)
-                                                        && e.position_title.Equals(oldExperience.PositionTitle)
-                                                        && e.job_description.Equals(oldExperience.JobDescription))
+                                                    .Where(e => e.company_name.Equals(oldExperience.CompanyName)
+                                                        && e.position_title.Equals(oldExperience.PositionTitle)
+                                                        || e.job_description.Equals(oldExperience.JobDescription))
                                                     .Single();
 

[NoCoverage] Statement mutation
src/persistence/Implementations/UserPersistence.cs:578:13
                 experience_id = experienceEntity.experience_id,
                 seeker_id = experienceEntity.seeker_id
             };
-            context.Entry(experienceEntity).CurrentValues.SetValues(newEntity);
+            ;
             context.SaveChanges();
         }

[NoCoverage] Statement mutation
src/persistence/Implementations/UserPersistence.cs:579:13
                 seeker_id = experienceEntity.seeker_id
             };
             context.Entry(experienceEntity).CurrentValues.SetValues(newEntity);
-            context.SaveChanges();
+            ;
         }
     }

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
src/persistence/Implementations/UserPersistence.cs:597:49
                                             .GetJobSeekerByUserId(userId)
                                             ?? throw new InvalidOperationException("An existing user could not be found in database");
 
-            ExperienceEntity experienceEntity = jobSeeker.experiences!
-                                                    .AsQueryable()
-                                                    .Where(e => e.company_name.Equals(experience.CompanyName)
-                                                        && e.position_title.Equals(experience.PositionTitle)
-                                                        && e.job_description.Equals(experience.JobDescription))
-                                                    .Single();
+            ExperienceEntity experienceEntity = jobSeeker.experiences!
+                                                    .AsQueryable()
+                                                    .Where(e => e.company_name.Equals(experience.CompanyName)
+                                                        && e.position_title.Equals(experience.PositionTitle)
+                                                        && e.job_description.Equals(experience.JobDescription))
+                                                    .SingleOrDefault();
 
             context.Experiences.Remove(experienceEntity);

[NoCoverage] Logical mutation
src/persistence/Implementations/UserPersistence.cs:599:65
 
             ExperienceEntity experienceEntity = jobSeeker.experiences!
                                                     .AsQueryable()
-                                                    .Where(e => e.company_name.Equals(experience.CompanyName)
-                                                        && e.position_title.Equals(experience.PositionTitle)
+                                                    .Where(e => e.company_name.Equals(experience.CompanyName)
+                                                        || e.position_title.Equals(experience.PositionTitle)
                                                         && e.job_description.Equals(experience.JobDescription))
                                                     .Single();

[NoCoverage] Logical mutation
src/persistence/Implementations/UserPersistence.cs:599:65
 
             ExperienceEntity experienceEntity = jobSeeker.experiences!
                                                     .AsQueryable()
-                                                    .Where(e => e.company_name.Equals(experience.CompanyName)
-                                                        && e.position_title.Equals(experience.PositionTitle)
-                                                        && e.job_description.Equals(experience.JobDescription))
+                                                    .Where(e => e.company_name.Equals(experience.CompanyName)
+                                                        && e.position_title.Equals(experience.PositionTitle)
+                                                        || e.job_description.Equals(experience.JobDescription))
                                                     .Single();
 

[NoCoverage] Statement mutation
src/persistence/Implementations/UserPersistence.cs:604:13
                                                         && e.job_description.Equals(experience.JobDescription))
                                                     .Single();
 
-            context.Experiences.Remove(experienceEntity);
+            ;
             context.SaveChanges();
         }

[NoCoverage] Statement mutation
src/persistence/Implementations/UserPersistence.cs:605:13
                                                     .Single();
 
             context.Experiences.Remove(experienceEntity);
-            context.SaveChanges();
+            ;
         }
     }

[NoCoverage] Linq method mutation (Any() to All())
src/persistence/Implementations/UserPersistence.cs:623:43
                                             .IncludeExperiences()
                                             .GetJobSeekerByUserId(userId);
 
-            return jobSeeker?.experiences?.Any(e => e.experience_id == experienceId) ?? false;
+            return jobSeeker?.experiences?.All(e => e.experience_id == experienceId) ?? false;
         }
     }

[NoCoverage] Boolean mutation
src/persistence/Implementations/UserPersistence.cs:623:89
                                             .IncludeExperiences()
                                             .GetJobSeekerByUserId(userId);
 
-            return jobSeeker?.experiences?.Any(e => e.experience_id == experienceId) ?? false;
+            return jobSeeker?.experiences?.Any(e => e.experience_id == experienceId) ?? true;
         }
     }

[Survived] Linq method mutation (Single() to SingleOrDefault())
src/persistence/Implementations/UserPersistence.cs:635:37
     {
         using(AppDbContext context = new(this.config))
         {
-            UserEntity userEntity = context.Users.Where(e => e.verify_token!.Equals(token)).Single();
+            UserEntity userEntity = context.Users.Where(e => e.verify_token!.Equals(token)).SingleOrDefault();
             userEntity.verified = true;
             userEntity.verify_token = null;

[Killed] Boolean mutation
src/persistence/Implementations/UserPersistence.cs:636:35
         using(AppDbContext context = new(this.config))
         {
             UserEntity userEntity = context.Users.Where(e => e.verify_token!.Equals(token)).Single();
-            userEntity.verified = true;
+            userEntity.verified = false;
             userEntity.verify_token = null;
             context.SaveChanges();
killedBy: test.UserServiceIntegrationTest.LoginIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:638:13
             UserEntity userEntity = context.Users.Where(e => e.verify_token!.Equals(token)).Single();
             userEntity.verified = true;
             userEntity.verify_token = null;
-            context.SaveChanges();
+            ;
         }
     }
killedBy: test.UserServiceIntegrationTest.LoginIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:658:13
                 comment = comment.Comment
             };
 
-            context.UserComments.Add(newComment);
+            ;
             context.SaveChanges();
         }
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Statement mutation
src/persistence/Implementations/UserPersistence.cs:659:13
             };
 
             context.UserComments.Add(newComment);
-            context.SaveChanges();
+            ;
         }
 
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Linq method mutation (Single() to SingleOrDefault())
src/persistence/Implementations/UserPersistence.cs:676:31
 
         using(AppDbContext context = new(this.config))
         {
-            UserEntity user = context.Users
-                            .Where(e => e.user_id == userId)
-                            .Include(e => e.profileComments!)
-                                .ThenInclude(e => e.posterUser)
-                            .Single();
+            UserEntity user = context.Users
+                            .Where(e => e.user_id == userId)
+                            .Include(e => e.profileComments!)
+                                .ThenInclude(e => e.posterUser)
+                            .SingleOrDefault();
 
             if(user.profileComments is not null)
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:677:41
         using(AppDbContext context = new(this.config))
         {
             UserEntity user = context.Users
-                            .Where(e => e.user_id == userId)
+                            .Where(e => e.user_id != userId)
                             .Include(e => e.profileComments!)
                                 .ThenInclude(e => e.posterUser)
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:682:16
                                 .ThenInclude(e => e.posterUser)
                             .Single();
 
-            if(user.profileComments is not null)
+            if(user.profileComments is null)
             {
                 comments = user.profileComments
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Equality mutation
src/persistence/Implementations/UserPersistence.cs:685:45
             if(user.profileComments is not null)
             {
                 comments = user.profileComments
-                                .Where(e => e.posterUser is not null)
+                                .Where(e => e.posterUser is null)
                                 .Select(e => (UserComment)new UserCommentEntityAdapter(e)).ToList();
             }
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest
