[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
persistence/Implementations/Validation/ValidationRegex.cs:12:9
 
 
     public static bool IsValidEmail(string? email) =>
-        !string.IsNullOrWhiteSpace(email) && emailRegex.IsMatch(email.Trim());
+        string.IsNullOrWhiteSpace(email) && emailRegex.IsMatch(email.Trim());
 }
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[Killed] Logical mutation
persistence/Implementations/Validation/ValidationRegex.cs:12:9
 
 
     public static bool IsValidEmail(string? email) =>
-        !string.IsNullOrWhiteSpace(email) && emailRegex.IsMatch(email.Trim());
+        !string.IsNullOrWhiteSpace(email) || emailRegex.IsMatch(email.Trim());
 }
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest
