[Killed] Block removal mutation
src/persistence/model/ExperienceEntity.cs:11:5
 {
     [SetsRequiredMembers]
     public ExperienceEntity(string company_name, string position_title, string job_description)
-    {
-        this.company_name = company_name;
-        this.position_title = position_title;
-        this.job_description = job_description;
-    }
+    {}
 
     public int experience_id { get; set; }
killedBy: test.ExperienceEntityAdapterTest.EmptyCompanyNameTest; test.ExperienceEntityAdapterTest.EmptyPositionTitleTest; test.ExperienceEntityAdapterTest.HappyCaseTest
