[Killed] Block removal mutation
src/persistence/model/FollowsEntity.cs:14:5
     public UserEntity? followed;
 
     public FollowsEntity(int follower_id, int followed_id)
-    {
-        this.follower_id = follower_id;
-        this.followed_id = followed_id;
-    }
+    {}
 }
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest
