[Killed] Block removal mutation
src/persistence/model/JobEntity.cs:35:5
 
     [SetsRequiredMembers]
-    {
-        this.job_title = job_title;
-        this.employer_poster = employer_poster;
-        this.application_deadline = application_deadline;
-        this.application_link = application_link;
-        this.has_remote = has_remote;
-        this.has_hybrid = has_hybrid;
-        this.position_type = position_type;
-        this.employment_type = employment_type;
-        this.job_description = job_description;
-    }
+    {}
 }
 
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest
