[NoCoverage] Block removal mutation
src/persistence/model/JobLanguageEntity.cs:16:5
 
     [SetsRequiredMembers]
     public JobLanguageEntity(int job_id, string language_name)
-    {
-        this.job_id = job_id;
-        this.language_name = language_name;
-    }
+    {}
 }
