[NoCoverage] Block removal mutation
src/persistence/model/JobLocationEntity.cs:16:5
     public LocationEntity? location { get; set; }
 
     public JobLocationEntity(int job_id, int location_id)
-    {
-        this.job_id = job_id;
-        this.location_id = location_id;
-    }
+    {}
 }
