[NoCoverage] Block removal mutation
src/persistence/model/ProgrammingLanguageEntity.cs:14:5
 
     [SetsRequiredMembers]
     public ProgrammingLanguageEntity(string language_name)
-    {
-        this.language_name = language_name;
-    }
+    {}
 }
