[Killed] Block removal mutation
Services/Implementations/AddJob/JobAddService.cs:18:5
     /// Extracts the contents of newJob using a helper function.
     /// Returns the newly added job's id.
     public int AddNewJob(int userId, NewJob newJob)
-    {
-        Job extractedJob = ExtractJobFromInput(userId, newJob);
-        return jobPersistence.CreateJob(extractedJob);
-    }
+    {}
 
     /// Extract the information in a newJob into a Job. 
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobAddServiceTest.AddJobWithBadDateFormat; test.JobAddServiceTest.AddJobWithBadLinkFormat

[Killed] Equality mutation
Services/Implementations/AddJob/JobAddService.cs:34:13
         //extracting the appropriate poster name depending if they're a company or job seeker
         UserFinder userFinder = new UserFinder(userPersistence);
         User? user = userFinder.GetUser(userId);
-        if (user == null)
+        if (user != null)
         {
             throw new NullReferenceException("User not found.");   
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobAddServiceTest.AddJobAsEmployer; test.JobAddServiceTest.AddJobAsSeeker

[NoCoverage] Statement mutation
Services/Implementations/AddJob/JobAddService.cs:36:13
         User? user = userFinder.GetUser(userId);
         if (user == null)
         {
-            throw new NullReferenceException("User not found.");   
+            ;   
         }
 

[Survived] String mutation
Services/Implementations/AddJob/JobAddService.cs:39:29
             throw new NullReferenceException("User not found.");   
         }
 
-        string posterName = ""; 
+        string posterName = "Stryker was here!"; 
         if (NewJob.EmployerPoster && user.EmployerName != null)
         {

[Killed] Negate expression
Services/Implementations/AddJob/JobAddService.cs:40:13
         }
 
         string posterName = ""; 
-        if (NewJob.EmployerPoster && user.EmployerName != null)
+        if (!(NewJob.EmployerPoster && user.EmployerName != null))
         {
             posterName = user.EmployerName;
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Logical mutation
Services/Implementations/AddJob/JobAddService.cs:40:13
         }
 
         string posterName = ""; 
-        if (NewJob.EmployerPoster && user.EmployerName != null)
+        if (NewJob.EmployerPoster || user.EmployerName != null)
         {
             posterName = user.EmployerName;
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Survived] Block removal mutation
Services/Implementations/AddJob/JobAddService.cs:41:9
 
         string posterName = ""; 
         if (NewJob.EmployerPoster && user.EmployerName != null)
-        {
-            posterName = user.EmployerName;
-        }
+        {}
         else if (user.FirstName != null && user.LastName != null)
         {

[Killed] Negate expression
Services/Implementations/AddJob/JobAddService.cs:44:18
         {
             posterName = user.EmployerName;
         }
-        else if (user.FirstName != null && user.LastName != null)
+        else if (!(user.FirstName != null && user.LastName != null))
         {
             posterName = user.FirstName + " " + user.LastName;
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Equality mutation
Services/Implementations/AddJob/JobAddService.cs:44:18
         {
             posterName = user.EmployerName;
         }
-        else if (user.FirstName != null && user.LastName != null)
+        else if (user.FirstName == null && user.LastName != null)
         {
             posterName = user.FirstName + " " + user.LastName;
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] String mutation
Services/Implementations/AddJob/JobAddService.cs:46:43
         }
         else if (user.FirstName != null && user.LastName != null)
         {
-            posterName = user.FirstName + " " + user.LastName;
+            posterName = user.FirstName + "" + user.LastName;
         }
 
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/AddJob/JobAddService.cs:51:13
 
         //setup for the rest of the Job attributes
         DateOnly? deadlineDate = null;
-        if (!NewJob.Deadline.Equals(String.Empty))
+        if (NewJob.Deadline.Equals(String.Empty))
         {
             bool isValidDate = DateOnly.TryParse(NewJob.Deadline, out DateOnly parsedDate);
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobAddServiceTest.AddJobWithBadDateFormat

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/AddJob/JobAddService.cs:54:17
         if (!NewJob.Deadline.Equals(String.Empty))
         {
             bool isValidDate = DateOnly.TryParse(NewJob.Deadline, out DateOnly parsedDate);
-            if (!isValidDate)
+            if (isValidDate)
             {
                 throw new FormatException("Invalid date format. Only provide dates in formats like YYYY-MM-DD");
killedBy: test.JobAddServiceTest.AddJobAsEmployer; test.JobAddServiceTest.AddJobAsSeeker; test.JobAddServiceTest.AddJobWithBadDateFormat

[Killed] Statement mutation
Services/Implementations/AddJob/JobAddService.cs:56:17
             bool isValidDate = DateOnly.TryParse(NewJob.Deadline, out DateOnly parsedDate);
             if (!isValidDate)
             {
-                throw new FormatException("Invalid date format. Only provide dates in formats like YYYY-MM-DD");
+                ;
             }
             else
killedBy: test.JobAddServiceTest.AddJobWithBadDateFormat

[Survived] Block removal mutation
Services/Implementations/AddJob/JobAddService.cs:59:13
                 throw new FormatException("Invalid date format. Only provide dates in formats like YYYY-MM-DD");
             }
             else
-            {
-                deadlineDate = parsedDate;
-            }
+            {}
         }    
         

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/AddJob/JobAddService.cs:65:13
         }    
         
         bool isValidLink = ValidationRegex.linkRegex.IsMatch(NewJob.ApplicationLink);
-        if (!isValidLink)
+        if (isValidLink)
         {
             throw new FormatException("Invalid application link format.");
killedBy: test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest; test.JobAddServiceTest.AddJobAsEmployer; test.JobAddServiceTest.AddJobAsSeeker

[Killed] Statement mutation
Services/Implementations/AddJob/JobAddService.cs:67:13
         bool isValidLink = ValidationRegex.linkRegex.IsMatch(NewJob.ApplicationLink);
         if (!isValidLink)
         {
-            throw new FormatException("Invalid application link format.");
+            ;
         }
 
killedBy: test.JobAddServiceTest.AddJobWithBadLinkFormat
