[NoCoverage] String mutation
Services/Implementations/AI/GroqGenericWordsService.cs:15:71
     /// advice, and the detected word followed by a recommended replacement.</returns>
     public async Task<GenericWordsAnalysis> AnalyzeParagraph(string paragraph)
     {
-        var userPrompt = GenericWordsPrompts.AnalyzeParagraph.Replace("<<PARAGRAPH>>", paragraph);
+        var userPrompt = GenericWordsPrompts.AnalyzeParagraph.Replace("", paragraph);
         var responseJson = await groqService.CompleteAsync(GenericWordsPrompts.SystemPrompt, userPrompt);
 

[NoCoverage] Null coalescing mutation (remove left)
Services/Implementations/AI/GroqGenericWordsService.cs:27:22
                 .EnumerateArray()
                 .Select(e => e.GetInt32())],
                 
-            Advice = root.GetProperty("advice").GetString() ?? "",
+            Advice = "",
 
             Recommendations = [..root.GetProperty("recommendations")

[NoCoverage] Null coalescing mutation (remove left)
Services/Implementations/AI/GroqGenericWordsService.cs:33:24
                 .EnumerateArray()
                 .Select(e => new WordRecommendation
             {
-                Word = e.GetProperty("word").GetString() ?? "",
+                Word = "",
                 Suggestion = e.GetProperty("suggestion").GetString() ?? ""
             })]

[NoCoverage] String mutation
Services/Implementations/AI/GroqGenericWordsService.cs:33:61
                 .EnumerateArray()
                 .Select(e => new WordRecommendation
             {
-                Word = e.GetProperty("word").GetString() ?? "",
+                Word = e.GetProperty("word").GetString() ?? "Stryker was here!",
                 Suggestion = e.GetProperty("suggestion").GetString() ?? ""
             })]

[NoCoverage] Null coalescing mutation (remove left)
Services/Implementations/AI/GroqGenericWordsService.cs:34:30
                 .Select(e => new WordRecommendation
             {
                 Word = e.GetProperty("word").GetString() ?? "",
-                Suggestion = e.GetProperty("suggestion").GetString() ?? ""
+                Suggestion = ""
             })]
         };

[NoCoverage] String mutation
Services/Implementations/AI/GroqGenericWordsService.cs:34:73
                 .Select(e => new WordRecommendation
             {
                 Word = e.GetProperty("word").GetString() ?? "",
-                Suggestion = e.GetProperty("suggestion").GetString() ?? ""
+                Suggestion = e.GetProperty("suggestion").GetString() ?? "Stryker was here!"
             })]
         };
