[Killed] Negate expression
Services/Implementations/Comments/CommentsService.cs:14:12
     /// Returns a list of comments, if there are any and if the jobId corresponds to a valid job.
     public List<JobComment> GetComments(int jobId)
     {
-        if(jobId < 0)
+        if(!(jobId < 0))
         {
             throw new ArgumentException("Job ID of comment must be non-negative");
killedBy: test.CommentsServiceTest.GetCommentNegativeJobId; test.CommentsServiceTest.GetCommentsHappy

[Killed] Equality mutation
Services/Implementations/Comments/CommentsService.cs:14:12
     /// Returns a list of comments, if there are any and if the jobId corresponds to a valid job.
     public List<JobComment> GetComments(int jobId)
     {
-        if(jobId < 0)
+        if(jobId > 0)
         {
             throw new ArgumentException("Job ID of comment must be non-negative");
killedBy: test.CommentsServiceTest.GetCommentNegativeJobId

[Killed] Statement mutation
Services/Implementations/Comments/CommentsService.cs:16:13
     {
         if(jobId < 0)
         {
-            throw new ArgumentException("Job ID of comment must be non-negative");
+            ;
         }
 
killedBy: test.CommentsServiceTest.GetCommentNegativeJobId

[Survived] String mutation
Services/Implementations/Comments/CommentsService.cs:16:41
     {
         if(jobId < 0)
         {
-            throw new ArgumentException("Job ID of comment must be non-negative");
+            throw new ArgumentException("");
         }
 

[Survived] Statement mutation
Services/Implementations/Comments/CommentsService.cs:32:13
         
         if (user == null)
         {
-            throw new NullReferenceException("User not found");
+            ;
         }
         else if(comment.JobId < 0)

[Survived] String mutation
Services/Implementations/Comments/CommentsService.cs:32:46
         
         if (user == null)
         {
-            throw new NullReferenceException("User not found");
+            throw new NullReferenceException("");
         }
         else if(comment.JobId < 0)

[Killed] Negate expression
Services/Implementations/Comments/CommentsService.cs:34:17
         {
             throw new NullReferenceException("User not found");
         }
-        else if(comment.JobId < 0)
+        else if(!(comment.JobId < 0))
         {
             throw new ArgumentException("Job ID of comment must be non-negative");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.CommentsServiceTest.CreateCommentHappy; test.CommentsServiceTest.CreateCommentNegativeJobId

[Killed] Equality mutation
Services/Implementations/Comments/CommentsService.cs:34:17
         {
             throw new NullReferenceException("User not found");
         }
-        else if(comment.JobId < 0)
+        else if(comment.JobId > 0)
         {
             throw new ArgumentException("Job ID of comment must be non-negative");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.CommentsServiceTest.CreateCommentHappy; test.CommentsServiceTest.CreateCommentNegativeJobId

[Killed] Negate expression
Services/Implementations/Comments/CommentsService.cs:38:17
         {
             throw new ArgumentException("Job ID of comment must be non-negative");
         }
-        else if(comment.Comment.Trim().Equals(String.Empty))
+        else if(!(comment.Comment.Trim().Equals(String.Empty)))
         {
             throw new ArgumentException("Comment string cannot be empty");
killedBy: test.CommentsServiceIntegrationTest.CreateCommentIntegrationTest; test.CommentsServiceTest.CreateCommentEmpty; test.CommentsServiceTest.CreateCommentHappy

[Killed] Statement mutation
Services/Implementations/Comments/CommentsService.cs:40:13
         }
         else if(comment.Comment.Trim().Equals(String.Empty))
         {
-            throw new ArgumentException("Comment string cannot be empty");
+            ;
         }
 
killedBy: test.CommentsServiceTest.CreateCommentEmpty; test.CommentsServiceTest.CreateCommentSpace

[Survived] String mutation
Services/Implementations/Comments/CommentsService.cs:40:41
         }
         else if(comment.Comment.Trim().Equals(String.Empty))
         {
-            throw new ArgumentException("Comment string cannot be empty");
+            throw new ArgumentException("");
         }
 
