[Killed] Negate expression
Services/Implementations/Comments/UserCommentsService.cs:15:12
     /// Returns a list of comments, if there are any and if the username corresponds to a valid job.
     public List<UserComment> GetComments(string username)
     {
-        if(username == null || username.Trim().Equals(string.Empty))
+        if(!(username == null || username.Trim().Equals(string.Empty)))
         {
             throw new ArgumentException("Username must be not empty");
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Equality mutation
Services/Implementations/Comments/UserCommentsService.cs:15:12
     /// Returns a list of comments, if there are any and if the username corresponds to a valid job.
     public List<UserComment> GetComments(string username)
     {
-        if(username == null || username.Trim().Equals(string.Empty))
+        if(username != null || username.Trim().Equals(string.Empty))
         {
             throw new ArgumentException("Username must be not empty");
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[NoCoverage] Statement mutation
Services/Implementations/Comments/UserCommentsService.cs:17:13
     {
         if(username == null || username.Trim().Equals(string.Empty))
         {
-            throw new ArgumentException("Username must be not empty");
+            ;
         }
         User? user = userPersistence.GetUserByUsername(username);

[Killed] Equality mutation
Services/Implementations/Comments/UserCommentsService.cs:20:13
             throw new ArgumentException("Username must be not empty");
         }
         User? user = userPersistence.GetUserByUsername(username);
-        if (user == null)
+        if (user != null)
         {
             throw new NullReferenceException("User not found");
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Negate expression
Services/Implementations/Comments/UserCommentsService.cs:39:17
         {
             throw new NullReferenceException("User not found");
         }
-        else if(comment.Comment.Trim().Equals(string.Empty))
+        else if(!(comment.Comment.Trim().Equals(string.Empty)))
         {
             throw new ArgumentException("Comment string cannot be empty");
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[Killed] Equality mutation
Services/Implementations/Comments/UserCommentsService.cs:45:13
         }
 
         User? sessionUser = userPersistence.GetUser(comment.PosterUserId);
-        if (sessionUser == null)
+        if (sessionUser != null)
         {
             throw new NullReferenceException("Poster user not found");
killedBy: test.UserCommentsServiceIntegrationTest.CreateCommentIntegrationTest

[NoCoverage] Statement mutation
Services/Implementations/Comments/UserCommentsService.cs:47:13
         User? sessionUser = userPersistence.GetUser(comment.PosterUserId);
         if (sessionUser == null)
         {
-            throw new NullReferenceException("Poster user not found");
+            ;
         }
 
