[Killed] Boolean mutation
Services/Implementations/DatingJobGame/GameService.cs:10:38
 {
     private int jobAccepted = 0;
     private int jobRejected = 0;
-    private bool isGameInitialized = false;
+    private bool isGameInitialized = true;
     private bool hasActiveJob = false;
     List<Job> allJobs = [];
killedBy: test.GameServiceTest.AcceptBeforeInitializationTest; test.GameServiceTest.RejectBeforeInitializationTest

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/GameService.cs:11:33
     private int jobAccepted = 0;
     private int jobRejected = 0;
     private bool isGameInitialized = false;
-    private bool hasActiveJob = false;
+    private bool hasActiveJob = true;
     List<Job> allJobs = [];
     private Dictionary<string, string>? currentFilters;
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Negate expression
Services/Implementations/DatingJobGame/GameService.cs:21:13
     /// Returns the next job to display. 
     private Job? GetGameJob(bool initialize = false, bool? isAccepted = null)
     {
-        if (!initialize && isAccepted.HasValue && hasActiveJob)
+        if (!(!initialize && isAccepted.HasValue && hasActiveJob))
         {
             if (isAccepted.Value) 
killedBy: test.GameServiceTest.AcceptEmptyTest; test.GameServiceTest.AcceptOneGameStatTest; test.GameServiceTest.AcceptOneTest

[Killed] Logical mutation
Services/Implementations/DatingJobGame/GameService.cs:21:13
     /// Returns the next job to display. 
     private Job? GetGameJob(bool initialize = false, bool? isAccepted = null)
     {
-        if (!initialize && isAccepted.HasValue && hasActiveJob)
+        if (!initialize && isAccepted.HasValue || hasActiveJob)
         {
             if (isAccepted.Value) 
killedBy: test.GameServiceTest.SpamAcceptGameStatsTest; test.GameServiceTest.SpamMixGameStatsTest; test.GameServiceTest.SpamRejectGameStatsTest

[Killed] Negate expression
Services/Implementations/DatingJobGame/GameService.cs:23:17
     {
         if (!initialize && isAccepted.HasValue && hasActiveJob)
         {
-            if (isAccepted.Value) 
+            if (!(isAccepted.Value)) 
             {
                 jobAccepted++;
killedBy: test.GameServiceTest.AcceptOneGameStatTest; test.GameServiceTest.GetMultipleAcceptGameStatsTest; test.GameServiceTest.GetMultipleFailGameStatsTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/GameService.cs:25:17
         {
             if (isAccepted.Value) 
             {
-                jobAccepted++;
+                ;
             }
             else
killedBy: test.GameServiceTest.AcceptOneGameStatTest; test.GameServiceTest.GetMultipleAcceptGameStatsTest; test.GameServiceTest.GetMultipleMixGameStatsTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Services/Implementations/DatingJobGame/GameService.cs:25:17
         {
             if (isAccepted.Value) 
             {
-                jobAccepted++;
+                jobAccepted--;
             }
             else
killedBy: test.GameServiceTest.AcceptOneGameStatTest; test.GameServiceTest.GetMultipleAcceptGameStatsTest; test.GameServiceTest.GetMultipleMixGameStatsTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/GameService.cs:29:17
             }
             else
             {
-                jobRejected++;
+                ;
             }
             hasActiveJob = false;
killedBy: test.GameServiceTest.GetMultipleFailGameStatsTest; test.GameServiceTest.GetMultipleMixGameStatsTest; test.GameServiceTest.RejectOneGameStatTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Services/Implementations/DatingJobGame/GameService.cs:29:17
             }
             else
             {
-                jobRejected++;
+                jobRejected--;
             }
             hasActiveJob = false;
killedBy: test.GameServiceTest.GetMultipleFailGameStatsTest; test.GameServiceTest.GetMultipleMixGameStatsTest; test.GameServiceTest.RejectOneGameStatTest

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/GameService.cs:31:28
             {
                 jobRejected++;
             }
-            hasActiveJob = false;
+            hasActiveJob = true;
         }
         // fetches the next page of jobs and shuffle them for the next round of the game.
killedBy: test.GameServiceTest.SpamAcceptGameStatsTest; test.GameServiceTest.SpamMixGameStatsTest; test.GameServiceTest.SpamRejectGameStatsTest

[Killed] Block removal mutation
Services/Implementations/DatingJobGame/GameService.cs:35:9
         }
         // fetches the next page of jobs and shuffle them for the next round of the game.
         if (allJobs.Count == 0)
-        {
-            allJobs = jobIndexManager.GetJobs();
-        }
+        {}
 
         if (allJobs.Count == 0)
killedBy: test.GameServiceTest.AcceptOneGameStatTest; test.GameServiceTest.AcceptOneTest; test.GameServiceTest.FetchJobsAgainTest

[Killed] Block removal mutation
Services/Implementations/DatingJobGame/GameService.cs:40:9
         }
 
         if (allJobs.Count == 0)
-        {
-            return null;
-        } 
+        {} 
 
         Job job = allJobs[0];
killedBy: test.GameServiceTest.AcceptEmptyTest; test.GameServiceTest.AcceptOneGameStatTest; test.GameServiceTest.AcceptOneTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/GameService.cs:45:9
         } 
 
         Job job = allJobs[0];
-        allJobs.RemoveAt(0);
+        ;
         hasActiveJob = true;
         
killedBy: test.GameServiceTest.AcceptOneTest; test.GameServiceTest.FetchJobsAgainTest; test.GameServiceTest.GetMultipleJobTest

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/GameService.cs:46:24
 
         Job job = allJobs[0];
         allJobs.RemoveAt(0);
-        hasActiveJob = true;
+        hasActiveJob = false;
         
         return job;
killedBy: test.GameServiceTest.AcceptOneGameStatTest; test.GameServiceTest.GetMultipleAcceptGameStatsTest; test.GameServiceTest.GetMultipleFailGameStatsTest

[Killed] Null coalescing mutation (remove right)
Services/Implementations/DatingJobGame/GameService.cs:57:26
     /// Returns a random job to start the game.
     public Job? InitializeJobGame(IReadOnlyDictionary<string, string>? filters = null)
     {
-        currentFilters = filters?.ToDictionary(k => k.Key, v => v.Value) ?? [];
+        currentFilters = filters?.ToDictionary(k => k.Key, v => v.Value);
         jobIndexManager.UpdateFilters(currentFilters);
         jobAccepted = 0;
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Null coalescing mutation (remove left)
Services/Implementations/DatingJobGame/GameService.cs:57:26
     /// Returns a random job to start the game.
     public Job? InitializeJobGame(IReadOnlyDictionary<string, string>? filters = null)
     {
-        currentFilters = filters?.ToDictionary(k => k.Key, v => v.Value) ?? [];
+        currentFilters = [];
         jobIndexManager.UpdateFilters(currentFilters);
         jobAccepted = 0;
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Timeout] Statement mutation
Services/Implementations/DatingJobGame/GameService.cs:58:9
     public Job? InitializeJobGame(IReadOnlyDictionary<string, string>? filters = null)
     {
         currentFilters = filters?.ToDictionary(k => k.Key, v => v.Value) ?? [];
-        jobIndexManager.UpdateFilters(currentFilters);
+        ;
         jobAccepted = 0;
         jobRejected = 0;

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/GameService.cs:61:29
         jobIndexManager.UpdateFilters(currentFilters);
         jobAccepted = 0;
         jobRejected = 0;
-        isGameInitialized = true;
+        isGameInitialized = false;
         hasActiveJob = false;
         allJobs.Clear();
killedBy: test.GameServiceTest.AcceptEmptyTest; test.GameServiceTest.AcceptOneGameStatTest; test.GameServiceTest.AcceptOneTest

[Survived] Boolean mutation
Services/Implementations/DatingJobGame/GameService.cs:62:24
         jobAccepted = 0;
         jobRejected = 0;
         isGameInitialized = true;
-        hasActiveJob = false;
+        hasActiveJob = true;
         allJobs.Clear();
 

[Killed] Statement mutation
Services/Implementations/DatingJobGame/GameService.cs:63:9
         jobRejected = 0;
         isGameInitialized = true;
         hasActiveJob = false;
-        allJobs.Clear();
+        ;
 
         return GetGameJob(initialize: true);
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/GameService.cs:65:39
         hasActiveJob = false;
         allJobs.Clear();
 
-        return GetGameJob(initialize: true);
+        return GetGameJob(initialize: false);
     }
 
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/DatingJobGame/GameService.cs:73:13
     /// Returns the next job in the game.
     public Job? RejectJob()
     {
-        if (!isGameInitialized)
+        if (isGameInitialized)
         {
             throw new InvalidOperationException("Game not initialized. Please call InitializeJobGame() before rejecting jobs.");
killedBy: test.GameServiceTest.GetMultipleFailGameStatsTest; test.GameServiceTest.GetMultipleMixGameStatsTest; test.GameServiceTest.RejectBeforeInitializationTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/GameService.cs:75:13
     {
         if (!isGameInitialized)
         {
-            throw new InvalidOperationException("Game not initialized. Please call InitializeJobGame() before rejecting jobs.");
+            ;
         }
         return GetGameJob(isAccepted: false);
killedBy: test.GameServiceTest.RejectBeforeInitializationTest

[Survived] String mutation
Services/Implementations/DatingJobGame/GameService.cs:75:49
     {
         if (!isGameInitialized)
         {
-            throw new InvalidOperationException("Game not initialized. Please call InitializeJobGame() before rejecting jobs.");
+            throw new InvalidOperationException("");
         }
         return GetGameJob(isAccepted: false);

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/GameService.cs:77:39
         {
             throw new InvalidOperationException("Game not initialized. Please call InitializeJobGame() before rejecting jobs.");
         }
-        return GetGameJob(isAccepted: false);
+        return GetGameJob(isAccepted: true);
     }
 
killedBy: test.GameServiceTest.GetMultipleFailGameStatsTest; test.GameServiceTest.GetMultipleMixGameStatsTest; test.GameServiceTest.RejectOneGameStatTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/GameService.cs:87:13
     {
         if (!isGameInitialized)
         {
-            throw new InvalidOperationException("Game not initialized. Please call InitializeJobGame() before accepting jobs.");
+            ;
         }
         return GetGameJob(isAccepted: true);
killedBy: test.GameServiceTest.AcceptBeforeInitializationTest

[Survived] String mutation
Services/Implementations/DatingJobGame/GameService.cs:87:49
     {
         if (!isGameInitialized)
         {
-            throw new InvalidOperationException("Game not initialized. Please call InitializeJobGame() before accepting jobs.");
+            throw new InvalidOperationException("");
         }
         return GetGameJob(isAccepted: true);

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/GameService.cs:89:39
         {
             throw new InvalidOperationException("Game not initialized. Please call InitializeJobGame() before accepting jobs.");
         }
-        return GetGameJob(isAccepted: true);
+        return GetGameJob(isAccepted: false);
     }
 
killedBy: test.GameServiceTest.AcceptOneGameStatTest; test.GameServiceTest.GetMultipleAcceptGameStatsTest; test.GameServiceTest.GetMultipleMixGameStatsTest

[NoCoverage] Statement mutation
Services/Implementations/DatingJobGame/GameService.cs:98:13
     {
         if (!isGameInitialized)
         {
-            throw new InvalidOperationException("Game not initialized. Please call InitializeJobGame() before getting game stats.");
+            ;
         }
         return (jobAccepted, jobRejected);
