[NoCoverage] Block removal mutation
Services/Implementations/DatingJobGame/GameServiceSingleton.cs:16:5
     /// <param name="currentUser">The user accessing the game.
     /// Returns a random job to start the game.
     public GameServiceSingleton(IServiceScopeFactory scopeFactory)
-    {
-        using var scope = scopeFactory.CreateScope();
-        var userPersistence = scope.ServiceProvider.GetRequiredService<IUserPersistence>();
-        var jobPersistence = scope.ServiceProvider.GetRequiredService<IJobPersistence>();
-        var jobService = scope.ServiceProvider.GetRequiredService<IJobService>();
-        
-        jobGameService = new JobGameService(userPersistence, jobPersistence, jobService);
-    }
+    {}
 
     /// Initialize a job list for the game based on the provided filters. 

[NoCoverage] Equality mutation
Services/Implementations/DatingJobGame/GameServiceSingleton.cs:30:13
     /// Returns a random job to start the game.
     public Job? InitializeJobGame(CurrentUser currentUser)
     {
-        if (jobGameService == null) throw new InvalidOperationException("Service not initialized.");
+        if (jobGameService != null) throw new InvalidOperationException("Service not initialized.");
         return jobGameService.InitializeJobGame(currentUser);
     }

[NoCoverage] Statement mutation
Services/Implementations/DatingJobGame/GameServiceSingleton.cs:30:37
     /// Returns a random job to start the game.
     public Job? InitializeJobGame(CurrentUser currentUser)
     {
-        if (jobGameService == null) throw new InvalidOperationException("Service not initialized.");
+        if (jobGameService == null) ;
         return jobGameService.InitializeJobGame(currentUser);
     }

[NoCoverage] Equality mutation
Services/Implementations/DatingJobGame/GameServiceSingleton.cs:39:13
     /// Returns the next job in the game.
     public Job? AcceptJob(GameJob gameJob)
     {
-        if (jobGameService == null) throw new InvalidOperationException("Game not initialized.");
+        if (jobGameService != null) throw new InvalidOperationException("Game not initialized.");
         return jobGameService.AcceptJob(gameJob);
     }

[NoCoverage] Statement mutation
Services/Implementations/DatingJobGame/GameServiceSingleton.cs:39:37
     /// Returns the next job in the game.
     public Job? AcceptJob(GameJob gameJob)
     {
-        if (jobGameService == null) throw new InvalidOperationException("Game not initialized.");
+        if (jobGameService == null) ;
         return jobGameService.AcceptJob(gameJob);
     }
