[Killed] Block removal mutation
Services/Implementations/DatingJobGame/JobGameConnector.cs:17:5
     /// - The filters are the same as those used in GetJobs under JobService.
     /// Returns a random job to start the game.
     public Job? InitializeJobGame(User currentUser, IReadOnlyDictionary<string, string>? filters = null)
-    {
-        GameServiceList[currentUser.UserId] = new GameService(new ShuffleJobsService(jobService));
-        return GameServiceList[currentUser.UserId].InitializeJobGame();
-    }
+    {}
     
     /// Reject the current job. The game statistics are updated to reflect the rejection.
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Block removal mutation
Services/Implementations/DatingJobGame/JobGameConnector.cs:27:5
     /// <param name="job">The job being rejected. 
     /// Returns the next job in the game.
     public Job? RejectJob(User user, Job job)
-    {
-        return GameServiceList[user.UserId].RejectJob();  
-    }
+    {}
 
     /// Accept the current job. The game statistics are updated to reflect the acceptance.    /// <param name="user">The user accessing the game.
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/DatingJobGame/JobGameConnector.cs:37:13
     /// Returns the next job in the game.
     public Job? AcceptJob(User user, Job job)
     {
-        if (!GameServiceList.ContainsKey(user.UserId))
+        if (GameServiceList.ContainsKey(user.UserId))
         {
             throw new InvalidOperationException("UserId doesn't match an existing user");
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceTest.AcceptJobHappy

[NoCoverage] Statement mutation
Services/Implementations/DatingJobGame/JobGameConnector.cs:39:13
     {
         if (!GameServiceList.ContainsKey(user.UserId))
         {
-            throw new InvalidOperationException("UserId doesn't match an existing user");
+            ;
         }
         

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/DatingJobGame/JobGameConnector.cs:43:13
         }
         
         //If we already saved it just dont save it again
-        if (!userPersistence.IsJobInLikes(user.UserId, (int)job.JobId!))
+        if (userPersistence.IsJobInLikes(user.UserId, (int)job.JobId!))
         {
             userPersistence.SaveJob(user.UserId, (int)job.JobId);

[Killed] Statement mutation
Services/Implementations/DatingJobGame/JobGameConnector.cs:45:13
         //If we already saved it just dont save it again
         if (!userPersistence.IsJobInLikes(user.UserId, (int)job.JobId!))
         {
-            userPersistence.SaveJob(user.UserId, (int)job.JobId);
+            ;
         }
 
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest
