[Killed] Equality mutation
Services/Implementations/DatingJobGame/JobGameService.cs:20:13
     /// Returns a random job to start the game.
     public Job? InitializeJobGame(CurrentUser currentUser)
     {
-        if (currentUser.UserId < 0)
+        if (currentUser.UserId > 0)
         {
             throw new InvalidOperationException("UserId provided must be non-negative");
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Equality mutation
Services/Implementations/DatingJobGame/JobGameService.cs:20:13
     /// Returns a random job to start the game.
     public Job? InitializeJobGame(CurrentUser currentUser)
     {
-        if (currentUser.UserId < 0)
+        if (currentUser.UserId <= 0)
         {
             throw new InvalidOperationException("UserId provided must be non-negative");
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Survived] Statement mutation
Services/Implementations/DatingJobGame/JobGameService.cs:22:13
     {
         if (currentUser.UserId < 0)
         {
-            throw new InvalidOperationException("UserId provided must be non-negative");
+            ;
         }     
         User? user = userFinder.GetUser(currentUser.UserId);

[Survived] String mutation
Services/Implementations/DatingJobGame/JobGameService.cs:22:49
     {
         if (currentUser.UserId < 0)
         {
-            throw new InvalidOperationException("UserId provided must be non-negative");
+            throw new InvalidOperationException("");
         }     
         User? user = userFinder.GetUser(currentUser.UserId);

[Killed] Equality mutation
Services/Implementations/DatingJobGame/JobGameService.cs:25:13
             throw new InvalidOperationException("UserId provided must be non-negative");
         }     
         User? user = userFinder.GetUser(currentUser.UserId);
-        if (user is null)
+        if (user is not null)
         {
             throw new InvalidOperationException("UserId doesn't match an existing user");
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Equality mutation
Services/Implementations/DatingJobGame/JobGameService.cs:37:13
     /// Returns the next job in the game.
     public Job? RejectJob(GameJob gameJob)
     {
-        if (gameJob.UserId < 0)
+        if (gameJob.UserId <= 0)
         {
             throw new InvalidOperationException("UserId provided must be non-negative");
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Negate expression
Services/Implementations/DatingJobGame/JobGameService.cs:37:13
     /// Returns the next job in the game.
     public Job? RejectJob(GameJob gameJob)
     {
-        if (gameJob.UserId < 0)
+        if (!(gameJob.UserId < 0))
         {
             throw new InvalidOperationException("UserId provided must be non-negative");
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobGameServiceTest.RejectJobHappy

[Killed] Equality mutation
Services/Implementations/DatingJobGame/JobGameService.cs:41:17
         {
             throw new InvalidOperationException("UserId provided must be non-negative");
         }
-        else if(gameJob.JobId < 0)
+        else if(gameJob.JobId <= 0)
         {
             throw new InvalidOperationException("JobId provided must be non-negative");
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Negate expression
Services/Implementations/DatingJobGame/JobGameService.cs:41:17
         {
             throw new InvalidOperationException("UserId provided must be non-negative");
         }
-        else if(gameJob.JobId < 0)
+        else if(!(gameJob.JobId < 0))
         {
             throw new InvalidOperationException("JobId provided must be non-negative");
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobGameServiceTest.RejectJobHappy

[Survived] Statement mutation
Services/Implementations/DatingJobGame/JobGameService.cs:43:13
         }
         else if(gameJob.JobId < 0)
         {
-            throw new InvalidOperationException("JobId provided must be non-negative");
+            ;
         }
         User? user = userFinder.GetUser(gameJob.UserId);

[Survived] String mutation
Services/Implementations/DatingJobGame/JobGameService.cs:43:49
         }
         else if(gameJob.JobId < 0)
         {
-            throw new InvalidOperationException("JobId provided must be non-negative");
+            throw new InvalidOperationException("");
         }
         User? user = userFinder.GetUser(gameJob.UserId);

[Killed] Equality mutation
Services/Implementations/DatingJobGame/JobGameService.cs:47:13
         }
         User? user = userFinder.GetUser(gameJob.UserId);
         Job? job = jobFinder.GetJob(gameJob.JobId);
-        if (user is null || job is null)
+        if (user is not null || job is null)
         {
             throw new InvalidOperationException("UserId doesn't match an existing user");
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobGameServiceTest.RejectJobHappy

[Killed] Negate expression
Services/Implementations/DatingJobGame/JobGameService.cs:47:13
         }
         User? user = userFinder.GetUser(gameJob.UserId);
         Job? job = jobFinder.GetJob(gameJob.JobId);
-        if (user is null || job is null)
+        if (!(user is null || job is null))
         {
             throw new InvalidOperationException("UserId doesn't match an existing user");
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobGameServiceTest.RejectJobHappy; test.JobGameServiceTest.RejectJobNullJob

[Survived] String mutation
Services/Implementations/DatingJobGame/JobGameService.cs:49:49
         Job? job = jobFinder.GetJob(gameJob.JobId);
         if (user is null || job is null)
         {
-            throw new InvalidOperationException("UserId doesn't match an existing user");
+            throw new InvalidOperationException("");
         }
         return jobGameConnector.RejectJob(user, job);

[Killed] Equality mutation
Services/Implementations/DatingJobGame/JobGameService.cs:59:13
     /// Returns the next job in the game.
     public Job? AcceptJob(GameJob gameJob)
     {
-        if (gameJob.UserId < 0)
+        if (gameJob.UserId > 0)
         {
             throw new InvalidOperationException("UserId provided must be non-negative");
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceTest.AcceptJobHappy

[Killed] Equality mutation
Services/Implementations/DatingJobGame/JobGameService.cs:63:17
         {
             throw new InvalidOperationException("UserId provided must be non-negative");
         }
-        else if(gameJob.JobId < 0)
+        else if(gameJob.JobId > 0)
         {
             throw new InvalidOperationException("JobId provided must be non-negative");
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceTest.AcceptJobHappy

[Killed] Logical mutation
Services/Implementations/DatingJobGame/JobGameService.cs:69:13
         }
         User? user = userFinder.GetUser(gameJob.UserId);
         Job? job = jobFinder.GetJob(gameJob.JobId);
-        if (user is null || job is null)
+        if (user is null && job is null)
         {
             throw new InvalidOperationException("UserId doesn't match an existing user");
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest
