[Killed] Block removal mutation
Services/Implementations/DatingJobGame/ShuffleJobsService.cs:13:5
     private readonly IJobIndexManager jobIndexManager;
 
     public ShuffleJobsService(IJobService jobService)
-    {
-        jobIndexManager = new JobIndexManager(jobService);
-    }
+    {}
 
     /// Get a list of jobs. 
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/ShuffleJobsService.cs:26:13
         do
         {
             page = jobIndexManager.GetJobs();
-            allJobs.AddRange(page);
+            ;
         } while (page.Count == AppConfig.ITEMS_PER_PAGE);
 
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/ShuffleJobsService.cs:36:9
     /// <param name="filters">A dictionary of filter keys and values to apply when retrieving jobs.
     public void UpdateFilters(IReadOnlyDictionary<string, string>? filters)
     {
-        jobIndexManager.UpdateFilters(filters);
+        ;
     }
     
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Equality mutation
Services/Implementations/DatingJobGame/ShuffleJobsService.cs:45:25
     private List<Job> ShuffleJobs(List<Job> jobs)
     {
         int n = jobs.Count;
-        for (int i = 0; i < n; i++)
+        for (int i = 0; i <= n; i++)
         {
             int j = Random.Shared.Next(i, n);
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Services/Implementations/DatingJobGame/ShuffleJobsService.cs:45:32
     private List<Job> ShuffleJobs(List<Job> jobs)
     {
         int n = jobs.Count;
-        for (int i = 0; i < n; i++)
+        for (int i = 0; i < n; i--)
         {
             int j = Random.Shared.Next(i, n);
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Survived] Block removal mutation
Services/Implementations/DatingJobGame/ShuffleJobsService.cs:46:9
     {
         int n = jobs.Count;
         for (int i = 0; i < n; i++)
-        {
-            int j = Random.Shared.Next(i, n);
-            (jobs[j], jobs[i]) = (jobs[i], jobs[j]);
-        }
+        {}
         return jobs;
     }
