[Killed] Block removal mutation
Services/Implementations/DatingJobGame/ShuffleUsersService.cs:12:5
     private readonly IUserIndexManager userIndexManager;
 
     public ShuffleUsersService(IUserPersistence userPersistence)
-    {
-        userIndexManager = new UserIndexManager(userPersistence);
-    }
+    {}
 
     /// Get a list of users. 
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Block removal mutation
Services/Implementations/DatingJobGame/ShuffleUsersService.cs:19:5
     /// Get a list of users. 
     /// Returns a list of all users.
     public List<User> GetUsers()
-    {
-        return ShuffleUsers(userIndexManager.GetUsers());
-    }
+    {}
 
     /// Updates what the current user is. 
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/ShuffleUsersService.cs:27:9
     /// <param name="currentUserId">The id of the user to set as the current user.
     public void UpdateCurrentUser(int currentUserId)
     {
-        userIndexManager.UpdateCurrentUser(currentUserId);
+        ;
     }
     
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Equality mutation
Services/Implementations/DatingJobGame/ShuffleUsersService.cs:37:25
     {
         Random rand = new();
         int n = users.Count;
-        for (int i = 0; i < n; i++)
+        for (int i = 0; i <= n; i++)
         {
             int j = rand.Next(i, n);
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Services/Implementations/DatingJobGame/ShuffleUsersService.cs:37:32
     {
         Random rand = new();
         int n = users.Count;
-        for (int i = 0; i < n; i++)
+        for (int i = 0; i < n; i--)
         {
             int j = rand.Next(i, n);
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Block removal mutation
Services/Implementations/DatingJobGame/ShuffleUsersService.cs:38:9
         Random rand = new();
         int n = users.Count;
         for (int i = 0; i < n; i++)
-        {
-            int j = rand.Next(i, n);
-            (users[j], users[i]) = (users[i], users[j]);
-        }
+        {}
 
         return users;
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest
