[Killed] Statement mutation
Services/Implementations/DatingJobGame/UserGameConnector.cs:17:9
     public User? InitializeUserGame(User currentUser)
     {
         var indexManager = new ShuffleUsersService(userPersistence);
-        indexManager.UpdateCurrentUser(currentUser.UserId);
+        ;
         gameServiceList[currentUser.UserId] = new UserSwipeGameService(indexManager);
         return gameServiceList[currentUser.UserId].InitializeUserGame();
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/DatingJobGame/UserGameConnector.cs:28:13
     /// Returns the next user in the game.
     public User? RejectUser(User currentUser, User user)
     {
-        if (!gameServiceList.ContainsKey(currentUser.UserId))
+        if (gameServiceList.ContainsKey(currentUser.UserId))
         {
             throw new InvalidOperationException("UserId doesn't match an existing user game session");
killedBy: test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[NoCoverage] Statement mutation
Services/Implementations/DatingJobGame/UserGameConnector.cs:30:13
     {
         if (!gameServiceList.ContainsKey(currentUser.UserId))
         {
-            throw new InvalidOperationException("UserId doesn't match an existing user game session");
+            ;
         }
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/DatingJobGame/UserGameConnector.cs:48:13
         }
 
         //If we already saved it just dont save it again
-        if (!userPersistence.IsUserInFollows(currentUser.UserId, (int)user.UserId!))
+        if (userPersistence.IsUserInFollows(currentUser.UserId, (int)user.UserId!))
         {
             userPersistence.FollowUser(currentUser.UserId, (int)user.UserId);
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest

[Survived] Statement mutation
Services/Implementations/DatingJobGame/UserGameConnector.cs:50:13
         //If we already saved it just dont save it again
         if (!userPersistence.IsUserInFollows(currentUser.UserId, (int)user.UserId!))
         {
-            userPersistence.FollowUser(currentUser.UserId, (int)user.UserId);
+            ;
         }
 

[NoCoverage] String mutation
Services/Implementations/DatingJobGame/UserGameConnector.cs:63:49
     {
         if (!gameServiceList.ContainsKey(currentUser.UserId))
         {
-            throw new InvalidOperationException("UserId doesn't match an existing user game session");
+            throw new InvalidOperationException("");
         }
 
