[Killed] Equality mutation
Services/Implementations/DatingJobGame/UserGameService.cs:19:13
     /// Returns a random user profile to start the game.
     public Profile? InitializeUserGame(CurrentUser currentUser)
     {
-        if (currentUser is null)
+        if (currentUser is not null)
         {
             throw new InvalidOperationException("No UserId provided");
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[NoCoverage] Statement mutation
Services/Implementations/DatingJobGame/UserGameService.cs:21:13
     {
         if (currentUser is null)
         {
-            throw new InvalidOperationException("No UserId provided");
+            ;
         }
 

[Killed] Equality mutation
Services/Implementations/DatingJobGame/UserGameService.cs:40:13
     /// Returns the next user profile in the game.
     public Profile? RejectUser(CurrentUser currentUser, string username)
     {
-        if (currentUser is null || string.IsNullOrWhiteSpace(username))
+        if (currentUser is not null || string.IsNullOrWhiteSpace(username))
         {
             throw new InvalidOperationException("Invalid format for current user id and username provided");
killedBy: test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Negate expression
Services/Implementations/DatingJobGame/UserGameService.cs:40:13
     /// Returns the next user profile in the game.
     public Profile? RejectUser(CurrentUser currentUser, string username)
     {
-        if (currentUser is null || string.IsNullOrWhiteSpace(username))
+        if (!(currentUser is null || string.IsNullOrWhiteSpace(username)))
         {
             throw new InvalidOperationException("Invalid format for current user id and username provided");
killedBy: test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[NoCoverage] Statement mutation
Services/Implementations/DatingJobGame/UserGameService.cs:42:13
     {
         if (currentUser is null || string.IsNullOrWhiteSpace(username))
         {
-            throw new InvalidOperationException("Invalid format for current user id and username provided");
+            ;
         }
 

[NoCoverage] String mutation
Services/Implementations/DatingJobGame/UserGameService.cs:42:49
     {
         if (currentUser is null || string.IsNullOrWhiteSpace(username))
         {
-            throw new InvalidOperationException("Invalid format for current user id and username provided");
+            throw new InvalidOperationException("");
         }
 

[Killed] Equality mutation
Services/Implementations/DatingJobGame/UserGameService.cs:47:34
 
         User? actorUser = userFinder.GetUser(currentUser.UserId);
         User? targetUser = userFinder.GetUserByUsername(username);
-        if (actorUser is null || targetUser is null)
+        if (actorUser is null || targetUser is not null)
         {
             throw new InvalidOperationException("UserId or username doesn't match an existing user");
killedBy: test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Equality mutation
Services/Implementations/DatingJobGame/UserGameService.cs:47:13
 
         User? actorUser = userFinder.GetUser(currentUser.UserId);
         User? targetUser = userFinder.GetUserByUsername(username);
-        if (actorUser is null || targetUser is null)
+        if (actorUser is not null || targetUser is null)
         {
             throw new InvalidOperationException("UserId or username doesn't match an existing user");
killedBy: test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[NoCoverage] Statement mutation
Services/Implementations/DatingJobGame/UserGameService.cs:49:13
         User? targetUser = userFinder.GetUserByUsername(username);
         if (actorUser is null || targetUser is null)
         {
-            throw new InvalidOperationException("UserId or username doesn't match an existing user");
+            ;
         }
 

[NoCoverage] String mutation
Services/Implementations/DatingJobGame/UserGameService.cs:49:49
         User? targetUser = userFinder.GetUserByUsername(username);
         if (actorUser is null || targetUser is null)
         {
-            throw new InvalidOperationException("UserId or username doesn't match an existing user");
+            throw new InvalidOperationException("");
         }
 

[Killed] Equality mutation
Services/Implementations/DatingJobGame/UserGameService.cs:99:13
 
     private static Profile? MapProfile(User? user)
     {
-        if (user is null)
+        if (user is not null)
         {
             return null;
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Block removal mutation
Services/Implementations/DatingJobGame/UserGameService.cs:100:9
     private static Profile? MapProfile(User? user)
     {
         if (user is null)
-        {
-            return null;
-        }
+        {}
 
         return new Profile(user.UserId, user.Username, user.Email, user.FirstName, user.LastName, user.About, user.Experiences, user.IsEmployer, user.EmployerName);
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest
