[NoCoverage] Block removal mutation
Services/Implementations/DatingJobGame/UserGameSingleton.cs:12:5
     private IUserGameService? userGameService;
 
     public UserGameSingleton(IServiceScopeFactory scopeFactory)
-    {
-        using var scope = scopeFactory.CreateScope();
-        var userPersistence = scope.ServiceProvider.GetRequiredService<IUserPersistence>();
-        userGameService = new UserGameService(userPersistence);
-    }
+    {}
 
     /// Initialize a user list for the game.

[NoCoverage] Statement mutation
Services/Implementations/DatingJobGame/UserGameSingleton.cs:23:38
     /// Returns a random user profile to start the game.
     public Profile? InitializeUserGame(CurrentUser currentUser)
     {
-        if (userGameService == null) throw new InvalidOperationException("Service not initialized.");
+        if (userGameService == null) ;
         return userGameService.InitializeUserGame(currentUser);
     }

[NoCoverage] Equality mutation
Services/Implementations/DatingJobGame/UserGameSingleton.cs:23:13
     /// Returns a random user profile to start the game.
     public Profile? InitializeUserGame(CurrentUser currentUser)
     {
-        if (userGameService == null) throw new InvalidOperationException("Service not initialized.");
+        if (userGameService != null) throw new InvalidOperationException("Service not initialized.");
         return userGameService.InitializeUserGame(currentUser);
     }

[NoCoverage] Statement mutation
Services/Implementations/DatingJobGame/UserGameSingleton.cs:33:38
     /// Returns the next user profile in the game.
     public Profile? RejectUser(CurrentUser currentUser, string username)
     {
-        if (userGameService == null) throw new InvalidOperationException("Game not initialized.");
+        if (userGameService == null) ;
         return userGameService.RejectUser(currentUser, username);
     }

[NoCoverage] Equality mutation
Services/Implementations/DatingJobGame/UserGameSingleton.cs:33:13
     /// Returns the next user profile in the game.
     public Profile? RejectUser(CurrentUser currentUser, string username)
     {
-        if (userGameService == null) throw new InvalidOperationException("Game not initialized.");
+        if (userGameService != null) throw new InvalidOperationException("Game not initialized.");
         return userGameService.RejectUser(currentUser, username);
     }
