[Killed] Boolean mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:10:38
 {
     private int userAccepted = 0;
     private int userRejected = 0;
-    private bool isGameInitialized = false;
+    private bool isGameInitialized = true;
     private bool hasActiveUser = false;
     private List<User> allUsers = [];
killedBy: test.GameUserServiceTest.AcceptBeforeInitializationTest; test.GameUserServiceTest.RejectBeforeInitializationTest

[Timeout] Boolean mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:11:34
     private int userAccepted = 0;
     private int userRejected = 0;
     private bool isGameInitialized = false;
-    private bool hasActiveUser = false;
+    private bool hasActiveUser = true;
     private List<User> allUsers = [];
 

[Killed] Negate expression
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:20:13
     /// Returns the next user to display. 
     private User? GetGameUser(bool initialize = false, bool? isAccepted = null)
     {
-        if (!initialize && isAccepted.HasValue && hasActiveUser)
+        if (!(!initialize && isAccepted.HasValue && hasActiveUser))
         {
             if (isAccepted.Value)
killedBy: test.GameUserServiceTest.AcceptEmptyTest; test.GameUserServiceTest.AcceptOneGameStatTest; test.GameUserServiceTest.AcceptOneTest

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:20:13
     /// Returns the next user to display. 
     private User? GetGameUser(bool initialize = false, bool? isAccepted = null)
     {
-        if (!initialize && isAccepted.HasValue && hasActiveUser)
+        if (initialize && isAccepted.HasValue && hasActiveUser)
         {
             if (isAccepted.Value)
killedBy: test.GameUserServiceTest.AcceptOneGameStatTest; test.GameUserServiceTest.GetMultipleAcceptGameStatsTest; test.GameUserServiceTest.GetMultipleFailGameStatsTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:24:17
         {
             if (isAccepted.Value)
             {
-                userAccepted++;
+                ;
             }
             else
killedBy: test.GameUserServiceTest.AcceptOneGameStatTest; test.GameUserServiceTest.GetMultipleAcceptGameStatsTest; test.GameUserServiceTest.GetMultipleMixGameStatsTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:24:17
         {
             if (isAccepted.Value)
             {
-                userAccepted++;
+                userAccepted--;
             }
             else
killedBy: test.GameUserServiceTest.AcceptOneGameStatTest; test.GameUserServiceTest.GetMultipleAcceptGameStatsTest; test.GameUserServiceTest.GetMultipleMixGameStatsTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:28:17
             }
             else
             {
-                userRejected++;
+                userRejected--;
             }
 
killedBy: test.GameUserServiceTest.GetMultipleFailGameStatsTest; test.GameUserServiceTest.GetMultipleMixGameStatsTest; test.GameUserServiceTest.RejectOneGameStatTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:28:17
             }
             else
             {
-                userRejected++;
+                ;
             }
 
killedBy: test.GameUserServiceTest.GetMultipleFailGameStatsTest; test.GameUserServiceTest.GetMultipleMixGameStatsTest; test.GameUserServiceTest.RejectOneGameStatTest

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:31:29
                 userRejected++;
             }
 
-            hasActiveUser = false;
+            hasActiveUser = true;
         }
 
killedBy: test.GameUserServiceTest.SpamAcceptGameStatsTest; test.GameUserServiceTest.SpamMixGameStatsTest; test.GameUserServiceTest.SpamRejectGameStatsTest

[Killed] Block removal mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:35:9
         }
 
         if (allUsers.Count == 0)
-        {
-            allUsers = userIndexManager.GetUsers();
-        }
+        {}
 
         if (allUsers.Count == 0)
killedBy: test.GameUserServiceTest.AcceptOneGameStatTest; test.GameUserServiceTest.AcceptOneTest; test.GameUserServiceTest.FetchJobsAgainTest

[Killed] Block removal mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:40:9
         }
 
         if (allUsers.Count == 0)
-        {
-            return null;
-        }
+        {}
 
         User user = allUsers[0];
killedBy: test.GameUserServiceTest.AcceptEmptyTest; test.GameUserServiceTest.AcceptOneGameStatTest; test.GameUserServiceTest.AcceptOneTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:45:9
         }
 
         User user = allUsers[0];
-        allUsers.RemoveAt(0);
+        ;
         hasActiveUser = true;
 
killedBy: test.GameUserServiceTest.AcceptOneTest; test.GameUserServiceTest.FetchJobsAgainTest; test.GameUserServiceTest.GetMultipleJobTest

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:46:25
 
         User user = allUsers[0];
         allUsers.RemoveAt(0);
-        hasActiveUser = true;
+        hasActiveUser = false;
 
         return user;
killedBy: test.GameUserServiceTest.AcceptOneGameStatTest; test.GameUserServiceTest.GetMultipleAcceptGameStatsTest; test.GameUserServiceTest.GetMultipleFailGameStatsTest

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:57:29
     {
         userAccepted = 0;
         userRejected = 0;
-        isGameInitialized = true;
+        isGameInitialized = false;
         hasActiveUser = false;
         allUsers.Clear();
killedBy: test.GameUserServiceTest.AcceptEmptyTest; test.GameUserServiceTest.AcceptOneGameStatTest; test.GameUserServiceTest.AcceptOneTest

[Timeout] Boolean mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:58:25
         userAccepted = 0;
         userRejected = 0;
         isGameInitialized = true;
-        hasActiveUser = false;
+        hasActiveUser = true;
         allUsers.Clear();
 

[Killed] Statement mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:59:9
         userRejected = 0;
         isGameInitialized = true;
         hasActiveUser = false;
-        allUsers.Clear();
+        ;
 
         return GetGameUser(initialize: true);
killedBy: test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:61:40
         hasActiveUser = false;
         allUsers.Clear();
 
-        return GetGameUser(initialize: true);
+        return GetGameUser(initialize: false);
     }
 
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:70:13
     {
         if (!isGameInitialized)
         {
-            throw new InvalidOperationException("Game not initialized. Please call InitializeUserGame() before rejecting users.");
+            ;
         }
 
killedBy: test.GameUserServiceTest.RejectBeforeInitializationTest

[Survived] String mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:70:49
     {
         if (!isGameInitialized)
         {
-            throw new InvalidOperationException("Game not initialized. Please call InitializeUserGame() before rejecting users.");
+            throw new InvalidOperationException("");
         }
 

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:73:40
             throw new InvalidOperationException("Game not initialized. Please call InitializeUserGame() before rejecting users.");
         }
 
-        return GetGameUser(isAccepted: false);
+        return GetGameUser(isAccepted: true);
     }
 
killedBy: test.GameUserServiceTest.GetMultipleFailGameStatsTest; test.GameUserServiceTest.GetMultipleMixGameStatsTest; test.GameUserServiceTest.RejectOneGameStatTest

[Killed] Statement mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:83:13
     {
         if (!isGameInitialized)
         {
-            throw new InvalidOperationException("Game not initialized. Please call InitializeUserGame() before accepting users.");
+            ;
         }
 
killedBy: test.GameUserServiceTest.AcceptBeforeInitializationTest

[Killed] Boolean mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:86:40
             throw new InvalidOperationException("Game not initialized. Please call InitializeUserGame() before accepting users.");
         }
 
-        return GetGameUser(isAccepted: true);
+        return GetGameUser(isAccepted: false);
     }
 
killedBy: test.GameUserServiceTest.AcceptOneGameStatTest; test.GameUserServiceTest.GetMultipleAcceptGameStatsTest; test.GameUserServiceTest.GetMultipleMixGameStatsTest

[NoCoverage] Statement mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:95:13
     {
         if (!isGameInitialized)
         {
-            throw new InvalidOperationException("Game not initialized. Please call InitializeUserGame() before getting game stats.");
+            ;
         }
 

[NoCoverage] String mutation
Services/Implementations/DatingJobGame/UserSwipeGameService.cs:95:49
     {
         if (!isGameInitialized)
         {
-            throw new InvalidOperationException("Game not initialized. Please call InitializeUserGame() before getting game stats.");
+            throw new InvalidOperationException("");
         }
 
