[NoCoverage] Null coalescing mutation (remove right)
src/Services/Implementations/EmailService.cs:8:43
 
 public class EmailService(IResend resend, IConfiguration config) : IEmailService
 {
-    private readonly string fromAddress = config["EMAIL_FROM"]
-        ?? throw new InvalidOperationException("EMAIL_FROM environment variable is required");
+    private readonly string fromAddress = config["EMAIL_FROM"];
 
     private readonly string appUrl = config["APP_URL"]

[NoCoverage] Null coalescing mutation (remove right)
src/Services/Implementations/EmailService.cs:11:38
     private readonly string fromAddress = config["EMAIL_FROM"]
         ?? throw new InvalidOperationException("EMAIL_FROM environment variable is required");
 
-    private readonly string appUrl = config["APP_URL"]
-        ?? throw new InvalidOperationException("APP_URL environment variable is required");
+    private readonly string appUrl = config["APP_URL"];
 
     public async Task SendVerificationEmailAsync(string toEmail, string token)

[NoCoverage] String mutation
src/Services/Implementations/EmailService.cs:12:48
         ?? throw new InvalidOperationException("EMAIL_FROM environment variable is required");
 
     private readonly string appUrl = config["APP_URL"]
-        ?? throw new InvalidOperationException("APP_URL environment variable is required");
+        ?? throw new InvalidOperationException("");
 
     public async Task SendVerificationEmailAsync(string toEmail, string token)

[NoCoverage] String mutation
src/Services/Implementations/EmailService.cs:16:32
 
     public async Task SendVerificationEmailAsync(string toEmail, string token)
     {
-        var verificationLink = $"{appUrl}/verify?token={token}";
+        var verificationLink = $"";
 
         var message = new EmailMessage

[NoCoverage] Object initializer mutation
src/Services/Implementations/EmailService.cs:18:23
     {
         var verificationLink = $"{appUrl}/verify?token={token}";
 
-        var message = new EmailMessage
-        {
-            From = fromAddress
-        };
+        var message = new EmailMessage
+{};
         message.To.Add(toEmail);
         message.Subject = "Verify your GetEmployed account";

[NoCoverage] Statement mutation
src/Services/Implementations/EmailService.cs:22:9
         {
             From = fromAddress
         };
-        message.To.Add(toEmail);
+        ;
         message.Subject = "Verify your GetEmployed account";
         message.HtmlBody = $"""

[NoCoverage] String mutation
src/Services/Implementations/EmailService.cs:23:27
             From = fromAddress
         };
         message.To.Add(toEmail);
-        message.Subject = "Verify your GetEmployed account";
+        message.Subject = "";
         message.HtmlBody = $"""
             <div style="font-family: sans-serif; max-width: 480px; margin: 0 auto;">

[NoCoverage] Statement mutation
src/Services/Implementations/EmailService.cs:39:9
             </div>
             """;
 
-        await resend.EmailSendAsync(message);
+        ;
     }
 

[NoCoverage] Statement mutation
src/Services/Implementations/EmailService.cs:49:13
         var tasks = followerEmails.Select(email =>
         {
             var message = new EmailMessage { From = fromAddress };
-            message.To.Add(email);
+            ;
             message.Subject = $"New job posting from {posterName}";
             message.HtmlBody = $"""

[NoCoverage] Statement mutation
src/Services/Implementations/EmailService.cs:65:9
             return resend.EmailSendAsync(message);
         });
 
-        await Task.WhenAll(tasks);
+        ;
     }
 

[NoCoverage] Statement mutation
src/Services/Implementations/EmailService.cs:73:9
         var profileLink = $"{appUrl}/profile/{profileUsername}";
 
         var message = new EmailMessage { From = fromAddress };
-        message.To.Add(toEmail);
+        ;
         message.Subject = $"{posterUsername} commented on your profile";
         message.HtmlBody = $"""
