[Killed] Block removal mutation
Services/Implementations/Finders/JobFinder.cs:12:5
     /// <param name="jobId">An id for a job.
     /// Returns the job corresponding to the jobId. 
     public Job? GetJob(int jobId)
-    {
-        return jobPersistence.GetJobFromJobId(jobId);
-    }
+    {}
 }
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest
