[Killed] Block removal mutation
Services/Implementations/Finders/UserFinder.cs:12:5
     /// <param name="userId">An id for a user.
     /// Returns the user corresponding to the userId. 
     public User? GetUser(int userId)
-    {
-        return userPersistence.GetUser(userId);
-    }
+    {}
 
     /// Retrieves a user based on a username, if there is one.
killedBy: QuizGameServiceTest.UserDoesExistTest; test.JobAddServiceIntegrationTest.AddNewJobIntegrationTest

[Killed] Block removal mutation
Services/Implementations/Finders/UserFinder.cs:20:5
     /// <param name="username">An username for a user.
     /// Returns the user corresponding to the username. 
     public User? GetUserByUsername(string username)
-    {
-        return userPersistence.GetUserByUsername(username);
-    }
+    {}
 }
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest
