[Killed] Equality mutation
Services/Implementations/Following/FollowService.cs:17:13
     {
 
         User? userToFollow = userPersistence.GetUserByUsername(usernameToFollow);
-        if (userToFollow == null)
+        if (userToFollow != null)
         {
             throw new InvalidOperationException("User to follow not found");
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[NoCoverage] Statement mutation
Services/Implementations/Following/FollowService.cs:19:13
         User? userToFollow = userPersistence.GetUserByUsername(usernameToFollow);
         if (userToFollow == null)
         {
-            throw new InvalidOperationException("User to follow not found");
+            ;
         } 
         else

[Killed] Statement mutation
Services/Implementations/Following/FollowService.cs:23:13
         } 
         else
         {
-            userPersistence.FollowUser(userId, userToFollow.UserId);
+            ;
         }
     }
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[NoCoverage] Equality mutation
Services/Implementations/Following/FollowService.cs:33:13
     public void UnfollowUser(int userId, string usernameToUnfollow)
     {
         User? userToUnfollow = userPersistence.GetUserByUsername(usernameToUnfollow);
-        if (userToUnfollow == null)
+        if (userToUnfollow != null)
         {
             throw new InvalidOperationException("User to unfollow not found");

[NoCoverage] Statement mutation
Services/Implementations/Following/FollowService.cs:35:13
         User? userToUnfollow = userPersistence.GetUserByUsername(usernameToUnfollow);
         if (userToUnfollow == null)
         {
-            throw new InvalidOperationException("User to unfollow not found");
+            ;
         }
         else

[NoCoverage] Statement mutation
Services/Implementations/Following/FollowService.cs:39:13
         }
         else
         {
-            userPersistence.UnfollowUser(userId, userToUnfollow.UserId);
+            ;
         }
     }

[Killed] Equality mutation
Services/Implementations/Following/FollowService.cs:50:13
     public bool IsFollowing(int userId, string username)
     {
         User? user = userPersistence.GetUserByUsername(username);
-        if (user == null) return false;
+        if (user != null) return false;
         return userPersistence.IsUserInFollows(userId, user.UserId);
     }
killedBy: test.FollowingServiceIntegrationTest.FollowUserIntegrationTest

[NoCoverage] Boolean mutation
Services/Implementations/Following/FollowService.cs:50:34
     public bool IsFollowing(int userId, string username)
     {
         User? user = userPersistence.GetUserByUsername(username);
-        if (user == null) return false;
+        if (user == null) return true;
         return userPersistence.IsUserInFollows(userId, user.UserId);
     }
