[Killed] Equality mutation
Services/Implementations/GenericWords/GenericWordsService.cs:18:25
         var words = Paragraph.Split(' ', StringSplitOptions.RemoveEmptyEntries);
         char[] punctuationToTrim = ['.', ',', '!', '?', ';', ':', '(', ')', '[', ']', '{', '}', '"', '\'', '“', '”'];
         
-        for (int i = 0; i < words.Length; i++)
+        for (int i = 0; i <= words.Length; i++)
         {
             string cleanWord = words[i].Trim(punctuationToTrim);
killedBy: test.GenericWordIntegrationTest.FollowUserIntegrationTest; Tests.GenericWordsServiceTest.TestCaseInsensitive; Tests.GenericWordsServiceTest.TestEmptyInput

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Services/Implementations/GenericWords/GenericWordsService.cs:18:43
         var words = Paragraph.Split(' ', StringSplitOptions.RemoveEmptyEntries);
         char[] punctuationToTrim = ['.', ',', '!', '?', ';', ':', '(', ')', '[', ']', '{', '}', '"', '\'', '“', '”'];
         
-        for (int i = 0; i < words.Length; i++)
+        for (int i = 0; i < words.Length; i--)
         {
             string cleanWord = words[i].Trim(punctuationToTrim);
killedBy: test.GenericWordIntegrationTest.FollowUserIntegrationTest

[Killed] Negate expression
Services/Implementations/GenericWords/GenericWordsService.cs:21:17
         for (int i = 0; i < words.Length; i++)
         {
             string cleanWord = words[i].Trim(punctuationToTrim);
-            if (genericWords.Contains(cleanWord))
+            if (!(genericWords.Contains(cleanWord)))
             {
                 positions.Add(i);
killedBy: test.GenericWordIntegrationTest.FollowUserIntegrationTest; Tests.GenericWordsServiceTest.TestCaseInsensitive; Tests.GenericWordsServiceTest.TestGenericWordsAtEnd

[Killed] Statement mutation
Services/Implementations/GenericWords/GenericWordsService.cs:23:17
             string cleanWord = words[i].Trim(punctuationToTrim);
             if (genericWords.Contains(cleanWord))
             {
-                positions.Add(i);
+                ;
             }
         }
killedBy: Tests.GenericWordsServiceTest.TestCaseInsensitive; Tests.GenericWordsServiceTest.TestGenericWordsAtEnd; Tests.GenericWordsServiceTest.TestGenericWordsAtStart
