[Timeout] Statement mutation
Services/Implementations/IndexManagers/JobIndexManager.cs:20:9
     /// Returns a list of all jobs using existing filtration.
     public List<Job> GetJobs()
     {
-        allJobs.Clear();
+        ;
         filtersDictionary[AppConfig.FilterKeys.PAGE_NUMBER] = currentPage.ToString();
         allJobs.AddRange(jobService.GetJobs(filtersDictionary).ToList());

[Killed] Statement mutation
Services/Implementations/IndexManagers/JobIndexManager.cs:22:9
     {
         allJobs.Clear();
         filtersDictionary[AppConfig.FilterKeys.PAGE_NUMBER] = currentPage.ToString();
-        allJobs.AddRange(jobService.GetJobs(filtersDictionary).ToList());
+        ;
         currentPage += 1;
         return allJobs;
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Services/Implementations/IndexManagers/JobIndexManager.cs:23:9
         allJobs.Clear();
         filtersDictionary[AppConfig.FilterKeys.PAGE_NUMBER] = currentPage.ToString();
         allJobs.AddRange(jobService.GetJobs(filtersDictionary).ToList());
-        currentPage += 1;
+        currentPage -= 1;
         return allJobs;
     }
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Null coalescing mutation (remove left)
Services/Implementations/IndexManagers/JobIndexManager.cs:32:29
     public void UpdateFilters(IReadOnlyDictionary<string, string>? filters)
     {
         currentPage = 1;
-        filtersDictionary = filters?.ToDictionary(k => k.Key, v => v.Value) ?? [];
+        filtersDictionary = [];
     }
 }
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest

[Killed] Null coalescing mutation (remove right)
Services/Implementations/IndexManagers/JobIndexManager.cs:32:29
     public void UpdateFilters(IReadOnlyDictionary<string, string>? filters)
     {
         currentPage = 1;
-        filtersDictionary = filters?.ToDictionary(k => k.Key, v => v.Value) ?? [];
+        filtersDictionary = filters?.ToDictionary(k => k.Key, v => v.Value);
     }
 }
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest
