[Killed] Arithmetic mutation
Services/Implementations/IndexManagers/UserIndexManager.cs:19:14
     {
         List<User> users = userPersistence.GetUsersForGame(
             currentUserId,
-            (currentPage - 1) * AppConfig.ITEMS_PER_PAGE,
+            (currentPage + 1) * AppConfig.ITEMS_PER_PAGE,
             AppConfig.ITEMS_PER_PAGE
         );
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Arithmetic mutation
Services/Implementations/IndexManagers/UserIndexManager.cs:19:13
     {
         List<User> users = userPersistence.GetUsersForGame(
             currentUserId,
-            (currentPage - 1) * AppConfig.ITEMS_PER_PAGE,
+            (currentPage - 1) / AppConfig.ITEMS_PER_PAGE,
             AppConfig.ITEMS_PER_PAGE
         );
killedBy: test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Services/Implementations/IndexManagers/UserIndexManager.cs:23:9
             AppConfig.ITEMS_PER_PAGE
         );
 
-        currentPage += 1;
+        currentPage -= 1;
 
         return users;
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest

[Killed] Block removal mutation
Services/Implementations/IndexManagers/UserIndexManager.cs:31:5
     /// Updates what the current user is. 
     /// <param name="currentUserId">The id of the user to set as the current user.
     public void UpdateCurrentUser(int currentUserId)
-    {
-        this.currentUserId = currentUserId;
-    }
+    {}
 }
 
killedBy: test.UserGameServiceIntegrationTest.AcceptUserIntegrationTest; test.UserGameServiceIntegrationTest.RejectUserIntegrationTest
