[Killed] Block removal mutation
src/Services/Implementations/JobService.cs:18:5
     /// - "EmploymentTypes": A comma-separated list of types of contract to filter by (e.g., "full-time", "part-time").
     /// If null or empty, no filters will be applied and all jobs will be returned.
     public IReadOnlyList<Job> GetJobs(IReadOnlyDictionary<string, string>? filters = null)
-    {
-        var (_, searchTerm, languages, positions, employments, startIndex) = ParseFilters(filters);
-    
-        return jobPersistence.GetJobs(searchTerm, languages, positions, employments, startIndex, AppConfig.ITEMS_PER_PAGE);
-    }
+    {}
 
     /// Get a list of all saved jobs for a user within a list of jobs.
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[NoCoverage] Block removal mutation
src/Services/Implementations/JobService.cs:32:5
     /// - "EmploymentTypes": A comma-separated list of types of contract to filter by (e.g., "full-time", "part-time").
     /// If null or empty, no filters will be applied and all jobs will be returned.
     public IReadOnlyList<Job> GetJobsSavedSublist(IReadOnlyDictionary<string, string>? filters = null)
-    {
-        var (UserId, searchTerm, languages, positions, employments, startIndex) = ParseFilters(filters);
-        var jobs = jobPersistence.GetJobs(searchTerm, languages, positions, employments, startIndex, AppConfig.ITEMS_PER_PAGE);
-        return jobPersistence.GetJobsSavedSublist(jobs, UserId);
-    }
+    {}
 
     /// Get a list of saved jobs for a user.

[Killed] Block removal mutation
src/Services/Implementations/JobService.cs:47:5
     /// - "EmploymentTypes": A comma-separated list of types of contract to filter by (e.g., "full-time", "part-time").
     /// If null or missing "UserId", no saved jobs will be returned. Other filters are optional and will be applied if provided.
     public IReadOnlyList<Job> GetSavedJobs(IReadOnlyDictionary<string, string>? filters = null)
-    {
-        var (UserId, searchTerm, languages, positions, employments, startIndex) = ParseFilters(filters);
-        
-        return jobPersistence.GetSavedJobs(UserId, searchTerm, languages, positions, employments, startIndex, AppConfig.ITEMS_PER_PAGE);
-    }
+    {}
 
     /// Get a count of jobs.
killedBy: test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest

[NoCoverage] Block removal mutation
src/Services/Implementations/JobService.cs:61:5
     /// - "EmploymentTypes": A comma-separated list of types of contract to filter by (e.g., "full-time", "part-time").
     /// If null or empty, no filters will be applied and the total number of jobs will be returned.
     public int GetNumberOfJobs(IReadOnlyDictionary<string, string>? filters = null)
-    {
-        var (_, searchTerm, languages, positions, employments, _) = ParseFilters(filters);
-    
-        return jobPersistence.GetNumberOfJobs(searchTerm, languages, positions, employments);
-    }
+    {}
 
     /// Get a count of saved jobs.

[NoCoverage] Block removal mutation
src/Services/Implementations/JobService.cs:76:5
     /// - "EmploymentTypes": A comma-separated list of types of contract to filter by (e.g., "full-time", "part-time").
     /// If null or missing "UserId", the count will be zero. Other filters are optional and will be applied if provided.
     public int GetNumberOfSavedJobs(IReadOnlyDictionary<string, string>? filters = null)
-    {
-        var (UserId, searchTerm, languages, positions, employments, _) = ParseFilters(filters);
-        
-        return jobPersistence.GetNumberOfSavedJobs(UserId, searchTerm, languages, positions, employments);
-    }
+    {}
 
     /// Extract individual elements from filters.

[Killed] Equality mutation
src/Services/Implementations/JobService.cs:92:13
     /// - "startIndex": The index of the record in the Jobs table to start returning entities.
     private static (int userId, string searchTerm, List<string> languages, List<string> positions, List<string> employments, int startIndex) ParseFilters(IReadOnlyDictionary<string, string>? filters)
     {
-        if (filters == null)
+        if (filters != null)
         {
             return (0, string.Empty, [], [], [], 0);
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Killed] Null coalescing mutation (remove right)
src/Services/Implementations/JobService.cs:100:13
         return (
             int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.USERID), out var id) ? id : 0,
             filters.GetValueOrDefault(AppConfig.FilterKeys.SEARCH_TERM, string.Empty),
-            filters.GetValueOrDefault(AppConfig.FilterKeys.LANGUAGES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
+            filters.GetValueOrDefault(AppConfig.FilterKeys.LANGUAGES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList(),
             filters.GetValueOrDefault(AppConfig.FilterKeys.POSITION_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
             filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYMENT_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Killed] Null coalescing mutation (remove left)
src/Services/Implementations/JobService.cs:100:13
         return (
             int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.USERID), out var id) ? id : 0,
             filters.GetValueOrDefault(AppConfig.FilterKeys.SEARCH_TERM, string.Empty),
-            filters.GetValueOrDefault(AppConfig.FilterKeys.LANGUAGES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
+            [],
             filters.GetValueOrDefault(AppConfig.FilterKeys.POSITION_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
             filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYMENT_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Null coalescing mutation (remove right)
src/Services/Implementations/JobService.cs:101:13
             int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.USERID), out var id) ? id : 0,
             filters.GetValueOrDefault(AppConfig.FilterKeys.SEARCH_TERM, string.Empty),
             filters.GetValueOrDefault(AppConfig.FilterKeys.LANGUAGES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
-            filters.GetValueOrDefault(AppConfig.FilterKeys.POSITION_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
+            filters.GetValueOrDefault(AppConfig.FilterKeys.POSITION_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList(),
             filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYMENT_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
             int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pageNumber) ? ((pageNumber-1) * AppConfig.ITEMS_PER_PAGE) : 0
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Killed] Null coalescing mutation (remove left)
src/Services/Implementations/JobService.cs:101:13
             int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.USERID), out var id) ? id : 0,
             filters.GetValueOrDefault(AppConfig.FilterKeys.SEARCH_TERM, string.Empty),
             filters.GetValueOrDefault(AppConfig.FilterKeys.LANGUAGES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
-            filters.GetValueOrDefault(AppConfig.FilterKeys.POSITION_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
+            [],
             filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYMENT_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
             int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pageNumber) ? ((pageNumber-1) * AppConfig.ITEMS_PER_PAGE) : 0
killedBy: test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Null coalescing mutation (remove right)
src/Services/Implementations/JobService.cs:102:13
             filters.GetValueOrDefault(AppConfig.FilterKeys.SEARCH_TERM, string.Empty),
             filters.GetValueOrDefault(AppConfig.FilterKeys.LANGUAGES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
             filters.GetValueOrDefault(AppConfig.FilterKeys.POSITION_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
-            filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYMENT_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
+            filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYMENT_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList(),
             int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pageNumber) ? ((pageNumber-1) * AppConfig.ITEMS_PER_PAGE) : 0
         );
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Killed] Null coalescing mutation (remove left)
src/Services/Implementations/JobService.cs:102:13
             filters.GetValueOrDefault(AppConfig.FilterKeys.SEARCH_TERM, string.Empty),
             filters.GetValueOrDefault(AppConfig.FilterKeys.LANGUAGES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
             filters.GetValueOrDefault(AppConfig.FilterKeys.POSITION_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
-            filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYMENT_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
+            [],
             int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pageNumber) ? ((pageNumber-1) * AppConfig.ITEMS_PER_PAGE) : 0
         );
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest; test.JobServiceIntegrationTest.GetJobsIntegrationTest

[Killed] Arithmetic mutation
src/Services/Implementations/JobService.cs:103:111
             filters.GetValueOrDefault(AppConfig.FilterKeys.LANGUAGES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
             filters.GetValueOrDefault(AppConfig.FilterKeys.POSITION_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
             filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYMENT_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
-            int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pageNumber) ? ((pageNumber-1) * AppConfig.ITEMS_PER_PAGE) : 0
+            int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pageNumber) ? ((pageNumber+1) * AppConfig.ITEMS_PER_PAGE) : 0
         );
     }
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Arithmetic mutation
src/Services/Implementations/JobService.cs:103:110
             filters.GetValueOrDefault(AppConfig.FilterKeys.LANGUAGES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
             filters.GetValueOrDefault(AppConfig.FilterKeys.POSITION_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
             filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYMENT_TYPES)?.Split(',', StringSplitOptions.RemoveEmptyEntries).ToList() ?? [],
-            int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pageNumber) ? ((pageNumber-1) * AppConfig.ITEMS_PER_PAGE) : 0
+            int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pageNumber) ? ((pageNumber-1) / AppConfig.ITEMS_PER_PAGE) : 0
         );
     }
killedBy: test.JobGameServiceIntegrationTest.AcceptJobIntegrationTest; test.JobGameServiceIntegrationTest.RejectJobIntegrationTest

[NoCoverage] Block removal mutation
src/Services/Implementations/JobService.cs:109:5
 
     /// Get a list of all programming languages used in jobs.
     public List<string> GetProgrammingLanguages()
-    {
-        return jobPersistence.GetProgrammingLanguages();
-    }
+    {}
 
     /// Delete a job a user has added.

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Services/Implementations/JobService.cs:119:13
     /// If the job was not added by the user, the deletion will fail.
     public void DeleteJob(int userId, int jobId)
     {
-        if (!jobPersistence.IsJobOwner(userId, jobId))
+        if (jobPersistence.IsJobOwner(userId, jobId))
             throw new UnauthorizedAccessException("Job does not belong to this user.");
 

[NoCoverage] Statement mutation
src/Services/Implementations/JobService.cs:120:13
     public void DeleteJob(int userId, int jobId)
     {
         if (!jobPersistence.IsJobOwner(userId, jobId))
-            throw new UnauthorizedAccessException("Job does not belong to this user.");
+            ;
 
         jobPersistence.DeleteJob(jobId);

[NoCoverage] String mutation
src/Services/Implementations/JobService.cs:120:51
     public void DeleteJob(int userId, int jobId)
     {
         if (!jobPersistence.IsJobOwner(userId, jobId))
-            throw new UnauthorizedAccessException("Job does not belong to this user.");
+            throw new UnauthorizedAccessException("");
 
         jobPersistence.DeleteJob(jobId);

[NoCoverage] Statement mutation
src/Services/Implementations/JobService.cs:122:9
         if (!jobPersistence.IsJobOwner(userId, jobId))
             throw new UnauthorizedAccessException("Job does not belong to this user.");
 
-        jobPersistence.DeleteJob(jobId);
+        ;
     }
 }
