[Killed] Block removal mutation
Services/Implementations/QuizGame/QuizGame.cs:12:5
     private QuizItem? current = null;
     private QuizGameStats quizGameStats;
     public QuizGame(IQuizItemFetcher quizItemFetcher)
-    {
-        this.quizItemFetcher = quizItemFetcher;
-        quizGameStats = new QuizGameStats();
-    }
+    {}
 
     /// Verify the answer selected by the user for the current question. 
killedBy: QuizGameConnectorTest.GetGameStatsResetNextSessionTest; QuizGameConnectorTest.GetNextQuizSessionFoundTest; QuizGameTest.CorrectAnswerTest

[Killed] Equality mutation
Services/Implementations/QuizGame/QuizGame.cs:21:13
     /// <param name="answer">The user's selected answer.</param>
     public void AnswerQuiz(string answer)
     {
-        if (current == null)
+        if (current != null)
         {
             throw new InvalidOperationException("Trying to answer quiz when no question ready!");
killedBy: QuizGameTest.AnswerBeforeInitializationTest; QuizGameTest.CorrectAnswerTest; QuizGameTest.DefaultWinLoseSkipTest

[Killed] Statement mutation
Services/Implementations/QuizGame/QuizGame.cs:23:13
     {
         if (current == null)
         {
-            throw new InvalidOperationException("Trying to answer quiz when no question ready!");
+            ;
         }
 
killedBy: QuizGameTest.AnswerBeforeInitializationTest; QuizGameTest.DoubleCorrectAnswerTest; QuizGameTest.DoubleCorrectIncorrectAnswerTest

[Killed] Negate expression
Services/Implementations/QuizGame/QuizGame.cs:26:13
             throw new InvalidOperationException("Trying to answer quiz when no question ready!");
         }
 
-        if (current.strongSentence.Equals(answer))
+        if (!(current.strongSentence.Equals(answer)))
         {
             quizGameStats.Correct++;
killedBy: QuizGameTest.CorrectAnswerTest; QuizGameTest.DefaultWinLoseSkipTest; QuizGameTest.DoubleCorrectAnswerTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Services/Implementations/QuizGame/QuizGame.cs:28:13
 
         if (current.strongSentence.Equals(answer))
         {
-            quizGameStats.Correct++;
+            quizGameStats.Correct--;
             current = null;
         }
killedBy: QuizGameTest.CorrectAnswerTest; QuizGameTest.DefaultWinLoseSkipTest; QuizGameTest.PerfectWinTest

[Killed] Statement mutation
Services/Implementations/QuizGame/QuizGame.cs:28:13
 
         if (current.strongSentence.Equals(answer))
         {
-            quizGameStats.Correct++;
+            ;
             current = null;
         }
killedBy: QuizGameTest.CorrectAnswerTest; QuizGameTest.DefaultWinLoseSkipTest; QuizGameTest.PerfectWinTest

[Killed] Negate expression
Services/Implementations/QuizGame/QuizGame.cs:31:18
             quizGameStats.Correct++;
             current = null;
         }
-        else if (current.weakSentence.Equals(answer))
+        else if (!(current.weakSentence.Equals(answer)))
         {
             quizGameStats.Incorrect++;
killedBy: QuizGameTest.DefaultWinLoseSkipTest; QuizGameTest.DoubleIncorrectAnswerTest; QuizGameTest.DoubleIncorrectCorrectAnswerTest

[Killed] Statement mutation
Services/Implementations/QuizGame/QuizGame.cs:33:13
         }
         else if (current.weakSentence.Equals(answer))
         {
-            quizGameStats.Incorrect++;
+            ;
             current = null;
         }
killedBy: QuizGameTest.DefaultWinLoseSkipTest; QuizGameTest.IncorrectAnswerTest; QuizGameTest.PerfectLoseTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Services/Implementations/QuizGame/QuizGame.cs:33:13
         }
         else if (current.weakSentence.Equals(answer))
         {
-            quizGameStats.Incorrect++;
+            quizGameStats.Incorrect--;
             current = null;
         }
killedBy: QuizGameTest.DefaultWinLoseSkipTest; QuizGameTest.DoubleIncorrectAnswerTest; QuizGameTest.DoubleIncorrectCorrectAnswerTest

[Killed] Statement mutation
Services/Implementations/QuizGame/QuizGame.cs:38:13
         }
         else
         {
-            throw new InvalidOperationException("Provided an answer that is not avaliable!");
+            ;
         }
     }
killedBy: QuizGameTest.RandomAnswerTest; QuizGameTest.SpamRandomAnswerTest

[Killed] Equality mutation
Services/Implementations/QuizGame/QuizGame.cs:48:16
     {
         try
         {
-            if(current != null)
+            if(current == null)
             {
                 quizGameStats.Skipped++;
killedBy: QuizGameTest.CorrectAnswerTest; QuizGameTest.DefaultWinLoseSkipTest; QuizGameTest.IncorrectAnswerTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Services/Implementations/QuizGame/QuizGame.cs:50:17
         {
             if(current != null)
             {
-                quizGameStats.Skipped++;
+                quizGameStats.Skipped--;
             }
 
killedBy: QuizGameConnectorTest.GetGameStatsResetNextSessionTest; QuizGameTest.DefaultWinLoseSkipTest; QuizGameTest.SkipOneTest

[Killed] Statement mutation
Services/Implementations/QuizGame/QuizGame.cs:50:17
         {
             if(current != null)
             {
-                quizGameStats.Skipped++;
+                ;
             }
 
killedBy: QuizGameConnectorTest.GetGameStatsResetNextSessionTest; QuizGameTest.DefaultWinLoseSkipTest; QuizGameTest.SkipOneTest

[Killed] Block removal mutation
Services/Implementations/QuizGame/QuizGame.cs:56:9
             current = quizItemFetcher.GetQuizItem();
         }
         catch (System.Exception)
-        {
-            return null;
-        }
+        {}
         return current;
     }
killedBy: test.QuizGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Block removal mutation
Services/Implementations/QuizGame/QuizGame.cs:65:5
     /// Get the current game statistics, including the number of correct, incorrect and skipped pairs.
     /// Returns a QuizGameStats object containing the stats.
     public QuizGameStats GetQuizGameStats()
-    {
-        return quizGameStats;
-    }
+    {}
 }
killedBy: QuizGameConnectorTest.GetGameStatsResetNextSessionTest; QuizGameTest.CorrectAnswerTest; QuizGameTest.DefaultWinLoseSkipTest
