[Killed] Block removal mutation
Services/Implementations/QuizGame/QuizGameConnector.cs:15:5
     private IQuizItemFetcherFactory quizItemFetcherFactory;
     private Dictionary<int, IQuizGame> gameServiceList = new Dictionary<int, IQuizGame>();
     public QuizGameConnector(IQuizItemFetcherFactory quizItemFetcherFactory)
-    {
-        this.quizItemFetcherFactory = quizItemFetcherFactory;
-    }
+    {}
 
     /// Initialize a job list for the game based on the provided filters. 
killedBy: QuizGameConnectorTest.GetGameStatsResetNextSessionTest; QuizGameConnectorTest.GetNextQuizSessionFoundTest; QuizGameServiceTest.UserDoesExistTest

[Killed] Block removal mutation
Services/Implementations/QuizGame/QuizGameConnector.cs:22:5
     /// Initialize a job list for the game based on the provided filters. 
     /// <param name="users">The user who is currently playing.
     public void InitializeSession(User user)
-    {
-        gameServiceList[user.UserId] = new QuizGame(quizItemFetcherFactory.BuildFetcher());
-    }
+    {}
 
     /// Verify the answer selected by the user for the current question. 
killedBy: QuizGameConnectorTest.GetGameStatsResetNextSessionTest; QuizGameConnectorTest.GetNextQuizSessionFoundTest

[Killed] Statement mutation
Services/Implementations/QuizGame/QuizGameConnector.cs:31:9
     /// <param name="answer">The user's selected answer.</param>
     public void AnswerQuiz(User user, string answer)
     {
-        CheckUserSession(user);
+        ;
         gameServiceList[user.UserId].AnswerQuiz(answer);
     }
killedBy: QuizGameConnectorTest.AnswerQuizNoSessionFoundTest

[NoCoverage] Statement mutation
Services/Implementations/QuizGame/QuizGameConnector.cs:32:9
     public void AnswerQuiz(User user, string answer)
     {
         CheckUserSession(user);
-        gameServiceList[user.UserId].AnswerQuiz(answer);
+        ;
     }
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/Implementations/QuizGame/QuizGameConnector.cs:57:13
     /// <param name="users">The user who is currently playing.
     private void CheckUserSession(User user)
     {
-        if (!gameServiceList.ContainsKey(user.UserId))
+        if (gameServiceList.ContainsKey(user.UserId))
         {
             throw new InvalidOperationException($"No Session Found for {user.UserId} for Quiz Game");
killedBy: QuizGameConnectorTest.AnswerQuizNoSessionFoundTest; QuizGameConnectorTest.GetGameStatsNoSessionFoundTest; QuizGameConnectorTest.GetGameStatsResetNextSessionTest

[Killed] Statement mutation
Services/Implementations/QuizGame/QuizGameConnector.cs:59:13
     {
         if (!gameServiceList.ContainsKey(user.UserId))
         {
-            throw new InvalidOperationException($"No Session Found for {user.UserId} for Quiz Game");
+            ;
         }
     }
killedBy: QuizGameConnectorTest.AnswerQuizNoSessionFoundTest; QuizGameConnectorTest.GetGameStatsNoSessionFoundTest; QuizGameConnectorTest.GetNextQuizNoSessionFoundTest
