[Killed] Block removal mutation
Services/Implementations/QuizGame/QuizGameService.cs:14:5
     private IQuizGameConnector quizGameConnector;
     private UserFinder userFinder;
     public QuizGameService(IUserPersistence userPersistence, IQuizItemsPersistence quizItemsPersistence)
-    {
-        IQuizItemFetcherFactory quizItemFactory = new RandomQuizItemFetcherFactory(quizItemsPersistence); 
-        userFinder = new UserFinder(userPersistence);
-        quizGameConnector = new QuizGameConnector(quizItemFactory);
-    }
+    {}
 
     /// Verify the answer selected by the user for the current question. 
killedBy: QuizGameServiceTest.UserDoesExistTest; test.QuizGameServiceIntegrationTest.RejectJobIntegrationTest

[Survived] Statement mutation
Services/Implementations/QuizGame/QuizGameService.cs:25:9
     /// <param name="answer">The user's selected answer.</param>
     public void AnswerQuiz(CurrentUser currentUser, QuizGameResponse answer)
     {
-        ValidateUser(currentUser);
+        ;
         if (answer.answer.Trim().Equals(string.Empty))
         {

[Survived] Negate expression
Services/Implementations/QuizGame/QuizGameService.cs:26:13
     public void AnswerQuiz(CurrentUser currentUser, QuizGameResponse answer)
     {
         ValidateUser(currentUser);
-        if (answer.answer.Trim().Equals(string.Empty))
+        if (!(answer.answer.Trim().Equals(string.Empty)))
         {
             throw new InvalidOperationException("Answer provided is empty");

[Survived] Statement mutation
Services/Implementations/QuizGame/QuizGameService.cs:28:13
         ValidateUser(currentUser);
         if (answer.answer.Trim().Equals(string.Empty))
         {
-            throw new InvalidOperationException("Answer provided is empty");
+            ;
         }
        

[NoCoverage] Statement mutation
Services/Implementations/QuizGame/QuizGameService.cs:31:9
             throw new InvalidOperationException("Answer provided is empty");
         }
        
-        quizGameConnector.AnswerQuiz(FetchUser(currentUser), answer.answer);
+        ;
     }
 

[Killed] Statement mutation
Services/Implementations/QuizGame/QuizGameService.cs:57:9
     public void InitializeSession(CurrentUser currentUser)
     {
         ValidateUser(currentUser);
-        quizGameConnector.InitializeSession(FetchUser(currentUser));
+        ;
     }
 
killedBy: test.QuizGameServiceIntegrationTest.RejectJobIntegrationTest

[Killed] Negate expression
Services/Implementations/QuizGame/QuizGameService.cs:64:13
     /// <param name="currentUser">The user to verify.</param>
     private void ValidateUser(CurrentUser currentUser)
     {
-        if (currentUser.UserId < 0)
+        if (!(currentUser.UserId < 0))
         {
             throw new InvalidOperationException("UserId provided is negative");
killedBy: QuizGameServiceTest.UserDoesExistTest; test.QuizGameServiceIntegrationTest.RejectJobIntegrationTest

[Survived] Statement mutation
Services/Implementations/QuizGame/QuizGameService.cs:66:13
     {
         if (currentUser.UserId < 0)
         {
-            throw new InvalidOperationException("UserId provided is negative");
+            ;
         }
     }
