[NoCoverage] Block removal mutation
Services/Implementations/QuizGame/QuizGameSingleton.cs:13:5
     private IQuizGameService server;
     
     public QuizGameSingleton(IServiceScopeFactory scopeFactory)
-    {
-        using var scope = scopeFactory.CreateScope();
-        IUserPersistence userPersistence = scope.ServiceProvider.GetRequiredService<IUserPersistence>();
-        IQuizItemsPersistence quizItemsPersistence = scope.ServiceProvider.GetRequiredService<IQuizItemsPersistence>();
-
-        server = new QuizGameService(userPersistence, quizItemsPersistence);
-    }
+    {}
 
     /// Verify the answer selected by the user for the current question. 

[NoCoverage] Equality mutation
Services/Implementations/QuizGame/QuizGameSingleton.cs:26:13
     /// <param name="answer">The user's selected answer.</param>
     public void AnswerQuiz(CurrentUser currentUser, QuizGameResponse answer)
     {
-        if (server == null) throw new InvalidOperationException("Quiz Game Server not initialized.");
+        if (server != null) throw new InvalidOperationException("Quiz Game Server not initialized.");
         server.AnswerQuiz(currentUser, answer);
     }

[NoCoverage] Statement mutation
Services/Implementations/QuizGame/QuizGameSingleton.cs:26:29
     /// <param name="answer">The user's selected answer.</param>
     public void AnswerQuiz(CurrentUser currentUser, QuizGameResponse answer)
     {
-        if (server == null) throw new InvalidOperationException("Quiz Game Server not initialized.");
+        if (server == null) ;
         server.AnswerQuiz(currentUser, answer);
     }

[NoCoverage] Statement mutation
Services/Implementations/QuizGame/QuizGameSingleton.cs:27:9
     public void AnswerQuiz(CurrentUser currentUser, QuizGameResponse answer)
     {
         if (server == null) throw new InvalidOperationException("Quiz Game Server not initialized.");
-        server.AnswerQuiz(currentUser, answer);
+        ;
     }
 

[NoCoverage] Statement mutation
Services/Implementations/QuizGame/QuizGameSingleton.cs:53:9
     public void InitializeSession(CurrentUser currentUser)
     {
         if (server == null) throw new InvalidOperationException("Quiz Game Server not initialized.");
-        server.InitializeSession(currentUser);
+        ;
     }
 }
