[Survived] Block removal mutation
Services/Implementations/QuizGame/QuizItemFetcherFactory.cs:13:5
     /// Allows code to send spies to IQuizGameConnector. 
     /// Returns a quiz item fetcher. 
     public IQuizItemFetcher BuildFetcher()
-    {
-        return new QuizItemRandomFetcher(quizItemsPersistence);
-    }
+    {}
 }
