[Killed] Statement mutation
Services/Implementations/QuizGame/QuizItemRandomFetcher.cs:19:9
     {
         List<QuizItem> quizes = quizItemsPersistence.GetQuizItems(AppConfig.QUIZ_ITEM_AMOUNT);
         QuizItem[] shuffled = quizes.ToArray();
-        Random.Shared.Shuffle(shuffled);  
+        ;  
         quizItems = new Queue<QuizItem>(shuffled.ToList());
     }
killedBy: test.QuizGameServiceIntegrationTest.RejectJobIntegrationTest

[Survived] Equality mutation
Services/Implementations/QuizGame/QuizItemRandomFetcher.cs:27:13
     /// Returns 1 quiz item at a time
     public QuizItem GetQuizItem()
     {
-        if (quizItems.Count() <= 0)
+        if (quizItems.Count() > 0)
         {
             throw new InvalidOperationException("No more Quiz Items"); 

[Survived] Negate expression
Services/Implementations/QuizGame/QuizItemRandomFetcher.cs:27:13
     /// Returns 1 quiz item at a time
     public QuizItem GetQuizItem()
     {
-        if (quizItems.Count() <= 0)
+        if (!(quizItems.Count() <= 0))
         {
             throw new InvalidOperationException("No more Quiz Items"); 

[Survived] Statement mutation
Services/Implementations/QuizGame/QuizItemRandomFetcher.cs:29:13
     {
         if (quizItems.Count() <= 0)
         {
-            throw new InvalidOperationException("No more Quiz Items"); 
+            ; 
         }
 
