[NoCoverage] Null coalescing mutation (remove left)
src/Services/Implementations/UserService.cs:24:26
     /// If null or empty, no filters will be applied and all users will be returned.
     public List<User> GetUsers(IReadOnlyDictionary<string, string>? filters = null)
     {
-        var searchTerm = filters?.GetValueOrDefault(AppConfig.FilterKeys.SEARCH_TERM) ?? "";
+        var searchTerm = "";
         var pageNumber = int.TryParse(filters?.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pg) ? pg : 1;
         var startIndex = (pageNumber - 1) * AppConfig.ITEMS_PER_PAGE;

[NoCoverage] String mutation
src/Services/Implementations/UserService.cs:24:90
     /// If null or empty, no filters will be applied and all users will be returned.
     public List<User> GetUsers(IReadOnlyDictionary<string, string>? filters = null)
     {
-        var searchTerm = filters?.GetValueOrDefault(AppConfig.FilterKeys.SEARCH_TERM) ?? "";
+        var searchTerm = filters?.GetValueOrDefault(AppConfig.FilterKeys.SEARCH_TERM) ?? "Stryker was here!";
         var pageNumber = int.TryParse(filters?.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pg) ? pg : 1;
         var startIndex = (pageNumber - 1) * AppConfig.ITEMS_PER_PAGE;

[NoCoverage] Arithmetic mutation
src/Services/Implementations/UserService.cs:26:26
     {
         var searchTerm = filters?.GetValueOrDefault(AppConfig.FilterKeys.SEARCH_TERM) ?? "";
         var pageNumber = int.TryParse(filters?.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pg) ? pg : 1;
-        var startIndex = (pageNumber - 1) * AppConfig.ITEMS_PER_PAGE;
+        var startIndex = (pageNumber - 1) / AppConfig.ITEMS_PER_PAGE;
 
         if (filters != null && bool.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYER), out var employer))

[NoCoverage] Arithmetic mutation
src/Services/Implementations/UserService.cs:26:27
     {
         var searchTerm = filters?.GetValueOrDefault(AppConfig.FilterKeys.SEARCH_TERM) ?? "";
         var pageNumber = int.TryParse(filters?.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pg) ? pg : 1;
-        var startIndex = (pageNumber - 1) * AppConfig.ITEMS_PER_PAGE;
+        var startIndex = (pageNumber + 1) * AppConfig.ITEMS_PER_PAGE;
 
         if (filters != null && bool.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYER), out var employer))

[NoCoverage] Equality mutation
src/Services/Implementations/UserService.cs:28:13
         var pageNumber = int.TryParse(filters?.GetValueOrDefault(AppConfig.FilterKeys.PAGE_NUMBER), out var pg) ? pg : 1;
         var startIndex = (pageNumber - 1) * AppConfig.ITEMS_PER_PAGE;
 
-        if (filters != null && bool.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYER), out var employer))
+        if (filters == null && bool.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYER), out var employer))
         {
             return userPersistence.GetUsers(searchTerm, employer, startIndex, AppConfig.ITEMS_PER_PAGE);

[NoCoverage] Block removal mutation
src/Services/Implementations/UserService.cs:29:9
         var startIndex = (pageNumber - 1) * AppConfig.ITEMS_PER_PAGE;
 
         if (filters != null && bool.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.EMPLOYER), out var employer))
-        {
-            return userPersistence.GetUsers(searchTerm, employer, startIndex, AppConfig.ITEMS_PER_PAGE);
-        }
+        {}
 
         // No employer filter — return both employers and job seekers

[NoCoverage] Boolean mutation
src/Services/Implementations/UserService.cs:34:62
         }
 
         // No employer filter — return both employers and job seekers
-        var employers = userPersistence.GetUsers(searchTerm, true, startIndex, AppConfig.ITEMS_PER_PAGE);
+        var employers = userPersistence.GetUsers(searchTerm, false, startIndex, AppConfig.ITEMS_PER_PAGE);
         var seekers = userPersistence.GetUsers(searchTerm, false, startIndex, AppConfig.ITEMS_PER_PAGE);
         return [..employers, ..seekers];

[NoCoverage] Boolean mutation
src/Services/Implementations/UserService.cs:35:60
 
         // No employer filter — return both employers and job seekers
         var employers = userPersistence.GetUsers(searchTerm, true, startIndex, AppConfig.ITEMS_PER_PAGE);
-        var seekers = userPersistence.GetUsers(searchTerm, false, startIndex, AppConfig.ITEMS_PER_PAGE);
+        var seekers = userPersistence.GetUsers(searchTerm, true, startIndex, AppConfig.ITEMS_PER_PAGE);
         return [..employers, ..seekers];
     }

[Killed] Statement mutation
src/Services/Implementations/UserService.cs:83:13
     {
         if (filters == null)
         {
-            throw new InvalidOperationException("Invalid filter parameters");
+            ;
         }
         var userId = int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.USERID), out var uId) ? uId : 0;
killedBy: Tests.UserServiceTest.SaveWithNullFilters

[Killed] Equality mutation
src/Services/Implementations/UserService.cs:88:13
         var userId = int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.USERID), out var uId) ? uId : 0;
         var jobId = int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.JOBID), out var jId) ? jId : 0;
 
-        if (userId == 0)
+        if (userId != 0)
         {
             throw new InvalidOperationException("Invalid user id.");
killedBy: test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest; test.UserServiceIntegrationTest.SaveJobIntegrationTest; Tests.UserServiceTest.SaveJobFromInvalidUser

[Killed] Statement mutation
src/Services/Implementations/UserService.cs:90:13
 
         if (userId == 0)
         {
-            throw new InvalidOperationException("Invalid user id.");
+            ;
         }
 
killedBy: Tests.UserServiceTest.SaveJobFromInvalidUser

[Killed] Equality mutation
src/Services/Implementations/UserService.cs:93:13
             throw new InvalidOperationException("Invalid user id.");
         }
 
-        if (jobId == 0)
+        if (jobId != 0)
         {
             throw new InvalidOperationException("Invalid job id.");
killedBy: test.JobServiceIntegrationTest.GetSavedJobsIntegrationTest; test.UserServiceIntegrationTest.SaveJobIntegrationTest; Tests.UserServiceTest.SaveInvalidJob

[Killed] Statement mutation
src/Services/Implementations/UserService.cs:95:13
 
         if (jobId == 0)
         {
-            throw new InvalidOperationException("Invalid job id.");
+            ;
         }
 
killedBy: Tests.UserServiceTest.SaveInvalidJob

[Survived] String mutation
src/Services/Implementations/UserService.cs:95:49
 
         if (jobId == 0)
         {
-            throw new InvalidOperationException("Invalid job id.");
+            throw new InvalidOperationException("");
         }
 

[Timeout] Negate expression
src/Services/Implementations/UserService.cs:100:13
 
 
 
-        if (userPersistence.IsJobInLikes(userId, jobId))
+        if (!(userPersistence.IsJobInLikes(userId, jobId)))
         {
             throw new InvalidOperationException("This job has already been liked by this user");

[Killed] Statement mutation
src/Services/Implementations/UserService.cs:102:13
 
         if (userPersistence.IsJobInLikes(userId, jobId))
         {
-            throw new InvalidOperationException("This job has already been liked by this user");
+            ;
         }
         return userPersistence.SaveJob(userId, jobId);
killedBy: Tests.UserServiceTest.SaveAlreadyLikedJob

[Survived] String mutation
src/Services/Implementations/UserService.cs:117:49
     {
         if (filters == null)
         {
-            throw new InvalidOperationException("Invalid filter parameters");
+            throw new InvalidOperationException("");
         }
         var userId = int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.USERID), out var uId) ? uId : 0;

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Services/Implementations/UserService.cs:122:13
         var userId = int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.USERID), out var uId) ? uId : 0;
         var jobId = int.TryParse(filters.GetValueOrDefault(AppConfig.FilterKeys.JOBID), out var jId) ? jId : 0;
         
-        if (!userPersistence.IsJobInLikes(userId, jobId))
+        if (userPersistence.IsJobInLikes(userId, jobId))
         {
             throw new InvalidOperationException("This job has not already been liked by this user");
killedBy: Tests.UserServiceTest.UnsaveJobNotLikedYetThrowsException; Tests.UserServiceTest.UnsaveJobValidInputs

[Killed] Statement mutation
src/Services/Implementations/UserService.cs:124:13
         
         if (!userPersistence.IsJobInLikes(userId, jobId))
         {
-            throw new InvalidOperationException("This job has not already been liked by this user");
+            ;
         }
         return userPersistence.UnsaveJob(userId, jobId);
killedBy: Tests.UserServiceTest.UnsaveJobNotLikedYetThrowsException

[Killed] Equality mutation
src/Services/Implementations/UserService.cs:135:13
     public int Login(LoginRequest loginRequest)
     {
         var user = userPersistence.GetUserByCredentials(loginRequest.Email.ToLower(), loginRequest.Password);
-        if (user is null || !user.Verified)
+        if (user is not null || !user.Verified)
             throw new InvalidOperationException("Invalid username or password.");
         return user.UserId;
killedBy: test.UserServiceIntegrationTest.LoginIntegrationTest; Tests.UserServiceTest.LoginWithBadCredentials; Tests.UserServiceTest.LoginWithValidCredentials

[Killed] Logical mutation
src/Services/Implementations/UserService.cs:135:13
     public int Login(LoginRequest loginRequest)
     {
         var user = userPersistence.GetUserByCredentials(loginRequest.Email.ToLower(), loginRequest.Password);
-        if (user is null || !user.Verified)
+        if (user is null && !user.Verified)
             throw new InvalidOperationException("Invalid username or password.");
         return user.UserId;
killedBy: test.UserServiceIntegrationTest.LoginIntegrationTest; Tests.UserServiceTest.LoginWithBadCredentials

[Killed] Statement mutation
src/Services/Implementations/UserService.cs:136:13
     {
         var user = userPersistence.GetUserByCredentials(loginRequest.Email.ToLower(), loginRequest.Password);
         if (user is null || !user.Verified)
-            throw new InvalidOperationException("Invalid username or password.");
+            ;
         return user.UserId;
     }
killedBy: Tests.UserServiceTest.LoginWithBadCredentials

[Killed] Negate expression
src/Services/Implementations/UserService.cs:148:13
     {
         var email = newUser.Email.ToLower();
         User savedUser;
-        if (newUser.IsEmployer)
+        if (!(newUser.IsEmployer))
         {
             savedUser = new User(
killedBy: test.UserServiceIntegrationTest.CreateUserIntegrationTest

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
src/Services/Implementations/UserService.cs:151:17
         if (newUser.IsEmployer)
         {
             savedUser = new User(
-                -1,
+                +1,
                 email,
                 newUser.Username,

[Killed] Equality mutation
src/Services/Implementations/UserService.cs:198:13
     {
         UserFinder userFinder = new UserFinder(userPersistence);
         User? user = userFinder.GetUserByUsername(username);
-        if (user == null)
+        if (user != null)
         {
             throw new NullReferenceException("User not found.");
killedBy: Tests.UserServiceTest.GetValidProfileByUsername

[Survived] String mutation
src/Services/Implementations/UserService.cs:200:46
         User? user = userFinder.GetUserByUsername(username);
         if (user == null)
         {
-            throw new NullReferenceException("User not found.");
+            throw new NullReferenceException("");
         }
         var postedJobs = jobPersistence.GetJobsByUsername(user.Username);

[NoCoverage] Block removal mutation
src/Services/Implementations/UserService.cs:210:5
     /// <param name="userId">An id corresponding to the user to check.
     /// Returns true if the user is an employer, false if the user is a job seeker. 
     public bool CheckUserEmployer(int userId)
-    {
-        return userPersistence.CheckUserEmployer(userId);
-    }
+    {}
 
 

[Survived] Null coalescing mutation (remove right)
src/Services/Implementations/UserService.cs:222:25
     public Profile UpdateUser(UpdateUserRequest request, int userId)
     {
         UserFinder userFinder = new UserFinder(userPersistence);
-        User existing = userFinder.GetUser(userId) ?? throw new InvalidOperationException("User not found.");
+        User existing = userFinder.GetUser(userId);
 
         User updatedUser;

[NoCoverage] String mutation
src/Services/Implementations/UserService.cs:222:91
     public Profile UpdateUser(UpdateUserRequest request, int userId)
     {
         UserFinder userFinder = new UserFinder(userPersistence);
-        User existing = userFinder.GetUser(userId) ?? throw new InvalidOperationException("User not found.");
+        User existing = userFinder.GetUser(userId) ?? throw new InvalidOperationException("");
 
         User updatedUser;

[Killed] Negate expression
src/Services/Implementations/UserService.cs:225:13
         User existing = userFinder.GetUser(userId) ?? throw new InvalidOperationException("User not found.");
 
         User updatedUser;
-        if (existing.IsEmployer)
+        if (!(existing.IsEmployer))
         {
             updatedUser = new User(userId, existing.Email, request.Username ?? existing.Username, existing.Password, request.About ?? "", request.EmployerName ?? existing.EmployerName ?? "");
killedBy: test.UserServiceIntegrationTest.UpdateUserIntegrationTest

[NoCoverage] Null coalescing mutation (remove left)
src/Services/Implementations/UserService.cs:227:60
         User updatedUser;
         if (existing.IsEmployer)
         {
-            updatedUser = new User(userId, existing.Email, request.Username ?? existing.Username, existing.Password, request.About ?? "", request.EmployerName ?? existing.EmployerName ?? "");
+            updatedUser = new User(userId, existing.Email, existing.Username, existing.Password, request.About ?? "", request.EmployerName ?? existing.EmployerName ?? "");
         }
         else

[NoCoverage] Null coalescing mutation (remove left)
src/Services/Implementations/UserService.cs:227:118
         User updatedUser;
         if (existing.IsEmployer)
         {
-            updatedUser = new User(userId, existing.Email, request.Username ?? existing.Username, existing.Password, request.About ?? "", request.EmployerName ?? existing.EmployerName ?? "");
+            updatedUser = new User(userId, existing.Email, request.Username ?? existing.Username, existing.Password, "", request.EmployerName ?? existing.EmployerName ?? "");
         }
         else

[NoCoverage] Negate expression
src/Services/Implementations/UserService.cs:244:13
     /// Returns the newly added experience's id. 
     public int AddExperience(int userId, Experience experience)
     {
-        if (userPersistence.CheckUserEmployer(userId))
+        if (!(userPersistence.CheckUserEmployer(userId)))
         {
             throw new InvalidOperationException("Only job seekers can add experiences.");

[NoCoverage] Statement mutation
src/Services/Implementations/UserService.cs:246:13
     {
         if (userPersistence.CheckUserEmployer(userId))
         {
-            throw new InvalidOperationException("Only job seekers can add experiences.");
+            ;
         }
 

[NoCoverage] Statement mutation
src/Services/Implementations/UserService.cs:259:13
     public void EditExperience(int userId, Experience oldExperience, Experience newExperience)
     {
         if (userPersistence.CheckUserEmployer(userId))
-            throw new InvalidOperationException("Only job seekers can edit experiences.");
+            ;
 
         userPersistence.UpdateExperience(userId, oldExperience, newExperience);

[NoCoverage] String mutation
src/Services/Implementations/UserService.cs:259:49
     public void EditExperience(int userId, Experience oldExperience, Experience newExperience)
     {
         if (userPersistence.CheckUserEmployer(userId))
-            throw new InvalidOperationException("Only job seekers can edit experiences.");
+            throw new InvalidOperationException("");
 
         userPersistence.UpdateExperience(userId, oldExperience, newExperience);

[NoCoverage] Statement mutation
src/Services/Implementations/UserService.cs:261:9
         if (userPersistence.CheckUserEmployer(userId))
             throw new InvalidOperationException("Only job seekers can edit experiences.");
 
-        userPersistence.UpdateExperience(userId, oldExperience, newExperience);
+        ;
     }
 

[NoCoverage] Statement mutation
src/Services/Implementations/UserService.cs:270:13
     public void DeleteExperience(int userId, Experience experience)
     {
         if (userPersistence.CheckUserEmployer(userId))
-            throw new InvalidOperationException("Only job seekers can delete experiences.");
+            ;
 
         userPersistence.DeleteExperience(userId, experience);

[NoCoverage] Statement mutation
src/Services/Implementations/UserService.cs:272:9
         if (userPersistence.CheckUserEmployer(userId))
             throw new InvalidOperationException("Only job seekers can delete experiences.");
 
-        userPersistence.DeleteExperience(userId, experience);
+        ;
     }
 

[NoCoverage] Statement mutation
src/Services/Implementations/UserService.cs:277:9
 
     public void VerifyUser(string token)
     {
-        userPersistence.VerifyUser(token);
+        ;
     }
 }
